'use client';

 

export default function Quddusda() {
  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>Қуддусда</p>
      </div>

      <div className="main_text">
        <p>
          Кейин сафарга бел боғлаб, Қуддусга қараб йўлга чиқдик. Қайсариядаги
          биродарлардан бир нечтаси ҳамроҳлик қилиб бизни Манос деган одамнинг
          уйига олиб бордилар. Манос асли Кипрлик бўлиб, расулуллоҳга илгаридан
          имон келтирган одамлардан бири эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Қуддусдаги биродарлар бизни хурсанд бўлиб кутиб олдилар. Эртасига
          Толут (р.а.) билан бирга Яъқуб (р.а.) ни кўргани бордик. Жамоа
          оқсоқоллари ҳам йиғилган экан.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ҳол-аҳвол сўрашгандан сўнг, Толут (р.а.) ўз хизмати давомида Оллоҳ
          таолонинг ғайри яҳудийлар орасида қилган ишларини бирма-бир айтиб
          бердилар. Эшитганлар Худога ҳамду сано айтишди. Кейин Толут (р.а.) га
          қараб:
        </p>
      </div>

      <div className="main_text">
        <p>
          «Биродар, бу ерда минглаб яҳудийлар расулуллоҳга имон келтирган,
          биласан, — дейишди. — Уларнинг ҳаммаси Таврот аҳкомига қаттиқ риоя
          қилади. Сен тўғрингда эса ҳар хил гаплар юрибди. Айтишларича, хорижда
          яшайдиган яҳудийларга: “Урф-одатларингизни ташланг, ўғилларингизни
          хатна қилманг, Тавротга итоат этманг”, деб таълим берган экансан.
          Шунга нима қилсак тўғри бўлади? Бу ерга келганингни улар албатта
          эшитади.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бизнинг таклифимиз бундай: орамизда бўйнига назр олган тўрт киши бор.
          Сен улар билан бирга таҳорат ол. Сочларингизни олдиргач, қурбонлик
          ҳаққини ўзинг тўла. Шунда сен ҳақингдаги миш-мишлар ёлғон экани
          ҳаммага маълум бўлади. Ғайри яҳудий имонлиларга келсак, улар ўша
          мактубимизда ёзилганидек, бутларга аталган ё қони чиқмай ўлган ҳайвон
          гўштини емаса, қон истеъмол қилмаса, зинодан ўзларини асраса бас».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Толут (р.а.) нинг ҳибсга олиниши</p>
      </div>

      <div className="main_text">
        <p>
          У киши рози бўлдилар. Эртаси куни ўша тўртта одам билан таҳорат
          маросимида иштирок этдилар. Кейин ҳаммалари Байтуллоҳга бориб таҳорат
          кунлари қачон тугашини, ҳар ким учун қурбонлик қачон сўйилишини маълум
          қилишди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Етти кунлик муддат тугай деб қолганда Осиё вилоятидан келган баъзи
          яҳудийлар Толут (р.а.) ни Байтуллоҳда кўриб қолиб, халқни у кишига
          қарши қўзғадилар. Толут (р.а.) ни ушлаб:
        </p>
      </div>

      <div className="main_text">
        <p>
          «Эй Бани Исроил, ёрдам беринглар! — деб бақира бошладилар. — Бу одам
          халқимизга ва Байтуллоҳга қарши гаплар айтади, ҳаммани Тавротга
          бўйсунмасликка тарғиб қилади. Энди эса юнонларни олиб келиб,
          Байтуллоҳни нажис қилди». (Улар ўша куни эрталаб Толут (р.а.) ни
          афасуслик Трўфимус деган ғайри яҳудий билан шаҳарда кўрган, ва энди уни
          Байтуллоҳга олиб кирибди, деб ўйлаган эдилар.)
        </p>
      </div>

      <div className="main_text">
        <p>
          Бутун шаҳар ҳаракатга келиб, катта бир ғавғо бошланди. Толут (р.а.) ни
          Байтуллоҳдан судраб олиб чиқдилар. Дарров эшикларни беркитишди. Оломон
          Толут (р.а.) ни ўлдириш учун калтаклаётган вақтда, Рум қўмондони
          “Қуддусда исён бошланди”, деб эшитиб, дарҳол қўл остидаги йигитлари
          билан етиб келди. Уларни кўрган халқ уришдан тўхтади.
        </p>
      </div>

      <div className="main_text">
        <p>
          Қўмондон Толут (р.а.) ни ушлаб, икки занжир билан боғлашга буюрди.
          Кейин: «Ким бу одам? Нима қилди?» деб сўради. Биров бир нарса деб
          бақирса, бошқалари бошқа нарса дер эди. Бақир-чақирдан жавоб ололмаган
          қўмондон Толут (р.а.) ни қалъага олиб боришни буюрди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Қалъа зиналарига келган пайтда халқнинг тўполони шунчалик кучайдики,
          аскарлар Толут (р.а.) ни елкаларида кўтариб боришга мажбур бўлдилар.
          Оломон уларнинг орқасидан: «Унга ўлим, унга ўлим! Ўлдиринглар уни!» деб
          бақираётган эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Қалъага кирар эканлар, Толут (р.а.) қўмондонга: «Сизга бир нарса десам
          майлими?» деди.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Юнон тилини биласанми? — деди қўмондон ҳайрон бўлиб. — Исён кўтариб,
          тўрт минг қотил билан чўлга қочган мисрлик сенмисан?»
        </p>
      </div>

      <div className="main_text">
        <p>
          «Йўқ, мен яҳудийман, Қилиқиянинг муҳим шаҳарларидан бири Тарсусда
          туғилганман. Халққа икки оғиз гап айтишга рухсат берсангиз».
        </p>
      </div>

      <div className="main_text">
        <p>
          Қўмондон рухсат бергач, Толут (р.а.) зинада туриб, қўли билан халққа
          ишора қилди. Ғала-ғовур босилгач арамий тилида гапира бошладилар.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Толут (р.а.) нинг шаҳодати</p>
      </div>

      <div className="main_text">
        <p>
          «Азиз биродарлар, ҳурматли отахонлар, қулоқ солинглар, мен ўзимнинг
          ким эканимни сизларга тушунтирай».
        </p>
      </div>

      <div className="main_text">
        <p>
          Толут (р.а.) нинг арамийча гапираётганини эшитиб, оломон яна-да
          тинчланди.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Мен ҳам яҳудийман. Қилиқиянинг Тарсус шаҳрида дунёга келганман. Лекин
          мана шу Қуддусда, устозимиз Гамалаил қўлида тарбия топдим. Аҳком ва
          қоидаларимизни шу кишининг оёқлари остида ўргандим. Сизларга ўхшаб
          Оллоҳ учун ғайратим жуда кучли эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Тариқатга кирганларни ўлиму қувғин билан таъқиб қилардим. Эркагу аёл
          демай зиндонга ташлардим. Олийруҳоний ҳам, оқсоқоллар ҳам гапларим
          ростлигига шоҳид.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бир сафар Дамашққа кетаётганимда улар менга Дамашқдаги биродарлар учун
          хат ёзиб беришди. Мақсадим у ердаги тариқатчиларни кишанлаб Қуддусга
          олиб келиш эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Йўлда кетар эканмиз, Дамашққа яқинлашганда, туш чоғида, бирдан
          осмондан кўзни қамаштирадиган бир нур чарақлаб ҳамма ёқни ёритиб
          юборди. Мен ерга йиқилдим. Шунда бир овоз менга: «Толут, Толут! Нега
          менга зулм қиляпсан?» деди.
        </p>
      </div>

      <div className="main_text">
        <p>«Кимсиз, ё ҳазратим?» деб сўрадим мен.</p>
      </div>

      <div className="main_text">
        <p>
          «Сен зулм қилаётган носиралик Исоман», деди овоз. Йўлдошларим нурни
          кўрса ҳам, мен билан гаплашганнинг сўзларини тушунмадилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Ё ҳазратим, мен энди нима қилай?» деб сўраган эдим, овоз: «Тур,
          Дамашққа бор. Ўша ерда сенга нима қилишинг кераклиги айтилади», деди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Нурнинг кучидан кўзларим ҳеч нарсани кўрмай қолган эди. Ҳамроҳларим
          қўлимдан ушлаб Дамашққа олиб бордилар. Кейин Ҳанониё деган бир одам
          мени излаб келди. Уни Дамашқдаги ҳамма яҳудийлар ҳурмат қилар, ўзи ҳам
          шариатга риоя қиладиган тақводор киши эди.
        </p>
      </div>

      <div className="main_text">
        <p>У келиб: «Биродарим Толут, кўзларинг очилсин!» деди. Дейиши билан кўзларим кўра бошлади.</p>
      </div>

      <div className="main_text">
        <p>
          У менга: «Ота-боболаримиз Худоси сенга Ўз иродасини нозил қилибди.
          Инсони Солиҳ билан учрашишингни, гапларини эшитишингни маъқул топибди.
          Сен энди кўрган-эшитганларинг ҳақида ҳамма одамларга гувоҳлик берасан.
          Тур! Нимани кутиб турибсан? Ғусл олиб расулуллоҳга имон келтир,
          гуноҳларингдан фориғ бўл!» деди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Қуддусга қайтганимдан сўнг, Байтуллоҳда дуо қилаётган эдим рўё кўрдим.
          Рўёда Исо (а.с.) менга: «Тез бўл, Қуддусдан кет, чунки бу шаҳар сенинг
          мен ҳақимда берадиган гувоҳлигингни қабул қилмайди», дедилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Мен эса: «Ё ҳазратим, улар менинг тиловатхонама-тиловатхона юриб сизга
          имон келтирганларни калтаклаб зиндонга солганимни билишади-ку! — дедим.
          — Шоҳидингиз Мансурнинг қони тўкилганда ҳам мен бор эдим. Уни
          ўлдираётганларнинг кийимларига қараб турган эдим».
        </p>
      </div>

      <div className="main_text">
        <p>
          Лекин расулуллоҳ менга: «Қуддусдан кет, мен сени узоқларга, ғайри
          яҳудийлар олдига юбормоқчиман», дедилар».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Рум турғуни</p>
      </div>

      <div className="main_text">
        <p>
          Оломон шу ергача Толут (р.а.) нинг гапларини индамай эшитиб турган
          эди. Ғайри яҳудийлар деган сўзни эшитиб: «Бу одамни йўқ қилиш керак!
          Уни ўлдиринглар! Унинг яшашга ҳаққи йўқ!» деб бақира бошладилар.
          Баъзилари кўйлакларини ечган, баъзилари ҳавога тупроқ тўзғитаётган эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Буни кўрган қўмондон: «Уни қалъага олиб кириб қамчилаб, сўроқ
          қилинглар, айбини аниқланглар», деди. Толут (р.а.) ни қамчилаш учун
          боғлаётганларида, у киши ёнида турган юзбошидан: «Рум турғунини
          судсиз-ҳукмсиз қамчилашга қонун рухсат берадими?» деб сўрадилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Юзбоши буни эшитиб қўмондоннинг олдига борди: «Нима қиляпсиз?! Бу одам
          ахир Рум турғуни экан!» Қўмондон келиб:
        </p>
      </div>

      <div className="main_text">
        <p>--Сиз Рум турғунисизми? -- деб сўради.</p>
      </div>

      <div className="main_text">
        <p>--Ҳа.</p>
      </div>

      <div className="main_text">
        <p>--Мен турғунлик олиш учун кўп пул тўладим, -- деди қўмондон.</p>
      </div>

      <div className="main_text">
        <p>--Мен эса турғун бўлиб туғилганман, -- дедилар Толут (р.а.).</p>
      </div>

      <div className="main_text">
        <p>
          Тергов қилмоқчи бўлиб турган аскарлар, у кишининг Рум турғуни эканини
          эшитиб, дарров чиқиб кетишди. Қўмондон ҳам қаттиқ қўрқиб кетган эди.
        </p>
      </div>
    </main>
  );
}