'use client';

import '../../../qisas-uzb/stories.css';

export default function MenSezarningHukminiTalabQilaman() {
  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>“Мен Цезарнинг ҳукмини талаб қиламан”</p>
      </div>

      <div className="main_text">
        <p>
          Фестус ҳоким бўлгач уч кундан сўнг Қайсариядан Қуддусга сафар қилди.
          Шунда бош руҳонийлар билан яҳудий оқсоқоллари Фестуснинг олдига келиб,
          Толут (р.а.) ни айблаб, уни Қуддусга юборинг, деб илтимос қилдилар.
          (Чунки йўлда пистирма қўйиб, уни ўлдирмоқчи эдилар.)
        </p>
      </div>

      <div className="main_text">
        <p>
          Лекин Фестус: «Толут ҳозир Қайсарияда, мен ўзим ҳам яқинда у ерга
          бораман. Раҳбар кишилардан бир нечангиз мен билан Қайсарияга
          боринглар. Агар бирон жинояти бўлса, унга қарши даъво очишингиз
          мумкин», деди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Саккиз-ўн кун ўтгач Фестус Қайсарияга қайтди. Эртасига Толут (р.а.)
          нинг суд жараёни бошланди. Қуддусдан келган яҳудийлар Толут (р.а.)
          ни ўраб олиб, кўп оғир жиноятлар қилишда айбладилар. Лекин
          биронтасини ҳам исбот қилишолмади.
        </p>
      </div>

      <div className="main_text">
        <p>
          Толут (р.а.) қўйилган ҳамма айбларни рад қилиб: «Мен динимиз
          қонунларига ҳам, Байтуллоҳга ҳам ҳурматсизлик қилганим йўқ. Рум
          давлатига қарши ҳеч қандай ишга қўл урмадим», дедилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Фестус яҳудийларга ёқиш учун Толутдан: «Қуддусга бориб, менинг
          қўлимда муҳокама бўлишга розимисиз?» деб сўради.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Йўқ! — дедилар у киши. — Мен Императорнинг ҳукм курсиси олдида
          турибман. Шу ерда суд бўлишим керак. Бегуноҳ эканимни ўзингиз яхши
          биласиз. Агар ўлимга лойиқ иш қилган бўлсам, майли, ўлишга
          тайёрман. Лекин гуноҳим бўлмаса, ҳеч ким мени уларнинг қўлига
          топширолмайди. Мен Цезарнинг ҳукмини талаб қиламан».
        </p>
      </div>

      <div className="main_text">
        <p>
          Шундан сўнг Фестус маслаҳатчилари билан кенгашди-да: «Яхши, Цезарь
          ҳукмини талаб қилсангиз, Цезарнинг олдига борасиз», деди.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Агриппанинг ташрифи</p>
      </div>

      <div className="main_text">
        <p>
          Бир неча кундан сўнг шоҳ Агриппа синглиси Барники билан Фестусни
          кўриш учун Қайсарияга келди. Анча вақт бирга бўлганлари учун фурсат
          очилиб, Фестус подшоҳга Толут ҳақида гапириб қолди:
        </p>
      </div>

      <div className="main_text">
        <p>
          «Бу ерда Феликс мен келишимдан аввал, бир одамни зиндонда ушлаб
          турган экан. Қуддусга борганимда, яҳудий руҳонийлари ундан шикоят
          қилиб, ўлим жазосига ҳукм қилишимни сўради.
        </p>
      </div>

      <div className="main_text">
        <p>
          Мен уларга, Рум қонуни бўйича муҳокамасиз ҳукм чиқарилмаслигини,
          айбланувчига айбловчилар билан юзма-юз туриб ўзини ҳимоя қилишига
          имконият берилишини айтдим.
        </p>
      </div>

      <div className="main_text">
        <p>
          Кейин улар мен билан бирга бу ерга муҳокама қилиш учун келдилар.
          Вақтни кетказмай, эртасига маҳкама ташкил қилиб, Толутни
          чақиртирдим. Лекин мен ўйлаган айблардан биронтаси ҳам ўртага
          қўйилгани йўқ. Мавзу фақат ўз динларига тегишли, Толут тирик деб
          иддао қилаётган Исо исмли бир ўлган одам ҳақида эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Нима қилишни билмай: “Қуддусга бориб ўша ерда муҳокама бўлишни
          хоҳлайсанми?” деб сўрадим. Лекин у: “Мени Цезарь ҳукм қилсин”, деб
          тақозо қилгани учун то Император ҳузурига боргунча назоратда
          сақланглар, деб буйруқ бердим».
        </p>
      </div>

      <div className="main_text">
        <p>«Мен ўзим у билан гаплашсам яхши бўлар эди», деди Агриппа.</p>
      </div>

      <div className="main_text">
        <p>
          «Яхши, — деди Фестус. — Эртага ҳузурингизга чақиртираман».
        </p>
      </div>

      <div className="main_text">
        <p>
          Эртаси куни Агриппа ва Барники тантана билан, қўмондонлар ва
          шаҳарнинг нуфузли кишилари иштирокида маҳкама залига кириб келди.
          Фестуснинг буйруғи билан Толут (р.а.) ни олиб келдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Фестус гап бошлади: «Аълоҳазрат Агриппа! Муҳтарам жаноблар! Бу
          кишига Қуддусдаги ва Қайсариядаги яҳудийлар ўлим жазоси берилсин,
          деб талаб қиляпти.
        </p>
      </div>

      <div className="main_text">
        <p>
          Лекин менинг назаримда у ўлимга лойиқ иш қилмаган. Цезарнинг
          ҳукмини талаб қилгани учун мен уни Румга юбормоқчиман. Аммо
          Императорга нима деб ёзишни билмайман. Шунга бугун уни сизларнинг
          олдингизга, хусусан аълоҳазрат Агриппа, сизнинг ҳузурингизга олиб
          келдим. Таҳқиқ қилиб, Император жанобларига нима битиш лозимлигини
          ойдинлаштириб олсак. Чунки жиноятини аниқламай туриб, кимнидир
          Император ҳузурига юборишимиз тўғри эмас».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Толут (р.а.) нинг подшоҳ ҳузурида берган гувоҳлиги</p>
      </div>

      <div className="main_text">
        <p>
          Агриппа Толут (р.а.) га: «Ўзингизни ҳимоя қилиш учун бирон нарса
          дейсизми? Рухсат», деди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Толут салом ишораси учун қўл кўтариб, гап бошладилар:
          «Аълоҳазрат, мен ўзимни сизнинг ҳузурингизда ҳимоя
          қилаётганимдан хурсандман. Сиз яҳудийларнинг урф-одатлари, ички
          ихтилофлари билан яхши танишсиз. Илтимос, гапларимни сабр-тоқат
          билан эшитинг.
        </p>
      </div>

      <div className="main_text">
        <p>
          Мен ёшликда қандай тарбия олганим, аввал ўз шаҳримда, кейин
          Қуддусда қандай яшаганим ҳамма яҳудийларга маълум. Мен
          динимизнинг энг жиддий мазҳаби — фарисийлар мазҳабида эдим. Агар
          хоҳласалар, улар гапларимни тасдиқлайди. Ҳозир эса, Худо бир
          вақтлар боболаримизга берган ваъдага ишонганим учун мени ҳукм
          қилишяпти.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ўзи аслида бутун бани Исроил кечаю кундуз Худога ибодат қилар экан,
          айни ваъданинг амалга ошишини интизорлик билан кутмоқда. Лекин
          мени, ё аълоҳазрат, айни шу умид учун муҳокама қилмоқдалар.
          Оллоҳ таолонинг ўликларни тирилтира олиши нима учун баъзиларингизга
          имконсиздек кўринади?
        </p>
      </div>

      <div className="main_text">
        <p>
          Тўғри, мен ҳам носиралик Исонинг шогирдларини таъқиб қилиш керак,
          деб ўйлардим. Шунинг учун руҳонийлардан рухсат олиб, улардан
          кўпини Қуддусда зиндонга ташладим. Уларни ўлимга маҳкум
          қилганларида, мен ҳам ўша ерда туриб, уларга қарши овоз
          берардим. Тиловатхоналарга бориб, “Исони лаънатла!” деб уларни
          қийнардим. Нафратим шунчалик кўп эдики, ҳатто хорижий шаҳарларга
          ҳам бориб, уларни таъқиб этдим.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ана шундай сафарлардан бирида, руҳонийларимиздан ваколат олиб
          Дамашққа кетаётган эдим. Туш чоғи эди, йўлда бирдан кўзни
          қамаштирадиган, қуёшдан ҳам ёруғ бир нур осмондан порлаб,
          атрофимизни нурга кўмди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ҳаммамиз ерга йиқилдик ва бир овоз арамий тилида менга:
          «Толут, Толут, нега мени қувғин қиляпсан? — деди. —
          Менга қарши уришишинг фойдасиз».
        </p>
      </div>

      <div className="main_text">
        <p>«Ё ҳазратим, — дедим мен. — Кимсиз сиз?»</p>
      </div>

      <div className="main_text">
        <p>
          Овоз эса: «Мен сен зулм қилаётган Исоман, — деб жавоб берди. —
          Тур! Мен сени ўз хизматимга олиш учун, ўз шоҳидимга айлантириш
          учун сенга зоҳир бўлдим. Ҳозир кўрган нарсангни ва келажакда мен
          кўрсатадиган нарсаларни одамларга айтасан. Мен сени ўз
          яҳудийлардан ҳам, бегона халқлардан ҳам ҳимоя қиламан. Сен ғайри
          яҳудийлар кўзини очиб, уларни зулматдан нурга, шайтон ҳукми
          остидан Оллоҳга қайтарасан, токи гуноҳларидан фориғ бўлиб, менга
          имон келтирган муқаддаслар қаторидан жой олишсин».
        </p>
      </div>

      <div className="main_text">
        <p>
          Шундан сўнг, ё аълоҳазрат, самодан келган бу ваҳийга мен итоат
          этдим. Аввал Дамашқ аҳлини, кейин Қуддус ва бутун Яҳузияни,
          шунингдек ғайри яҳудийларни ҳам тавба қилишга, Худога юз
          буришга, тавбасига муносиб амаллар қилишга даъват эта бошладим.
          Яҳудийлар шунинг учун мени Байтуллоҳда ушлаб ўлдирмоқчи
          бўлдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Лекин каттаю кичик ҳаммага гувоҳлик беришим учун Оллоҳ таоло мени
          шу кунгача омон сақлади. Масиҳнинг азоб чекиб ўлиши ва биринчи
          бўлиб тирилиши, ўз халқига ҳамда ғайри яҳудийларга нур сочиши
          ҳақида Мусо алайҳис-салом ҳам, пайғамбарлар ҳам гапирган. Мен
          улардан орттириб ҳеч нарса деяётганим йўқ».
        </p>
      </div>

      <div className="main_text">
        <p>
          Шунда Фестус гапни бўлиб: «Сиз девона бўлибсиз, Толут! Кўп ўқиш
          миянгизни хароб қилибди!» деди.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Жаноб Фестус, мен девона бўлганим йўқ, — дедилар Толут (р.а.). —
          Мен айтаётган сўзлар айни ҳақиқат. Подшоҳ ҳазратлари ҳам
          хабардор, чунки бу воқеалар ернинг тагида содир бўлгани йўқ.
          Подшоҳим, пайғамбарларга имонингиз борми? Албатта бор...»
        </p>
      </div>

      <div className="main_text">
        <p>
          Шоҳ Агриппа: «Нима, сен энди мени ҳам қисқа муддатда христианга
          айлантирмоқчимисиз?» деб сўради.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Тезми-кечми, нафақат сиз, балки бу ерда мени тинглаётганларнинг
          ҳаммаси ҳам мен каби бўлишларини Оллоҳдан тилайман, — дедилар
          Толут (р.а.). — Фақат бу занжирлардан мустасно».
        </p>
      </div>

      <div className="main_text">
        <p>
          Подшоҳ ўрнидан турди, ва Барники, ҳоким ва бошқалар билан
          ташқарига чиқди. Ўзаро гаплашар эканлар: «Бу одам ўлимга ёки
          ҳибсга лойиқ ҳеч нарса қилмаган», деган қарорга келдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Агар Цезарнинг ҳукмини талаб қилмаганида, озод қилса бўлар эди»,
          деди Агриппа Фестусга.
        </p>
      </div>
    </main>
  );
}