'use client';


import { useSpeechBubbles } from '@/app/hooks/useSpeechBubbles';

export default function QuddusdanKetibQolmanglar() {
  const { openBubbles, toggleBubble } = useSpeechBubbles(['bubble1']);

  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>“Қуддусдан кетиб қолманглар”</p>
      </div>

      <div className="main_text">
        <p>
          Расулуллоҳ азоб чекиб ўлганларидан сўнг ўзларининг тирилганликларини,
          тирик эканликларини кўп ишончли далиллар билан шогирдларига
          исботладилар. Қирқ кун мобайнида уларга қайта-қайта зоҳир бўлиб,
          Илоҳий Салтанат ҳақида гапирдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шу мулоқотларнинг бирида таом устида шогирдларига: «То Оллоҳим Ўз
          ваъдасини юбормагунча Қуддусдан кетиб қолманглар. Мен аввал ҳам
          сизларга бу ҳақда гапирган эдим. Яҳё пайғамбар сизларни тавбага “ғарқ
          қилган”, бир неча кундан кейин эса Оллоҳ таоло сизларни Руҳ ул-қудсга
          “ғарқ қилади”», деб тайинладилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бир сафар шогирдлари у кишидан: «Устоз, сиз халқимизни энди озод
          қилиб, давлатимизни тиклайсизми?» деб сўрадилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Расулуллоҳ уларга: «Буларнинг вақти-соатини Оллоҳим тайин этади,
          уларни билиш сизларнинг ишингиз эмас, — дедилар. — Лекин Руҳ ул-қудс
          келганда қудрат оласизлар ва мен ҳақимда Қуддусда, бутун Яҳузия ва
          Сомирада, ва ҳатто дунёнинг энг узоқ жойларида шаҳодат берасизлар».
        </p>
      </div>

      <div className="main_text">
        <p>
          Кейин Оллоҳнинг қудрати билан расулуллоҳ уларнинг кўз олдида осмонга
          кўтарилдилар, булут ичига кириб ғойиб бўлдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Улар осмонга тикилиб қараб турганларида, бирдан ораларида оқ либосга
          ўралган икки киши пайдо бўлиб: «Эй жалилаликлар, нега тепага қараб
          тикилиб турибсизлар? Оллоҳ таоло у кишини Ўз ҳузурига кўтарди.
          Осмонга қандоқ кетган бўлсалар, бир куни яна шундоғ қайтиб
          келадилар», деди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ўша пайтда улар Зайтун тоғида эдилар. Бир чақирим масофа йўл юриб,
          Қуддусга қайтиб келдилар ва ўзлари яшаётган болохонага келиб, дуо ва
          ибодат билан машғул бўлдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Булар Сафвон (р.а.) , Яҳё (р.а.) , Яъқуб (р.а.) , Ражул (р.а.) ,
          Чавандоз (р.а.) , Тўмо (р.а.) , Бартулмо (р.а.) , Атоуллоҳ (р.а.) ,
          Ҳалафийнинг ўғли Яъқуб (р.а.) , фидойи лақабли Сафвон (р.а.) , Яъқуб
          ўғли Яҳузо ва расулуллоҳнинг укалари ҳамда бир нечта хотин (жумладан
          расулуллоҳнинг оналари ҳам) бўлиб, мунтазам равишда йиғилишиб, дуо
          қилаётган эдилар.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Матёснинг саҳобалар сафига қўшилиши</p>
      </div>

      <div className="main_text">
        <p>
          Шу кунлардан бирида, бир юз йигирмага яқин имонли биродарлар
          тўпланган пайтда Сафвон (р.а.) жойидан туриб дедилар:
        </p>
      </div>

      <div className="main_text">
      

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble1')}>
          «Биродарлар, Яҳузо ҳақида Китобда айтилган сўзлар
          <sup>1</sup> амалга ошди. Аслида у бизлардан биримиз эди, биз каби
          саҳоба этиб танланган эди. Мазомирда: “Унинг уйи қаровсиз қолсин,
          унинг ўрнини бошқа одам олсин”, деб ёзилган. Шу сабабдан биз энди
          унинг ўрнига бошқа бировни — расулуллоҳнинг тирилганига шоҳид бўлган,
          расулуллоҳ Яҳё пайғамбар қўлида ғусл олган кундан бошлаб, то
          арши-аълога кўтарилгунча биз билан бирга юрган бир одамни
          танлашимиз керак».
        </p>
          {openBubbles['bubble1'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble1')}
          >
            <p>
              <sup>1</sup> Бу башоратлар Довуд пайғамбар тилидан айтилган эди.
              Яҳузонинг хиёнат орқали топган пулига бир ер сотиб олинган ва
              Яҳузо ўша ерда боши билан йиқилиб, қорни ёрилиб, ичак-чавоғи чиқиб
              кетган эди. Унинг ўлгани дарров бутун Қуддусга овоза бўлиб, халқ у
              ерга “Қон даласи” деб от қўйган эди.
            </p>
          </div>
        )}
      </div>

      <div className="main_text">
        <p>
          Биродарлар икки кишини таклиф қилдилар: бири Устус лақабли Юсуф
          Барсабо, иккинчиси эса Матёс эди. Кейин дуо қилиб дедилар: «Ё Раббий!
          Ҳар бир инсоннинг қалби Сенга маълум. Булардан қайси бирини хоин
          Яҳузо ўрнига саҳоба этиб танлаганингни бизларга аён эт».
        </p>
      </div>

      <div className="main_text">
        <p>
          Сўнг қуръа ташладилар. Қуръага Матёснинг номи чиқди ва у киши ҳам ўн
          бир саҳоба сафидан жой олдилар.
        </p>
      </div>
    </main>
  );
}