'use client';



export default function RasulullohningTolutgaNozilBolishi() {
  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>Расулуллоҳнинг Толутга нозил бўлиши</p>
      </div>

      <div className="main_text">
        <p>
          Бу пайтда Толут, расулуллоҳга имон келтирганларга ўлим таҳдиди солиб
          юрган эди. У олийруҳонийга бориб, Дамашқдаги тиловатхоналар учун хат
          ёздириб олди. Мақсади Дамашқдаги Тариқат аҳлини — хоҳ хотин бўлсин,
          хоҳ эркак — кишан солиб Қуддусга олиб келиш эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Дамашққа яқинлашганларида, осмондан бир нур тушиб, бирдан
          теварак-атрофни ярқиратиб юборди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Толут ерга йиқилди ва: «Толут, Толут! Нечун менга зулм қиляпсан?»
          деган овозни эшитди.
        </p>
      </div>

      <div className="main_text">
        <p>«Ё ҳазратим, кимсиз сиз?» деб сўради Толут.</p>
      </div>

      <div className="main_text">
        <p>
          «Сен зулм қилаётган Исоман, — деди овоз. — Тур, шаҳарга бор, ўша ерда
          сенга нима қилишинг кераклиги айтилади».
        </p>
      </div>

      <div className="main_text">
        <p>
          Толутнинг йўлдошлари ҳайратдан лол бўлиб қолган эдилар. Чунки овоз
          эшитиларди, аммо ҳеч ким кўринмасди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ниҳоят Толут ўзига келиб ўрнидан турди. Лекин кўзлари ҳеч нарсани
          кўрмаётган эди. Қўлидан ушлаб Дамашққа олиб келдилар. Уч кунгача кўзи
          кўрмади. Шу вақт мобайнида ҳеч нарса емади ҳам, ичмади ҳам.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Толутнинг имон келтириши</p>
      </div>

      <div className="main_text">
        <p>
          Дамашқда расулуллоҳнинг Ҳанониё деган бир шогирди бор эди. Устозимиз
          рўёда зоҳир бўлиб унга: «Ҳанониё!» деди.
        </p>
      </div>

      <div className="main_text">
        <p>«Лаббай, ҳазратим!» деб жавоб берди Ҳанониё.</p>
      </div>

      <div className="main_text">
        <p>
          «Ўрнингдан тур, Мустақим кўчасида яшовчи Яҳузонинг уйига бор. У ерда
          тарсуслик Толутни сўра. Ҳозир у дуо қиляпти: рўёда Ҳанониё деган бир
          одам келганини ва кўзларини очиш учун устига қўл қўйганини кўрди».
        </p>
      </div>

      <div className="main_text">
        <p>
          «Ё ҳазратим, — деди Ҳанониё. — Мен бу одам ҳақида кўп эшитганман.
          Қуддусдаги биродарларимизга роса зулм ўтказган. Дамашққа келаётганда
          ҳам бу ердаги ҳамма имонлиларни банди қилиш учун руҳонийлардан рухсат
          олган эмиш».
        </p>
      </div>

      <div className="main_text">
        <p>
          «Бор, — дедилар расулуллоҳ. — Менинг айтганимни қил. Мен бу одамни мен
          ҳақимда бошқа халқларга, подшоҳларга, шунингдек бани Исроилга гувоҳлик
          берсин, деб танлаб олдим. Мен учун қанча қийналиши кераклигини унга
          кўрсатаман».
        </p>
      </div>

      <div className="main_text">
        <p>
          Шундан сўнг Ҳанониё ўша уйга борди. Толутнинг устига қўл қўйиб:
          «Биродар! Устозимиз Исо ҳазратлари йўлда сенга кўринган экан. Энди
          кўзларинг очилиши учун, Руҳ ул-қудсга тўлишинг учун мени жўнатдилар»,
          деди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шу онда Толут (р.а.) нинг кўзи ярқ этиб очилди. Сўнг ғусл олиб имон
          келтирдилар. Таом еб кучга кириб, бир неча кун Дамашқда, биродарлар
          олдида бўлди. Бу вақт ичида тиловатхоналарга бориб, расулуллоҳнинг
          дарҳақиқат Оллоҳ тайин этган Подшоҳ эканлигини тарғиб эта бошладилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Эшитганлар ҳайрон бўлиб: «У ўзи Қуддусда бу йўлга кирганларни қувғин
          қилиб юрмаганмиди?!» дер эдилар.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Саҳобалар билан учрашгани</p>
      </div>

      <div className="main_text">
        <p>
          Толут (р.а.) нинг салоҳияти кундан-кунга ошиб борар, расулуллоҳнинг
          дарҳақиқат Масиҳ эканлигини далиллар билан исботлар эдилар. Дамашқдаги
          яҳудийлар нима дейишларини билмай ожиз қолган эдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ниҳоят, орадан бир қанча вақт ўтиб, яҳудий оқсоқоллар Толут (р.а.) ни
          ўлдиришга қарор қилдилар. Бир неча одамни шаҳар дарвозасига қўйиб:
          «Кеча ё кундуз демай пойланглар, кўрсанглар ўлдиринглар», деб буйруқ
          беришди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бу ҳақда хабар Толут (р.а.) нинг қулоғига етиб келгач, у кишининг
          шогирдлари кечаси уни саватга солиб шаҳар деворидан пастга тушириб,
          қочириб юбордилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Толут (р.а.) Қуддусга келиб, у ердаги биродарлар сафига қўшилишга
          ҳаракат қилди. Лекин ҳамма ундан қўрқар, унинг ростдан ҳам
          расулуллоҳга шогирд тушганига ишонмас эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ўшанда Барнобо (р.а.) у кишини саҳобалар олдига олиб боради ва уларга
          Толутнинг Дамашқ йўлида устозимизни кўрганини, у кишидан нималар
          эшитганини, ва Дамашқда расулуллоҳ номи билан қўрқмай ваъз
          қилганларини айтади. Шундан сўнг саҳобалар у кишини сафларига қабул
          қилдилар. Толут (р.а.) энди улар билан бирга юрар, Қуддусда Исо (а.с.)
          ҳақида қўрқмай гапирар эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бир куни юнонча гапирадиган яҳудийлар билан баҳслашган эди, улар у
          кишини ўлдириш пайига тушдилар. Имонли биродарлар буни эшитиб, Толут
          (р.а.) ни аввал Қайсарияга олиб боришди, у ердан эса уйига, Тарсусга
          жўнатишди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шундоғ қилиб бутун Яҳузия, Жалила ва Сомирадаги имонлилар тинчликка
          эришдилар. Руҳ ул-қудс уларга мадад берар, Оллоҳга инонганлар сони
          кўпаяётган эди.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Сафвон (р.а.) нинг ўлган хотинни тирилтириши</p>
      </div>

      <div className="main_text">
        <p>
          Сафвон (р.а.) сафарда юрган эдилар. Бир куни Луд шаҳридаги имонлилар
          олдига бордилар. Ўша ерда саккиз йилдан бери тўшакда ётган Анис исмли
          бир одамни кўрдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Анис, Исо Масиҳ сенга шифо бермоқчи! — дедилар Сафвон (р.а.) унга. —
          Тур, кўрпа-тўшагингни йиғиштир!»
        </p>
      </div>

      <div className="main_text">
        <p>
          Анис ўша заҳоти шифо топиб, ўрнидан турди. Луд ва Шорунда
          яшаётганларнинг ҳаммаси бу мўъжизани кўриб расулуллоҳга имон
          келтирдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ёфо шаҳрида Табито исмли бир хотин бор эди (маъноси “оҳу”). У
          расулуллоҳга эргашган, ҳамиша яхши ишлар қиладиган, муҳтожларга ёрдам
          берадиган тақводор аёл эди. Ўша кунларда у бетоб бўлиб ўлди. Ўлигини
          ювиб болохонага қўйдилар. Луд шаҳри Ёфога яқин эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Биродарлар Сафвон (р.а.) нинг Лудда эканини эшитиб, “Тез етиб
          келинг!” деб икки кишини олдларига юбордилар. Сафвон (р.а.) улар билан
          бирга Ёфога келдилар. У кишини Табитонинг жасади ётган болохонага олиб
          боришди. Тўпланган бева хотинлар Табито уларга тириклигида тиккан
          либосларни кўрсатиб йиғлаётган эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Сафвон (р.а.) ҳаммани ташқарига чиқардилар. Кейин тиз чўкиб дуо
          қилдилар. Сўнгра ўликка қараб: «Табито, тур ўрнингдан!» дедилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Хотин кўзларини очди! Сафвон (р.а.) ни кўриб, туриб ўлтирди. Сафвон
          (р.а.) ёрдам бериб уни оёққа турғиздилар. Кейин имонлилар билан бева
          хотинларни чақириб, Оҳуни уларга тирик топширдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бу хабар бутун шаҳарга ёйилди ва кўп одамлар расулуллоҳга имон
          келтирди. Сафвон (р.а.) ҳам анча вақт Ёфода, Исмоил деган бир
          чармгарнинг уйида қолдилар.
        </p>
      </div>
    </main>
  );
}