'use client';



export default function TugmaSholningShifoTopgani() {
  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>Туғма шолнинг шифо топгани</p>
      </div>

      <div className="main_text">
        <p>
          «Эй имон келтирганлар! Оллоҳнинг ёрдамчилари бўлинг! Худди Ийсо ибн
          Марям ҳаворийларга: «Ким Оллоҳ учун менинг ёрдамчим» деганида,
          ҳаворийлар: «Биз Оллоҳнинг ёрдамчиларимиз», деганларидек. Бас, Бани
          Исроилдан бир тоифа имон келтирди ва бир тоифа кофир бўлди. Бас, Биз
          имон келтирганларни душманлари устидан қўллаб-қувватладик. Ва улар
          ғолиб бўлдилар» (Ас-Сaф 61:14).
        </p>
      </div>

      <div className="main_text">
        <p>
          Бир куни Сафвон билан Яҳё (р.а.) Байтуллоҳга — соат учда бўладиган
          ибодатга — келаётган эдилар. Байтуллоҳнинг Зебо деган дарвозасида
          онадан шол туғилган бир одам тиламчилик қилиб ўлтирган эди. (Уни ҳар
          куни бу ерга тиламчилик қилиши учун олиб келар эдилар.)
        </p>
      </div>

      <div className="main_text">
        <p>
          Сафвон ва Яҳё (р.а.) ларнинг келаётганини кўриб, тиламчи улардан ҳам
          садақа сўради. Сафвон ва Яҳё (р.а.) унга диққат билан қарадилар. Кейин
          Сафвон (р.а.) : «Буёққа қара!» дедилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Тиламчи уларга, бирон нарса берармикан, деган умид билан қаради.
          Сафвон (р.а.): «Менда сенга бериш учун пул йўқ, — дедилар. — Лекин
          ўзимда борини бераман: носиралик Исо ал-Масиҳ номидан айтаман:
          ўрнингдан туриб юриб кет!»
        </p>
      </div>

      <div className="main_text">
        <p>
          Кейин уни ўнг қўлидан ушлаб, ўрнидан турғаздилар. Бирдан шолнинг
          тўпиқлари билан тиззалари соғайиб қувватга кирди. Дик этиб оёққа
          турди-да юра бошлади. Кейин Худога ҳамду санолар айтиб, сакраб-ирғишлаб
          улар билан Байтуллоҳга кирди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Одамлар ҳар куни дарвоза олдида тиламчилик қилиб ўтирадиган шолнинг
          юраётганини, Худога ҳамду сано айтаётганини кўриб, ҳайрон бўлиб
          қолдилар. Ҳадемай, олдига бир талай халқ йиғилди.
        </p>
      </div>

      <div className="main_text">
        <p>Сафвон (р.а.) фурсатдан фойдаланиб, оломонга қараб дедилар:</p>
      </div>

      <div className="main_text">
        <p>
          «Эй бани Исроил, нечун ҳайрон бўляпсизлар? Нега бизга бундоғ тикилиб
          қолдингиз? Бу одамга биз ўз кучимиз ё тақвомиз билан шифо берганимиз
          йўқ! Йўқ, бу иш ота-боболаримиз Худоси Ўз бандаси Исо алайҳис-саломга
          берган қудрат орқали амалга ошди. Сизлар эса у кишини ўлимга маҳкум
          этдингизлар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Пилотус Уни озод қилмоқчи бўлганда, Пилотуснинг олдида Оллоҳнинг
          расулини рад қилдингизлар. Муқаддас солиҳ кишини рад этиб, ўрнига бир
          қотилнинг озодликка чиқишини тақозо қилдингиз. Ҳаёт Берувчини
          ўлдирдингиз, ҳа, лекин Оллоҳ у кишини тирилтирди ва биз бунга
          шоҳидмиз!
        </p>
      </div>

      <div className="main_text">
        <p>
          Мана бу одамнинг олдин шол бўлганини биласизлар. Лекин расулуллоҳга
          бўлган имон орқали мана олдингизда соппа-соғ турибди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Азиз биродарларим, бошлиқларингиз каби сизлар ҳам Исо (а.с.) га бу
          ишни билмасдан, жаҳолат туфайли қилгансиз. Лекин Масиҳнинг азоб чекиб
          ўлиши ҳақида ҳамма пайғамбарлар башорат қилишган. Оллоҳ шу йўл билан
          айни башоратни амалга оширди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шундоғ экан, энди тавба қилинглар. Гуноҳларингиз ювилиши учун,
          янгиланишингиз учун Худога юз тутинг, то Оллоҳ ҳазрати Исони, сизлар
          учун тайин этган Подшоҳни яна сизларга юборсин. Чунки Худо ҳамма
          нарсани янгилайдиган вақтгача Масиҳ арши-аълода қолиши керак. Бу ҳақда
          пайғамбарлар ваъдаси бор.
        </p>
      </div>

      <div className="main_text">
        <p>
          Чунончи Мусо пайғамбар деганлар: «Оллоҳ таоло сизлар учун орангиздан,
          ўз халқингиз ичидан, менга ўхшаш бир Пайғамбар чиқаради. Унга албатта
          итоат этишингиз зарур. Кимки Унинг гапларига қулоқ тутмаса, Худонинг
          халқидан айрилиб ҳалокатга юз тутади».
        </p>
      </div>

      <div className="main_text">
        <p>
          Сомуил пайғамбар ҳам, кейин келган бошқа ҳамма пайғамбарлар ҳам бу
          воқеаларни башорат қилиб айтган эдилар. Оллоҳ таолонинг Иброҳим
          алайҳис-салом билан қилган аҳдини эсланг: «Ер юзидаги барча миллатлар
          сенинг зурриятинг орқали баракага эришади». Шу сабабдан Худо Ўз
          бандаси Исо пайғамбарни ҳаммадан аввал сиз Бани Исроилнинг олдига
          юборди, токи тавба қилиб гуноҳ ишлардан юз ўгирсангиз».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Икки саҳобанинг зиндонбанд этилгани</p>
      </div>

      <div className="main_text">
        <p>
          Сафвон ва Яҳё (р.а.) халққа гапириб турганларида руҳонийлар, Байтуллоҳ
          муҳофизларининг бошлиғи ва бир қанча садуқийлар уларнинг устига келиб
          қолдилар ва саҳобаларнинг “Исо пайғамбар қайта тирилди, демак Оллоҳ
          таоло ўликларни тирилтиради”, деган гапларидан ғазабланиб, уларни
          ҳибсга олиб, зиндонга қамадилар. (Чунки вақт кеч бўлиб қолган эди.)
        </p>
      </div>

      <div className="main_text">
        <p>
          Ўша куни маъруза эшитган одамлардан кўпи имон келтирди ва шу тартибда
          расулуллоҳга эргашганлар сони тахминан беш мингтага етди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Эртасига дин пешволари, оқсоқоллар ва фиқҳ олимлари (жумладан
          олийруҳоний Ҳанно, Қаёфо, Юҳанно, Искандар ва уларнинг хонадонидан
          баъзи кишилар) Қуддусда кенгаш чақирдилар. Ва Сафвон билан Яҳё (р.а.)
          ни келтириб: «Сизлар бу ишни қайси қудрат билан, кимнинг ваколати
          билан қилдингизлар?» деб сўрадилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Руҳ ул-қудс билан тўлган Сафвон (р.а.) жавоб бердилар: «Эй Исроил
          халқининг раҳнамо ва раҳбарлари! Бу иш деб ана у шол одамга қилинган
          яхшилик тўғрисида, унинг қандай шифо топганлиги ҳақида сўраяпсизларми?
          Унда сизларга ва бутун Исроил халқига очиқ ва равшан маълум бўлсинким,
          биз бу ишни сизлар хочга михлаган, лекин Оллоҳ таоло ўлимдан
          тирилтирган Исо пайғамбарнинг ваколати билан қилдик.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ҳа, у кишининг қудрати билан бу одам шифо топди. Чунки Китобда
          битилгани каби: “Сиз меъморлар рад этган бу тош иморатнинг энг муҳим
          еридан жой олди”. Бизга бошқа ҳеч кимдан нажот йўқ, чунки у кишидан
          бошқа ҳеч кимга инсониятни қутқариш учун қудрат берилган эмас».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>“Ким итоат этишимиз керак, Худогами ёки инсонларга?”</p>
      </div>

      <div className="main_text">
        <p>
          Кенгаш узвлари расулуллоҳ билан бирга юрган бу саҳобаларнинг жасорат
          билан айтган сўзларини эшитиб, хусусан, уларнинг оддий саводсиз одамлар
          эканини билиб, ҳайрон қолдилар. Лекин, бўлган мўъжизани ҳам рад қила
          олмас эдилар. Шифо топган одам ҳам ўша ерда, улар билан бирга турган
          эди. Шунга, бирон нарса дея олмай ўзаро маслаҳатлашиш учун саҳобаларга
          мажлисдан ташқарига чиқиб туришни буюрдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Кейин: «Бу одамларни нима қиламиз? — деб бир-бирларидан сўрадилар. —
          Бундоқ бир мўъжизани инкор этолмаймиз-ку! Қуддусда ҳамма буни эшитди.
          Лекин уларнинг тарғиботини тўхтатмасак бўлмайди. Исонинг отини бошқа
          тилга олманглар, деб уларни қўрқитамиз», дедилар ва саҳобаларни
          чақиртириб, энди бундан сўнг Исо ҳақида ҳеч кимга гапирманглар, таълим
          берманглар, деб буюрдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Сафвон ва Яҳё (р.а.) уларга: «Ўзларингиз айтинг, Худонинг наздида
          кимга итоат қилсак тўғри бўлади? Сизларгами ё Худогами? Биз
          кўрган-эшитганларимизни айтмай иложимиз йўқ», дедилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Кенгаш увлари яна бир неча бор дўқ уриб уларни қўйиб юборишга мажбур
          бўлдилар. Чунки бўлган мўъжиза учун — қирқ йил шол бўлиб юрган одам
          шифо топгани учун халқ Оллоҳга ҳамду сано айтаётган эди. Агар
          саҳобаларни жазолайдиган бўлса, исён кўтарилиб кетиши мумкин эди.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>“Бизга ботирлик бер”</p>
      </div>

      <div className="main_text">
        <p>
          Сафвон ва Яҳё (р.а.) озод бўлишлари билан биродарлар олдига келиб,
          руҳоний ва оқсоқолларнинг сўзини уларга айтдилар. Шунда барча
          биродарлар биргаликда дуога қўл очиб: «Ё Парвардигор, уларнинг
          таҳдидларини эшит, биз қулларингга Сенинг сўзларингни тарғиб қилишга
          жасорат бер. Шифобахш қудратингни ҳам ато эт, то хос банданг Исо
          ҳазратимиз номи билан ояту аломатлар кўрсатайлик», дедилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Уларнинг дуосидан сўнг, улар йиғилиб турган уй силкиниб тушди ва
          ҳаммалари Руҳ ул-қудсга тўлдилар ва кўчаларга чиқиб, Оллоҳнинг
          сўзларини одамларга жасорат билан тарғиб қила бошладилар.
        </p>
      </div>

<div className='main_text'>
<p>Улар ҳар куни уйма-уй юриб, ва ҳам Байтуллоҳга бориб: “Сиз кўз тиккан Масиҳ мана шу киши эдилар” деб ваъз қилар, одамларга таълим берар эдилар.</p>
</div>

    </main>
  );
}