'use client';


import { useSpeechBubbles } from '@/app/hooks/useSpeechBubbles';

export default function Sulayman() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble1',
    'bubble2',
  ]);

  return (
    <main className="stories relative">
       <article className="flex gap-6">
        <div className="sm:w-1/2">
          <p className='!text-green-600 sm:!text-gray-600 !text-[14px] leading-[15.5px]'>
             Батаҳқиқ, Биз Довуд ва Су­лай­монга илм бердик. Икковла­ри:
            «Бизни кўп мўмин бан­да­лардан афзал қилган Оллоҳга ҳамдлар
            бўлсин», дедилар
            <span className=""> (Намл 27:15). </span>
          </p>
        </div>

        <div className="-mt-2 hidden sm:block sm:w-1/2 rtl">
          <p   dir="rtl" 
                  lang="ar" 
                  className="font-amiri !text-[18px] !leading-[40px]">
          
           وَلَقَدْ ءَاتَيْنَا دَاوُۥدَ وَسُلَيْمَـٰنَ عِلْمًۭا ۖ وَقَالَا
            ٱلْحَمْدُ لِلَّهِ ٱلَّذِى فَضَّلَنَا عَلَىٰ كَثِيرٍۢ مِّنْ
            عِبَادِهِ ٱلْمُؤْمِنِينَ
          </p>
        </div>
      </article>



      <div className="paragraph_heading">
        <p> Адўниёнинг подшоҳликни олмоқчи бўлгани</p>
      </div>

      <div className="main_text">
   

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble1')}>
          Довуд (а.с.) қариб қолган эдилар. Кунлар­дан бир куни, у кишининг Ҳажит
          хонимдан туғилган ўғли Адўниё<sup>1</sup> тахтни эгал­ламоқчи бўлди.
          Ўзига от-аравалар, суво­рийлар ва элликта муҳофиз ёллади. Кейин Сурайё
          Бибининг ўғли Ёваб ва руҳоний Абиёторлар билан гаплашиб, уларни ўз
          та­рафига оғдирди.
        </p>
     {openBubbles['bubble1'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble1')}
          >
            <p>
              <sup>1</sup> Адўниё жуда чиройли йигит бўлиб, Абусаломдан кейинги
              ўғил эди.
            </p>
          </div>
        )}
      </div>

      <div className="main_text">
        <p>
          Лекин руҳоний Содуқ, Баноё, Натан пайғамбар, Шамъий, Риъий ва Довуд
          алайҳис-саломнинг хос му­ҳо­физ­ла­ри Адў­ниё­га қўшилганлари йўқ.
        </p>
      </div>

      <div className="main_text">
   

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble2')}>
          Бир куни Адўниё, Айн-Рожалда,<sup>2</sup> “Илон Тоши” деб аталган жойда,
          қўй, ҳўкиз ва бўрдоқи бузоқларни қурбонлик қилиб, ҳамма ака-укаларини
          ва саройда хизмат қи­лаётган амалдорларни зиёфатга даъват қилди. Лекин
          Натан пайғамбарни, Ба­ноё­ни, сарой муҳофизларини ва укаси Су­лай­монни
          чақиргани йўқ.
        </p>
             {openBubbles['bubble2'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble2')}
          >
            <p>
              <sup>2</sup> Айн-Рожал: Байтул-муқаддас ташқарисидаги булоқнинг
              исми.
            </p>
          </div>
        )}
      </div>

      <div className="paragraph_heading">
        <p> Сулаймон (а.с.) нинг тахтга ўлтириши </p>
      </div>

      <div className="main_text">
        <p>
          Натан пайғамбар бу гапдан хабар топиб, Сулаймоннинг онаси Бешабага
          бундай дедилар: «Ҳажит хонимнинг ўғли Адўниё ўзини подшоҳ деб эълон
          қилганини эшит­дингизми? Шоҳимиз буни ҳали эшит­­ганлари йўқ. Агар
          жонингизни ва ўғ­лин­гиз Сулаймоннинг жонини қут­қа­ра­ман десангиз,
          подшоҳнинг олдига киринг. У кишига: “Сиз мендан кейин ўғлинг Сулаймон
          подшоҳ бўлади, деб ваъда берган эдингиз-ку! Унда нима учун Адўниё
          подшоҳ бўлди?” деб сўранг. Шу пайтда мен ҳам кириб, гапингизни
          тас­диқ­лай­ман», дедилар.
        </p>

        <p>Бешаба хоним Довуд (а.с.) нинг ҳузурига кир­ди ва ерга эгилиб таъзим қилди.</p>

        <p>«Нима бўлди? – деди подшоҳ. – Айт тилагингни».</p>

        <p>
          «Подшоҳим, сиз Оллоҳ номи билан қасам ичиб, мендан сўнг ўғлим Сулаймон
          тахтга ўтиради, деб ваъда берган эдингиз. Лекин Адў­ниё сизга билдирмай,
          ўзини подшоҳ деб эълон қилибди. Беҳисоб молларни қур­бон қилиб, ҳамма
          шаҳзодаларни, руҳо­ний Абиётор билан лашкарбошингиз Ёваб­ни ҳам таклиф
          қилибди. Ўғлингиз Сулай­мон­ни эса айтмабди. Шоҳим, ҳозир бутун Исро­ил
          халқи, энди тахтга ким чиқар экан, деб сизга мунтазир. Агар ким подшоҳ
          бўли­ши­ни эълон қилмасангиз, сиздан кейин мени ҳам, ўғлим Сулаймонни ҳам
          жиноятчилар қаторида санайдилар».
        </p>

        <p>
          Шу пайтда хизматкорлардан бири кириб: «Шоҳим, Натан пайғамбар келибди,
          ҳу­зу­рин­гизга кирмоқчи» деб хабар берди.
        </p>

        <p>
          Натан кириб ергача таъзим қилдилар-да: «Шоҳим, сиз мендан кейин Адўниё
          подшоҳ бўлади, деб айтганмидингиз? – деб сўрадилар. – Бугун у
          қатор-қатор жон­лиқ­лар сўйиб, ҳаммани зиёфатга так­лиф қилибди.
          Ўғилларингиз, руҳоний Абиётор ва лашкарбошиларингиз ўша ерда. Ҳозир
          ҳам­ма­лари зиёфат еб, “Яшасин подшоҳ Адўниё!” деб ҳай­қи­риш­япти.
          Лекин не­га­дир на мени, на руҳоний Содуқни, на Баноё ва на ўғлингиз
          Сулаймонни ча­қи­риш­мабди. Бу ишлар сизнинг амрингиз билан бўляптими?
          Бизга ҳеч нарса дема­дин­гизми?»
        </p>

        <p>
          Довуд (а.с.): «Бешабага ай­тинг­лар, олдимга кирсин!» дедилар. Кейин:
          «Мени ҳамма хатарлардан қутқарган Оллоҳ­га қасамки, мендан кейин ўғлинг
          Сулай­мон подшоҳ бўлади – Салтанат тах­ти­га ўлтиради. Мен шундай деб
          ваъда бер­ган­ман, ваъдамни бугун бажараман», де­ди­лар.
        </p>

        <p>
          Кейин руҳоний Содуқни, Натан пай­ғам­бар­ни ва Яҳуёдо ўғли Баноёни
          ҳузурига чақиртириб дедилар:
        </p>

        <p>
          «Сарой аёнларини йи­ғинг. Сулаймонни менинг хачиримга мин­ди­риб Жиҳўн
          булоғига олиб боринг­лар. Ўша ерда Содуқ билан Натан уни Бани Ис­ро­ил
          устидан подшоҳ деб эълон қилсин. Бурғу чалиб, “Яшасин Сулаймон под­шоҳ!”
          деб жар солинглар. Кейин қайтиб келиб, менинг тахтимга ўтирсин. Мен уни
          Исро­ил­нинг ўн икки қабиласи устидан подшоҳ қилиб тайинладим», дедилар.
        </p>

        <p>
          Шундай қилиб, руҳоний Содуқ, Натан пай­ғам­бар ва Баноё сарой аёнлари
          билан бирга ҳазрати Сулаймонни Жиҳўнга олиб бор­дилар. У ерда у кишининг
          под­шоҳ­лик­ка тайинланиш маросими бўлди. Ру­ҳо­ний Содуқ ва Натан
          пайғамбар ёғ билан Сулаймон (а.с.) ни масҳ этдилар.
        </p>

        <p>
          Кейин бурғу чалиб ҳаммалари: «Яшасин Сулай­мон под­шоҳ! Яшасин Сулаймон
          подшоҳ!» деб ҳай­қир­дилар ва ҳазрати Сулаймоннинг ор­қа­си­дан сурнай
          чалиб, хурсандчилик қилиб са­ройга қайтдилар. Уларнинг созу овоз­ла­ри
          шунчалик баланд эдики, ерни ларзага солди.
        </p>

        <p>
          Бу пайтда Адўниё ўтказаётган зиёфат охир­лаб қолган эди. Зиёфатда
          ўлтирганлар шовқин-суронни эшитиб: «Нима бўлди? Шаҳарда мунча шовқин?»
          деб сўрадилар.
        </p>

        <p>
          Шу пайт руҳоний Абиёторнинг ўғли Юно­­тон келиб: «Сулаймон подшоҳликка
          та­йин­­лан­ди. Шунга бутун шаҳар хур­санд­чи­лик қиляпти. Ҳозир
          Сулаймон под­шоҳлик тахтида ўтирибди», деди.
        </p>

        <p>
          Адўниё ҳам, меҳ­монлар ҳам бу гапни эшитиб қўрқиб кет­дилар ва
          жойларидан туриб ҳар қайсиси ўз йўлига жўнади.
        </p>
      </div>

      <div className="paragraph_heading">
        <p> Довуд нинг оламдан ўтгани </p>
      </div>

      <div className="main_text">
        <p>
          Вақти-соати келиб, Довуд пайғамбар ҳам оламдан ўтдилар ва “Довуд
          қалъаси” да дафн бўлдилар.
        </p>

        <p>
          У киши қирқ йил подшоҳ­лик қилган эдилар: етти йил Ҳабрунда, ўттиз уч
          йил Байт-ул-Муқаддасда. Энди салтанатни Сулаймон ибн Довуд бош­қа­ра­ёт­ган
          эдилар.
        </p>
      </div>
    </main>
  );
}