'use client';

 
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function MiraclesIsa() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble1',
    'bubble2',
    'bubble3',
    'bubble4',
    'bubble5',
    'bubble6',
  ]);

  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>1-боб: Халифат асрининг бошланиши</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            {' '}
            Атоуллоҳ раҳматуллоҳи алайҳ саҳобалардан мана бу машҳур хабарни ўз
            мусаннафида ривоят қиладилар:{' '}
          </span>
          «Исо (а.с.) янги асрнинг бошланганлиги, Халифат асрининг келганлиги
          ҳақидаги бушрони ваъз қилиб Жалиланинг ҳамма шаҳар-қишлоқларини кеза
          бошладилар. Тиловатхоналарда, кўчаларда ва далаларда одамларга таълим
          берар, беморларни шифолар эдилар. Овозалари бутун Сурияга тарқалди.
          Жинга чалинганлар, тутқаноғи бор одамлар ҳамда фалаж бўлганлар Жалила
          ва Ўнкентдан, Қуддус ва Яҳузиядан ҳамда Ўрдуннинг нариги соҳилидан
          келиб, касалларига шифо топар эдилар. Улкан оломон у кишининг
          ортларидан эргашиб юрган эди».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>2-боб: Балиқ овида рўй берган мўъжиза</p>
      </div>

      <div className="main_text">
        {openBubbles['bubble1'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble1')}
          >
            <p>
              <sup>1</sup> Атоуллоҳ ва Миррих (р.а.) нинг ривояти бўйича бу
              қайиқлардан бири Сафвон билан Ражул (р.а.) га, иккинчиси Яъқуб ибн
              Инъом билан унинг укаси Яҳё (р.а.) га тегишли бўлган.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble1')}>
          <span className="vitalic">
            {' '}
            Нурлуқ (р.а.) Ражул раҳматуллоҳи алайҳдан (ҳамда Яъқуб ибн Инъомдан
            ҳамда Яҳё ибн Инъомдан) мана бу ривоятни ёзиб қолдирганлар: Ражул
            раҳматуллоҳи алайҳ деганлар:{' '}
          </span>
          «Бир сафар, Жалила кўли бўйида одамлар илм эшитиш учун Исо (а.с.) нинг
          атрофида тиқилинч қила бошладилар. Қирғоқда икки қайиқ турар, бири
          бизники, иккинчиси шерикларимизники<sup>1</sup> бўлиб, биз кўлда
          тўрларимизни тозалаётган эдик.
        </p>
      </div>

      <div className="main_text">
        <p>
          Расулуллоҳ бизнинг қайиғимизга миниб, қайиқни соҳилдан сал нарига
          тортишимизни сўрадилар ва ўша ердан халққа маъруза қилдилар.
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble2'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble2')}
          >
            <p>
              <sup>2</sup> Яъни Сафвон (р.а.).
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble2')}>
          Маърузадан сўнг Сафвонга: «Чуқурроқ жойга ҳайданглар, тўр ташлайсизлар»,
          дедилар. «Ҳазратим, биз туни билан меҳнат қилиб битта ҳам балиқ
          ушлолмадик, — деди акам.<sup>2</sup> — Лекин сиз айтсангиз, майли,
          ташлайман».
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble3'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble3')}
          >
            <p>
              <sup>3</sup> Яъни, Инъомнинг ўғиллари Яҳё билан Яъқубни.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble3')}>
          Тўр ташлаган эдик, шунчалик кўп балиқ чиқдики, тўрлар йиртила бошлади.
          Кейин нариги қайиқдаги шерикларимизни<sup>3</sup> ёрдамга чақирдик,
          биргалашиб балиқларни қайиққа олдик. Икки қайиқ ҳам тўлди, агар яна
          солсак қайиқлар чўкиши аниқ эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ҳаммамизни ҳайрату ваҳима қоплади. Акам қўрққанидан тиз чўкиб: «Мендан
          йироқлашинг, ҳазратим, мен гуноҳкорман», деди. «Қўрқма, — дедилар
          Оллоҳнинг расули. — Энди балиқ эмас, одам овлайсан». Шундан сўнг
          қирғоққа келиб, қайиқларни ўша ерда қолдирдик ва ҳамма нарсадан воз
          кечиб, устознинг орқаларидан эргашдик».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>3-боб: Ҳазрати Исо (а.с.) нинг беморларга шифо бергани</p>
      </div>

      <div className="main_text">
        {openBubbles['bubble4'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble4')}
          >
            <p>
              <sup>4</sup> Нурлуқ (р.а.) нинг мусаннафида ёзилишича, у киши
              иситмага буйруқ берган эканлар.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble4')}>
          <span className="vitalic">
            {' '}
            Миррих раҳимаҳуллоҳи алайҳ Исо (а.с.) нинг саҳобаларидан эшитиб ривоят
            қилишича, Сафвон раҳматуллоҳи алайҳ бундай деб айтган эканлар:{' '}
          </span>
          «Устозимиз бир куни тиловатхонадан чиқиб, Яъқуб ва Яҳё билан уйимизга
          келдилар. Ўша пайтда қайнонам қаттиқ иситмалаб ётган эди, у кишидан шифо
          беришини илтимос қилдик. Исо (а.с.) онахоннинг олдига келдилар
          <sup>4</sup>, қўлидан ушлаб турғиздилар. Шу заҳоти қайнонамнинг иситмаси
          тушди ва ўрнидан туриб, дастурхонга уннай бошлади. Кунботарда, одамлар
          касалларини, жинга чалинган беморларини олиб, ҳазратнинг ҳузурига
          йиғилдилар. Деярли бутун шаҳар эшигимиз олдига тўпланган эди».
        </p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            {' '}
            Ушбу воқеанинг давоми Нурлуқ (р.а.) нинг мусаннафида бундай деб
            ёзилган:{' '}
          </span>
          «Исо (алайҳис-салом) келган беморларнинг ҳар бирига шифо бердилар.
          Кўпларнинг ичидан жин чиқди. Чиқаётганда улар: “Сиз Ворисул-Аҳдсиз,
          Оллоҳ юборган Халифасиз!” деб бақиришар, чунки у кишининг ал-Масиҳ
          эканлигини билишар эди. Исо (а.с.) эса уларга гапиришни маън қилар
          эдилар». <span className="vitalic"> Атоуллоҳ (р.а.) нинг айтишича, </span>{' '}
          шу тариқа Ишаъё пайғамбарнинг етти аср илгари: “У бизнинг
          касалларимизни олди, дардларимизга шифо берди”, деб айтган башорати
          амалга ошган.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>4-боб: Бир моховнинг шифо топиши</p>
      </div>

      <div className="main_text">
        {openBubbles['bubble5'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble5')}
          >
            <p>
              <sup>5</sup> Нурлуқ (р.а.) нинг мусаннафида ёзилишича, у одамнинг
              бутун баданини мохов босган, соғ жойи деярли қолмаган эди.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble5')}>
          <span className="vitalic">
            {' '}
            Миррих раҳимаҳуллоҳу алайҳ Сафвон раҳматуллоҳи алайҳдан эшитиб ўз
            мусаннафида баён этганларки:{' '}
          </span>
          «Бир куни моховга чалинган бир одам<sup>5</sup> Исо (а.с.) нинг
          олдларига келиб, тиз чўкиб: «Ҳазратим, агар истасангиз мени поклай
          оласиз», деди. Устоз унинг ҳолига ачиниб, қўлларини унинг танасига
          қўйдилар ва: «Истайман, пок бўл», дедилар. Мохов шу заҳоти дардидан
          фориғ бўлди.
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble6'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble6')}
          >
            <p>
              <sup>6</sup> Хабар бу ерда қисқартириб берилди. Тўлиқ матнда ҳазрати
              Исо (а.с.) нинг: «Бориб, ўзингни руҳонийга кўрсат, Мусо пайғамбар
              буюрган қурбонликни бер. Қурбонлигинг покланганингга гувоҳ бўлади»,
              деган сўзлари ҳам бор. Чунки мохов касаллигига чалинган инсон
              жамиятдан четлатилар, кейин мабодо шифо топса, руҳонийлар буни
              тасдиқлаши лозим эди.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble6')}>
          Расулуллоҳ унга: «Бу ҳақда ҳеч кимга ҳеч нарса дема»,<sup>6</sup> деб
          қаттиқ тайинладилар. У эса бориб ҳаммага ўзининг қандай шифо топганини
          айта бошлади. Натижада бўлган воқеа баёни дарров ҳамма ёққа овоза бўлди
          ва Исо (а.с.) шаҳарларга очиқча киролмайдиган бўлиб қолдилар».
        </p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic"> Нурлуқ (р.а.) нинг мусаннафи бўйича, </span>
          шифо топиш учун, таълим олиш учун келаётган одамлар сони ниҳоятда кўп
          эди. Шу сабабдан Исо (а.с.) ҳатто дуо қилиш учун ҳам кўпинча хилват
          жойларга бориб дуо қилар эдилар.
        </p>
      </div>
    </main>
  );
}