'use client';

import '../../../qisas-uzb/stories.css';
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function MiraclesPartFive() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble25',
    'bubble26',
    'bubble27',
  ]);

  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>20-боб: Кар ва гунг бўлган боланинг шифо топиши</p>
      </div>

      <div className="main_text">
        <p>
          Бир дафъа Исо (а.с.) учта шогирди билан тоғда бир кун бирга бўлиб
          қайтиб келадилар{' '}
          <span className="vitalic">
            {' '}
            ва бир болани жиндан фориғ қиладилар. Миррих (р.а.) ушбу воқеани
            Сафвон (р.а.) дан бундай деб ривоят қилган:{' '}
          </span>
          «Биз қайтиб келсак, бир талай оломон йиғилиб турган экан. Бир нечта
          фиқҳ олими саҳобалар билан ниманидир баҳслашар эди. Одамлар
          расулуллоҳни кўриб, хурсанд бўлиб, саломлашиш учун югуриб олдимизга
          келдилар.
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble25'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble25')}
          >
            <p>
              <sup>25</sup> Нурлуқ (р.а.) нинг мусаннафида зикр қилинишича, у
              унинг яккаю ёлғиз фарзанди эди.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble25')}>
          «Нима ҳақда тортишяпсизлар?» деб сўрадилар Исо (а.с.). Шунда бир киши
          халқ орасидан чиқиб: «Устоз, ўғлимни<sup>25</sup> олиб келувдим. Ичига
          жин кириб, гапиртирмай қўйган. Қачон қўзиса, олиб ерга уради, оғзидан
          кўпик чиқиб, тиришиб қотиб қолади. Шогирдларингизга айтган эдим, ёрдам
          бериша олмади», деди йиғлаб.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Эй имонсиз бузуқ насл, — дедилар у киши шогирдларига танбеҳ бериб. —
          Қачонгача сизларга тоқат қилай?» Кейин ҳалиги одамга: «Ўғлингизни
          келтиринг», дедилар. Болани олиб келишди. Расулуллоҳни кўриши билан
          жин болани ерга йиқитди. Танаси эгилиб-буришиб, оғзидан кўпик чиқа
          бошлади. «Қанча бўлди?» деб сўрадилар устоз. «Кичкиналигидан шундай, —
          деди отаси. — Баъзан ўзини оловга уради, баъзан сувга ташлайди. Охир бу
          жин уни ўлдиради. Раҳм қилинг! Ёрдам беролсангиз беринг!»
        </p>
        <p>
          «Ёрдам беролсангиз, дейсизми? — деб сўрадилар Оллоҳнинг расули. — Агар
          ишонсангиз ҳамма нарсанинг иложи бор».
        </p>
        <p>
          У шу заҳоти: «Ишонаман! Ишонаман! Ишончсизликдан мени қутқаринг!» деди
          фарёд қилиб.
        </p>
      </div>

      <div className="main_text">
        <p>
          Атрофда одам кўпаяётганини кўриб Исо (а.с.) жинга: «Эй карлик ва
          гунглик руҳи! Боланинг ичидан чиқ! Унга бошқа кирмайсан!» деб амр
          қилдилар. Шунда жин яна бир марта болани қийнаб, тутқаноққа солиб,
          ичидан чиқиб кетди. Бола ўлик каби беҳаракат ётиб қолди. Одамлар:
          «Қара, қара, ўлиб қолди», дер эдилар. Лекин устозимиз уни қўлидан ушлаб
          кўтардилар. Бола ўрнидан турди. Қулоғи эшитар, тили гапга келган эди».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>“Нега биз чиқара олмадик?”</p>
      </div>

      <div className="main_text">
        {openBubbles['bubble26'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble26')}
          >
            <p>
              <sup>26</sup> Атоуллоҳ (р.а.) нинг мусаннафида ёзилишича Исо (а.с.)
              уларга яна: «Имонингиз сустлиги учун чиқара олмадингиз, — деб
              айтган эканлар. — Сизларга айтаманки, агар Оллоҳга тариқча
              имонингиз бўлса, сизлар учун иложсиз нарсанинг ўзи бўлмайди, мана
              бу тоғга у ердан кўчиб бу ёққа ўт, десангиз ўтади».
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble26')}>
          <span className="vitalic">
            {' '}
            Миррих (р.а.) нинг мусаннафида Сафвон (р.а.) қилган мана бу ривоят
            бор:{' '}
          </span>
          «Кейинроқ расулуллоҳ якка ўзлари қолганларида, шогирдлари у кишининг
          ҳузурига кириб: «Биз нима учун жинни ҳайдаб чиқара олмадик?» деб
          сўрадилар. У киши эса: «Бу тоифа жинларни фақат дуо билан ҳайдаш
          мумкин», деб жавоб бердилар».<sup>26</sup>
        </p>
      </div>

      <div className="paragraph_heading">
        <p>21-боб: Балиқ оғзидан чиққан танга</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            {' '}
            Атоуллоҳ (р.а.) нинг мусаннафида Сафвон (р.а.) нинг мана бу ривояти
            зикр қилинган: Сафвон (р.а.) дан:{' '}
          </span>
          «Кафру Ноҳумга келганимизда, Байтуллоҳ учун солиқ йиғувчи одамлар
          олдимга келиб: «Устозингиз Байтуллоҳ учун солиқ бермайдими? Одам бошига
          икки дирҳамдан солиқ йиғяпмиз», дейишди. Мен: «Берадилар», деб уйга,
          устозимиз ҳузурига кирдим.
        </p>
        <p>
          Киришим билан жаноби расулуллоҳ мендан аввал гап бошлаб: «Нима деб
          ўйлайсан, Сафвон, подшоҳлар ўз аҳлидан ҳам солиқ оладими ё фақат
          бегоналарданми?» деб сўрадилар. «Бегоналардан, албатта», деб жавоб
          бердим мен. «Демак, подшоҳ аҳли солиқдан озод экан-да, — дедилар у
          киши. — Шундай бўлса ҳам майли, уларнинг асабига тегмайлик. Кўлга бориб
          чангак сол. Биринчи илинган балиқнинг оғзидан тўрт дирҳамли танга
          чиқади. Олиб келиб мен учун ҳам, ўзинг учун ҳам солиқ тўла», дедилар».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>22-боб: «Ким мен билан бўлмаса, менга қаршидур...»</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            {' '}
            Ушбу воқеа Атоуллоҳ, Нурлуқ ҳамда Миррих (р.а.) ларнинг
            мусаннафларида зикр қилинган. Атоуллоҳ (р.а.) ривоят қиладилар:{' '}
          </span>
          «Бир куни одамлар расулуллоҳнинг олдига жинга чалиниб кўру соқов бўлган
          бир кишини келтиришди. У шифо топди: кўзи очилди, тили гапира бошлади.
          Кўрганларнинг ҳаммаси ҳайрон бўлиб: «Довуд тахтининг Вориси шу кишими?»
          деб сўрар эдилар. Тақводорлар эса воқеани эшитиб: «У жинларни
          Шайтоннинг кучи билан қувиб чиқаряпти», деб айтишди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Расулуллоҳ уларнинг фикрини билиб дедилар: «Гуруҳларга бўлинган ҳар
          қандай мамлакат хароб бўлади, орасига рахна тушган ҳар бир хонадон
          парчаланади. Агар шайтонлар ҳам ўзига ўзи қарши чиқса, қандай қилиб
          уларнинг ҳукумати давом этади деб ўйлайсиз? Сизлар: “У жинларни
          Шайтоннинг кучи билан чиқаряпти”, дедингиз. Шогирдларингиз-чи? Агар мен
          жинларни шайтоннинг кучи билан чиқараётган бўлсам, улар кимнинг кучи
          билан чиқаряпти? Шогирдларингиздан сўранг-чи, нима дер эканлар! Лекин
          агар мен жинларни Оллоҳнинг қудрати билан ҳайдаётган бўлсам, бу нарса —
          Халифат асрининг бошланганига далолатдир. Акс ҳолда бақувват одамнинг
          уйини қандай қилиб талон-тарож этиш мумкин? Талайдиган одам аввал уни
          боғлаши керак. Акс ҳолда уйига кириб, мол-мулкини ололмайди.
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble27'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble27')}
          >
            <p>
              <sup>27</sup> «Мен ерда ноҳақ кибру ҳаво қилиб юрадиган, агар барча
              оят-мўъжизаларни кўрсалар ҳам, уларга имон келтирмайдиган, Тўғри
              Йўлни кўрсалар уни (ўзлари учун) йўл қилиб олмайдиган, агар залолат
              — нотўғри йўлни кўрсалар, уни йўл қилиб оладиган кимсаларни Ўз
              оят-мўъжизаларимдан буриб юборурман (яъни, англаб етмайдиган қилиб
              қўюрман). Бунга сабаб, улар Бизнинг оятларимизни ёлғон деганлари ва
              у оятлардан ғофил бўлиб олганларидир» (Аъроф сураси, 146).
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble27')}>
          Билиб қўйинглар, ким мен билан бирга бўлмаса, у менга қарши. Ким мен
          билан йиғмаса, у сочаяпти. Сизларга айтаманки ҳар қандай гуноҳ, ҳар
          қандай ғийбату туҳмат кечирилади, лекин Оллоҳнинг Руҳига қарши айтилган
          гап кечирилмайди. Инсон Ўғлини камситсангиз кечирилади, лекин Оллоҳнинг
          Руҳини камситсангиз икки дунёда ҳам кечирилмайди.<sup>27</sup> Жин
          инсоннинг ичидан чиққач, дашту биёбонларга бориб, дам олишга жой
          излайди. Топмагач ўзига-ўзи, чиққан уйимга қайтиб бораман, дейди.
          Келиб уйни бўш, тоза ва ораста кўргач, ўзидан жирканчроқ бўлган еттита
          бошқа жинни олиб келиб ўша ерга жойлашадилар ва у одамнинг ҳоли
          аввалгисидан ҳам оғирроқ бўлади. Бу наслнинг ҳоли ҳам шундоғ бўлғуси».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>23-боб: Шанба куни шифо излаш мумкинми?</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            {' '}
            Нурлуқ (р.а.) нинг мусаннафидан. Дин пешволари баъзи бир шариат
            амрларини Бани Исроил учун зулмга айлантирган эдилар. Ҳазрати Исо
            (а.с.) уларнинг шанба ҳақидаги тафсирига Инжил билан қарши чиқиб:
            «Инсон шанба учун эмас, балки шанба инсон учун берилган», деб
            айтадилар. Сафвон (р.а.) ривоят қилади:{' '}
          </span>
          «Исо (а.с.) шанба куни бир тиловатхонада таълим бераётган эдилар.
          Одамлар ичида ўн саккиз йилдан бери жин чалиб букчайиб қолган бир аёл
          ҳам бор эди. Устоз уни кўриб, қўлларини елкасига қўйиб: «Онажон,
          дардингиздан фориғ бўлдингиз», дедилар. Шу заҳоти онахоннинг қадди
          ростланди ва Оллоҳга ҳамду сано айта бошлади.
        </p>
        <p>
          Тиловатхона имоми эса, бу воқеа шанба куни содир бўлганидан аччиқланиб,
          одамларга: «Ишлаш учун бизга олти кун берилган. Шифо олмоқчи бўлсангиз,
          ўша кунларда келинг, шанба куни эмас!» деди.
        </p>
        <p>
          Расулуллоҳ эса унинг гапига жавобан: «Эй риёкорлар! Қайси бирингиз
          шанба куни мол ё эшагингизни ечиб суғоргани олиб бормайсиз? — деб
          сўрадилар. — Ўн саккиз йилдан бери шайтон боғлаб қўйган мана бу аёлни
          — Иброҳимнинг қизини — шанба куни озод қилмаслик керак эди,
          дейсизларми?» Бу гапдан сўнг мухолифларнинг ҳаммаси шарманда бўлди.
          Халқ эса расулуллоҳнинг мўъжизаларидан хурсанд эди».
        </p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic"> Нурлуқ (р.а.) саҳобалардан эшитиб ривоят қиладилар: </span>
          «Бир куни тақводорлар ҳизбининг бир имоми Исо (а.с.) ни уйига таом
          ейишга таклиф қилди. Шанба куни эди. Рақиблар устозни диққат билан
          кузатаётган пайт. У кишининг олдларида эса танасини шиш босган бир одам
          турган эди. Расулуллоҳ фақиҳ ва тақводорлардан: «Шанба куни одамларга
          шифо бериш ҳалолми-ҳаромми?» деб сўрадилар. Ҳеч ким жавоб бергани йўқ.
          Шунда устоз у одамга шифо бериб, уйига жўнатдилар-да, йиғилганларга
          қараб: «Агар эшак ё ҳўкизингиз шанба куни чуқурга тушиб кетса, шу куни
          чиқариб оласизларми-йўқми?» деб савол бердилар. Ҳеч ким ҳеч нарса деб
          жавоб беролмади».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>24-боб: Ўнта моховнинг шифо топгани</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            {' '}
            Нурлуқ (р.а.) саҳобалардан эшитган ушбу хабарда ҳазрати Исо (а.с.)
            нинг саҳобалар кўзи олдида ўнта моховга шифо бергани зикр қилинган:{' '}
          </span>
          «Қуддусга борадиган йўл Сомира ва Жалила вилоятлари чегарасидан ўтар
          эди. Бир қишлоққа кирар эканлар, Исо (а.с.) моховга чалинган ўнта
          одамни кўрдилар. Улар узоқроқда туриб, баланд овоз билан: «Ё ҳазратим!
          Бизга раҳм қилинг!» дер эдилар. Расулуллоҳ уларга: «Бориб ўзингизни
          руҳонийларга кўрсатинг», дедилар. Улар йўлда кетаётиб, моховдан фориғ
          бўлишди. Шифо топганларнинг бири сомирий эди. Танаси покланганини кўриб,
          у баланд овоз билан Оллоҳга ҳамдлар айтиб қайтиб келди ва
          расулуллоҳнинг оёқларига бош уриб миннатдорчилигини изҳор этди.
        </p>
        <p>
          «Шифо топганлар ўнта эмасмиди? Қолган тўққизингиз қани? — деб
          сўрадилар расулуллоҳ. — Бу чет элликдан бошқа ҳеч ким Оллоҳни улуғлаш
          учун қайтиб келмадими?» Кейин сомирийга: «Тур, бора қол, имонинг сенга
          нажот берди», дедилар».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>25-боб: Ибн Тайманинг кўзи очилгани</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic"> Миррих (р.а.) нинг мусаннафидан. Сафвон (р.а.) ривоят қиладилар: </span>
          «Расулуллоҳ, у кишининг шогирдлари ҳамда уларга эргашган катта бир
          оломон Ариҳодан чиқар эканмиз, йўл бўйида ибн Тайма деган бир гадой
          тиланчилик қилиб ўтирган эди. Унинг кўзлари кўр экан. Носиралик Исо
          ўтяпти деб эшитиб у: «Исо, ҳазратим, Довуд тахтининг вориси, менга раҳм
          қилинг!» деб бақира бошлади. Бир неча киши унга танбеҳ бериб, жим бўл,
          бақирма, деса ҳам, у овозини баланд кўтариб: «Довуд подшоҳнинг вориси,
          менга раҳм қилинг!» деб ҳайқираверди.
        </p>
        <p>
          Оллоҳнинг расули тўхтаб: «Айтинглар, бу ерга келсин», деб амр
          қилдилар. Биз бориб унга: «Бўлди, қўрқма! Юр, устоз сени чақиряпти»,
          дедик. У тиззасидаги белбоғини четга итқитиб, ўрнидан сакраб турди-да,
          Исо (а.с.) нинг олдларига келди. «Мендан нима истайсиз?» деб сўрадилар
          расулуллоҳ. «Мавлойим, — деди у. — Кўзларимни кўрадиган қилиб беринг».
          «Кўзларингиз кўради, бораверинг. Имонингиз сизга шифо берди», дедилар
          устоз. Шу онда унинг кўзлари кўра бошлади (ва Оллоҳга ҳамду сано айтиб)
          Исо (а.с.) нинг ортидан эргашди».
        </p>
      </div>
    </main>
  );
}