'use client';

import '../../../qisas-uzb/stories.css';
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function MiraclesPartFour() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble21',
    'bubble22',
    'bubble23',
    'bubble24',
  ]);

  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>15-боб: Расулуллоҳнинг сув юзида юрганлари</p>
      </div>

      <div className="main_text">
        {openBubbles['bubble21'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble21')}
          >
            <p>
              <sup>21</sup> Исо (а.с.) нинг сув устида юрганлари ҳақида Аҳмад
              бин Ҳанбалнинг “Аз-зуҳд” китобида ҳам ёзилган (74-77 бетлар).
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble21')}>
          <span className="vitalic"> Миррих (р.а.) Сафвон (р.а.) дан ривоят қиладилар: </span>
          «Устозимиз бизни бир куни қайиққа ўтқазиб, кўлнинг нариги қирғоғига —
          Байт-Сайдога жўнатдилар. Ўзлари эса жамоани тарқатиб, (ёлғиз
          қолганларидан сўнг) дуо қилиш учун тоққа чиқдилар. Қоронғу тушган эди.
          Биз минган қайиқ соҳилдан анча йироқда, расулуллоҳ эса қуруқликда
          эдилар. Кечаси тахминан соат уч-тўртларда, бизнинг шамолга қарши
          сузишга қийналаётганимизни кўриб, сув юзидан юриб, олдимиздан ўтмоқчи
          бўлдилар. Биз у кишининг сув устида<sup>21</sup> юриб келаётганларини
          кўриб, арвоҳ деб ўйлаб, бақириб юбордик. Ҳаммамиз қаттиқ қўрқиб кетган
          эдик. Устозимиз дарров: «Қўрқманглар, бу менман!» деб бизни
          тинчлантирдилар».
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble22'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble22')}
          >
            <p>
              <sup>22</sup> Шогирдлар ҳайрон эди. Улар нон мўъжизасидан ҳам
              ибрат олмаган эдилар.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble22')}>
          <span className="vitalic">
            {' '}
            Атоуллоҳ (р.а.) ҳам ушбу воқеанинг шоҳиди бўлганлар. У киши бундай деб
            ривоят қиладилар:{' '}
          </span>
          «Шунда биродаримиз Сафвон: «Ҳазратим, менга айтинг, мен ҳам сувнинг
          устидан юриб, олдингизга борай», деди. У киши: «Кел», деб амр
          қилганларидан сўнг, қайиқдан тушиб, расулуллоҳ тарафга йўл олди. Лекин
          шамолни кўриб қўрқди ва дарров сувга чўка бошлади: «Ҳазрат, қутқаринг!»
          Расулуллоҳ дарров унинг қўлидан ушлаб дедилар: «Эй имони суст, нега
          доим шубҳаланаверасан?» Сўнг қайиққа чиқдилар. Қайиққа ўтиришлари билан
          шамол тинди.<sup>22</sup> Ҳаммамиз ҳайратдан лол эдик. Кейин у кишининг
          олдларида таъзим қилиб: «Сиз ҳақиқатан ҳам Инсон Ўғлисиз, Оллоҳ тайин
          этган Ғавссиз!» деб эътироф этдик».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>16-боб: Жалилада одамларнинг шифо топгани</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic"> Миррих (р.а.) Сафвон (р.а.) дан ривоят қилади: </span>
          «Жалила ерига келиб қайиқдан тушдик. Одамлар дарров расулуллоҳни таниб,
          бутун вилоятга овоза қилдилар: касалларини тўшакка солиб, у кишини
          қаерда деб эшитсалар ўша ёққа, қишлоқма-қишлоқ, шаҳарма-шаҳар
          орқаларидан эргашиб кела бошладилар. Касалларни майдонларга қўйиб, ҳеч
          бўлмаса этагингизга қўл теккизайлик, деб илтимос қилишар, қўли
          текканлар эса ҳаммаси шифо топар эди».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>17-боб: Канъонлик аёлнинг қизи шифо топади</p>
      </div>

      <div className="main_text">
        {openBubbles['bubble23'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble23')}
          >
            <p>
              <sup>23</sup> Исо (а.с.) бу пайтда икки-уч ҳафта мобайнида
              шогирдлари билан ғайрияҳудийлар ҳудудида сафар қилиб юрган эдилар.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble23')}>
          <span className="vitalic">
            {' '}
            Ўн икки саҳобадан бири бўлмиш Атоуллоҳ (р.а.) ривоят қиладилар:{' '}
          </span>
          «Сур минтақасига келганимизда<sup>23</sup> канъонлик бир ғайрияҳудий аёл
          устозимиз олдига келиб фарёд чекиб деди: «Ё ҳазратим, Довуд
          салтанатининг вориси, раҳм қилинг! Қизимни жин урган, қаттиқ азобда!»
          Лекин Оллоҳнинг расули бир оғиз ҳам жавоб бермадилар. Шунда биз у
          кишининг олдларига келиб: «Устоз, уни жўнатиб юборинг, орқамиздан
          бақириб юрибди», дедик. Расулуллоҳ эса бизга қараб: «Мен фақат
          Исроилнинг адашган қўйлари учун келмаганманми?» деб ҳазиллашдилар.
          Ҳалиги аёл яна келиб, тиз чўкиб: «Ҳазратим, ёрдам беринг!» деди.
          «Болаларнинг нонини итларга бериш тўғри эмас, дейдилар. Сиз нима
          дейсиз?» деб сўрадилар у киши. «Ҳа, ҳазратим, лекин итлар ҳам эгасининг
          дастурхонидан тушган ушоқларни ейди-ку!» деб жавоб берди аёл.
          «Онагинам! Имонингиз кучли экан! — дедилар расулуллоҳ. — Бораверинг,
          тилагингиз амалга ошди!» Аёл уйига келиб қараса, жин чиқиб кетган, қизи
          соғайган эди».{' '}
          <span className="vitalic">Ушбу хабар Миррих (р.а.) нинг мусаннафида ҳам зикр қилинган.</span>
        </p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic"> Атоуллоҳ (р.а.) юқоридаги хабарни бу тариқа давом эттиради: </span>
          «Расулуллоҳ Жалила кўли бўйлаб бироз масофа йўл юрдилар ва бир тепаликка
          чиқиб ўлтирдилар. Ҳадемай катта оломон, ўзлари билан шол, чўлоқ, кўр,
          соқов ва бошқа касалларини олиб келган одамлар у кишининг ҳузурига
          йиғилди <span className="vitalic"> ва мўъжизалар бошланди: </span>
          соқовлар гапираётган, чўлоқлар соғайган, шоллар юраётган, кўрларнинг
          кўзи ёруғ дунёни кўраётган эди. Ҳайратдан ёқа ушлаган халқ Оллоҳга
          ҳамду сано айтар эди».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>18-боб: Тўрт минг одамга нон бериш</p>
      </div>

      <div className="main_text">
        {openBubbles['bubble24'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble24')}
          >
            <p>
              <sup>24</sup> Ушбу воқеа ғайрияҳудийлар юртида содир бўлган.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble24')}>
          <span className="vitalic">
            {' '}
            Миррих (р.а.) нинг мусаннафида битилган ушбу воқеага минглаб одамлар
            шоҳид бўлган эди. Сафвон (р.а.) ривоят қиладилар:{' '}
          </span>
          «Бир куни жуда кўп одам тўпланди. Лекин ейишга озуқалари йўқ эди.
          Устозимиз бизни чақириб: «Одамларга раҳмим келяпти, уч кундан бери шу
          ерда, лекин егани ҳеч нарсаси йўқ, – дедилар. — Агар шу ҳолда уйларига
          жўнатсам, йўлда қийналиб қолишади. Баъзилари узоқдан келган». Биз эса:
          «Бу биёбонда шунча одамга қаердан емак топамиз?» деб сўрадик. «Нечта
          нонингиз бор?» дедилар расулуллоҳ. «Еттита», деб жавоб бердик. Шунда у
          киши одамларни ерга ўтқазишни буюриб, етти нонни олиб, шукрона айтиб
          синдирдилар ва халққа тарқатинг, деб бизга бердилар. Бизда бир неча
          майда балиқ ҳам бор эди. Расулуллоҳ балиқлар учун ҳам дуо қилиб, бизга
          бердилар, биз халққа тарқатдик. Ҳамма еб тўйди. Ортиб қолган бурдаларни
          йиғиб олганимизда етти сават тўлди. Тўпланган одамлар сони эса тахминан
          тўрт минг киши эди».<sup>24</sup>{' '}
          <span className="vitalic">(Атоуллоҳ (р.а.) да ҳам ривоят қилинган.)</span>
        </p>
      </div>

      <div className="paragraph_heading">
        <p>19-боб: «Одамлар дарахтларга ўхшаб кўриняпти»</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic"> Миррих (р.а.) Сафвон (р.а.) нинг тилидан ривоят қиладилар: </span>
          «Байт-Сайдо қишлоғига келганимизда Исо (а.с.) нинг ҳузурига кўзи кўр
          бир одамни келтиришди. Расулуллоҳ уни қўлидан ушлаб, қишлоқ ташқарисига
          олиб чиқдилар. Кейин икки кўзига туфлаб, қўлларини теккиздилар-да:
          «Қара-чи, бирор нарса кўряпсанми?» деб сўрадилар.
        </p>

        <p>
          У бошини кўтариб: «Одамлар юраётганини кўряпман, лекин дарахтларга
          ўхшаб кўриняпти», деди. Исо (а.с.) иккинчи марта унинг кўзига қўл
          қўйдилар. Бу сафар кўзи тўлиқ очилиб, ҳамма нарсани аниқ-равшан кўра
          бошлади. Расулуллоҳ уни уйига жўнатар эканлар: «Қишлоққа кирма!» деб
          тайинладилар».
        </p>
      </div>
    </main>
  );
}