'use client';

 
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function MonarchyStarted() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble1',
    'bubble2',
    'bubble3',
    'bubble4',
  ]);

  return (
    <main className="stories relative">
      <article className="sm:flex gap-6">
        <div className="sm:w-1/2">
          <p className='!text-[14px]'>
            «Сиз бани Исроилдан бўл­ган, Мусодан кейинги бир жамоатнинг
            ҳоли-ха­ба­рини билма­дин­гизми? Қай­сики, улар ўз­ла­ри­нинг
            пай­ғам­бар­ларига: «Биз учун бир под­шоҳ тайинла, биз (у би­лан
            бирга) Оллоҳ йўлида жанг қилайлик», дейиш­ди...»{' '}
             
            <span className="">(Ба­қа­ра сураси, 246).</span>
          </p>
        </div>

        <div className="hidden sm:block sm:w-1/2">
          <p dir="rtl" 
                  lang="ar" 
                  className="font-amiri !text-[16px] !leading-[26px] text-justify">
            أَلَمْ تَرَ إِلَى ٱلْمَلَإِ مِنۢ بَنِىٓ إِسْرَٰٓءِيلَ مِنۢ بَعْدِ
            مُوسَىٰٓ إِذْ قَالُوا۟ لِنَبِىٍّۢ لَّهُمُ ٱبْعَثْ لَنَا مَلِكًۭا
            نُّقَـٰتِلْ فِى سَبِيلِ ٱللَّهِ ۖ قَالَ هَلْ عَسَيْتُمْ إِن كُتِبَ
            عَلَيْكُمُ ٱلْقِتَالُ أَلَّا تُقَـٰتِلُوا۟ ۖ قَالُوا۟ وَمَا لَنَآ
            أَلَّا نُقَـٰتِلَ فِى سَبِيلِ ٱللَّهِ وَقَدْ أُخْرِجْنَا مِن
            دِيَـٰرِنَا وَأَبْنَآئِنَا ۖ فَلَمَّا كُتِبَ عَلَيْهِمُ
            ٱلْقِتَالُ تَوَلَّوْا۟ إِلَّا قَلِيلًۭا مِّنْهُمْ ۗ وَٱللَّهُ
            عَلِيمٌۢ بِٱلظَّـٰلِمِينَ
          </p>
        </div>
      </article>

      <div className="paragraph_heading">
        <p> “БИЗГА ПОДШОҲ ТАЙИНЛАНГ!” </p>
      </div>

      <div className="main_text">
        <p>
          Ҳазрати Сомуилнинг икки ўғли бўлиб, каттасининг исми Ёйил, кичигининг
          исми Обиё эди. Сомуил пайғамбар қаригач, ўғил­ларини Беър-Шебада ҳакам
          қилиб та­йин­ладилар. Лекин улар ота йўлидан юр­май, ҳаром пулга,
          порага ружуъ қўйишди. Ноҳақ ҳукмлар чиқариб адолатни оёқ-ости қилишди.
        </p>
        <p></p>
      </div>

      <div className="main_text">
        {openBubbles['bubble1'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble1')}
          >
            <p>
              <sup>1</sup> У пайтларда Бани Исроилни ҳакамлар бошқарар эди.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble1')}>
          Шунда Исроил оқсоқоллари Рамага, Со­му­ил пайғамбарнинг олдига
          йиғилиб: «Мана, ёшин­гиз ўтди, қаридингиз, ўғилларин­гиз эса сизнинг
          йўлингиздан юрмади. Энди биз­га подшоҳ тайинланг, бизни ҳам бошқа
          халқ­лар каби подшоҳ<sup>1</sup> бошқарсин», деб илти­мос қилдилар.
        </p>
      </div>

      <div className="paragraph_heading">
        <p> ХАЛҚ КИМНИ РАД ҚИЛДИ? </p>
      </div>

      <div className="main_text">
        <p>
          Сомуил (а.с.) уларнинг, бизни подшоҳ бошқар­син, деган гапидан қаттиқ
          хафа бўл­дилар. Бориб дуо қилган эдилар, Оллоҳ азза ва жалла у кишига:
        </p>

        <p>
          «Одамларнинг айтганини қи­лавер, – деди. – Улар сени эмас, Мени рад
          қи­лишди. Менинг подшоҳ бўлишимни истамадилар. Улар доим Мендан юз
          ўгириб, бут­лар­га кўнгил қўяди. Мисрдан олиб чиқ­қа­ним­дан бери шу
          аҳвол. Бас, сўраган нарса­сини бер. Фақат аввал, подшоҳ қи­лади­ган
          ишлар ҳақида яхшилаб огоҳ­лан­тир», деди.
        </p>

        <p>Сомуил (а.с.) одамларга Худонинг сўзини етка­зиб дедилар:</p>

        <p>
          «Билиб қўйинглар, агар сизларни подшоҳ бошқарадиган бўлса,
          ўғил­ларингизни ўзига аскар қилади. Кимни­дир элликтага, кимнидир
          мингтага бошлиқ қилиб тайинлайди. Экинларини сизларга эктиради,
          хирмонини сизларга йиғдиради. Баъзиларингиз унга қурол-аслаҳа ясайсиз,
          баъзиларингиз жанг араваларини тузатасиз.
        </p>

        <p>
          Қиз­ларин­гиз у учун атирсозлик қилади, овқатла­ри­ни пиширади. Энг
          яхши ер­ла­рингизни, энг сара узумзору зайтун­ла­рин­гизни амалдорларига
          бўлиб беради. Кўтарган ҳосилингизнинг ўндан бирини тортиб олиб,
          аъёнларига тақсимлайди, қул-чўри­ла­рингизни, энг яхши уловларин­гиз­ни
          олиб қўяди.
        </p>

        <p>
          Сурувларингизнинг ўн­дан бири­ни беришга масъул бўласиз.
          Ўз­ла­рин­гиз сай­лаган подшоҳ сизларни қул қилгач, оҳу нола қиласизлар,
          лекин Оллоҳ додингизни эшит­майди».
        </p>

        <p>
          Аммо халқ қулоқ солишни истамади: «Йўқ, бизни подшоҳ идора қилсин.
          Бошқа халқлардай бизнинг ҳам подшоҳимиз бўлсин, бизга раҳнамолик
          қилсин, жангу жадалга бошласин», деди.
        </p>

        <p>
          Ҳазрати Сомуил халқнинг гапини охиригача тингладилар. Кейин бориб,
          Худога дуо қил­дилар. Оллоҳ таоло Сомуил (а.с.) га: «Улар­нинг
          айтганини қил, устларидан подшоҳ тайинла», деди.
        </p>

        <p>
          Шундан сўнг у киши халққа: «Яхши, сизлар айтгандай бў­ла­ди. Энди
          уй-уйингизга тарқалинг», де­ди­лар.
        </p>
      </div>

      <div className="paragraph_heading">
        <p> ТОЛУТНИНГ ЭШАКЛАРИ </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble2'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble2')}
          >
            <p>
              <sup>2</sup> Қайснинг отасининг исми Абиэл, бувасининг исми Сарўр,
              бувасининг отаси Бакорт, унинг отаси­нинг исми эса Афиҳ эди.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble2')}>
          Бинямин қабиласида Қайс<sup>2</sup> деган таниқли бир одам бор эди.
          Қайснинг Толут деган ўғли бўлиб, исроилликлар ичида ундан кўра
          хушсурат ва хушандом йигит йўқ эди. Бўйи ҳам баланд бўлиб, бошқалар
          унинг елкасидан келар эдилар.
        </p>

        <p></p>
      </div>

      <div className="main_text">
        <p>
          Бир куни уларнинг эшаклари йўқолиб қолди. Отаси унга:
          «Хизматкорлардан бири­ни олиб эшакларни изла», деди.
        </p>

        <p>
          Толут Аф­ройим тоғини ҳам, Шалиш атрофларини ҳам, кейин Шаалим ва
          Бинямин ҳудудини ҳам кезиб чиқди. Эшаклар ҳеч қаерда йўқ эди.
        </p>

        <p>
          Суфга келганларида у хизматкорига: «Энди орқага қайтамиз, отам эшаклар
          қолиб, биздан хавотир олиб юрмасин», деди.
        </p>

        <p></p>
      </div>

      <div className="main_text">
        {openBubbles['bubble3'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble3')}
          >
            <p>
              <sup>3</sup> Салабий. “Ароис”, 265-бет.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble3')}>
          Хизматкори эса: «Шошманг, шу шаҳарда бир авлиё одам бор. Ҳамма уни
          ҳурмат қилади. Айтган гаплари ҳеч амалга ошмай қолмас экан. Балки у
          бизга йўл кўрсатар?» деди.<sup>3</sup>
        </p>

        <p>«Қуруқ қўл билан борамизми? – деб сўради Толут. – Тўрвада нонимиз ҳам қолмади!»</p>

        <p>«Менда озгина кумуш пул бор, шуни бе­ра­миз», деди хизматкори.</p>
      </div>

      <div className="main_text">
        {openBubbles['bubble4'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble4')}
          >
            <p>
              <sup>4</sup> Ўша пайтда исроилликлар пай­ғамбарларни “кўрувчи” деб
              атар, Худодан бирор нарса сў­ра­моқчи бўлсалар, “юр,
              кўрув­чи­нинг олдига борамиз”, де­йи­шар эди.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble4')}>
          Шаҳар тепаликда жойлашган эди. Тепага чиқаётганларида сув олишга
          келаётган қизларни тўхтатиб: «Кўрувчи<sup>4</sup> ҳозир шаҳардами?»
          деб сўрадилар.
        </p>

        <p>
          «Ҳа, ҳозиргина ўтиб кетди, – дейишди қизлар, – шаҳарга ҳозир келди.
          Бугун те­паликда қурбонлик сўйиляпти. У киши қурбон­гоҳда таклиф
          қилинган одамлар билан бирга зиёфат ейди. То дуо қилиб бермасалар,
          одамлар қурбонликларни ейиш­майди. Тезроқ юрсангиз, шаҳар дарвозасида
          у кишига етиб оласиз».
        </p>

        <p>
          Толут билан хизматкори қадамларини тезлат­дилар. Шаҳарга кираётганларида
          қурбон­ гоҳга кетаётган Сомуил пайғамбарга рўпара бўлишди.
        </p>
      </div>

      <div className="paragraph_heading">
        <p> “БУТУН ИСРОИЛ ЭНДИ СЕНИКИ БЎЛАДИ” </p>
      </div>

      <div className="main_text">
        <p>
          Бир кун аввал Оллоҳ таоло Сомуил (а.с.) га: «Эртага шу пайтда Мен
          сенинг олдингга биняминлик бир йигитни юбораман. Сен уни Бани Исроил
          устидан подшоҳ­лик­ка масҳ этасан. У халқимни филис­тий­лардан
          қутқаради, чунки Мен улар­нинг нолаларини эшитдим», деб айтган эди.
        </p>

        <p>
          Сомуил пайғамбар Толутни кўриши билан Худо унга: «Мен сенга айтган
          одам шу. Шу йигит Бани Исроилга подшоҳ бўлади», деди.
        </p>

        <p>
          «Биз кўрувчининг уйини излаётувдик, – деб мурожаат қилди Толут у
          кишига, – қаер­да­ли­гини айтолмайсизми?»
        </p>

        <p>
          «Мен кўрувчиман, – деб жавоб берди­лар Сомуил пайғамбар. – Юр, бугун
          мен билан зиёфат ейсан. Эртага эрталаб са­волла­рингга жавоб бераман,
          кейин уйинг­га қай­та­сан. Эшакларингни ўйлама, топилди. Энди бутун
          Исроил сенга ва сенинг отангнинг уйи­га тааллуқли бўлади!»
        </p>

        <p>
          «Бизнинг қабиламиз Исроилдаги энг кичкина қабила, – деди Толут. –
          Уруғимиз ҳам Бинямин уруғлари ичида энг кичиги. Нега бундай дейсиз?»
        </p>

        <p>
          Тепаликка чиққанларидан сўнг, Сомуил пайғамбар уларни ўттизтача одам
          ўтирган дас­турхоннинг энг тўрига ўтқаздилар. Кейин ошпазга: «Мен олиб
          қўй, деган гўштни кел­тир», дедилар. Ошпаз бир бўлак сонни кел­ти­риб
          Толутнинг олдига қўйди.
        </p>

        <p>
          «Ол е, – де­ди­лар Сомуил (а.с.), – мен одамларни чақир­ган­даёқ буни
          сенга ажратиб қўйган эдим».
        </p>

        <p>
          Шундай қилиб Толут, ўша куни Сомуил пай­ғамбар билан бирга таом еди.
          Ке­йин ша­ҳарга, уйга келиб тунни ўтказдилар. Меҳмон учун жой томга
          солинган эди.
        </p>

        <p>
          Эртасига эрталаб Со­му­ил пайғамбар: «Кузатиб қўяй», деб улар билан
          бирга йўлга тушдилар. Шаҳардан чиққанларидан сўнг, Толутга:
          «Хизматкорингга айт, олдинроқда юрсин. Мен сенга Оллоҳнинг пайғомини
          айт­моқчиман», дедилар.
        </p>
      </div>

      <div className="paragraph_heading">
        <p> ЁҒ БИЛАН МАСҲ ҚИЛИШ </p>
      </div>

      <div className="main_text">
        <p>
          Кейин зайтун ёғи солинган идишини олиб, Толутнинг бошига ёғ суркадилар
          ва ўпиб дедилар:
        </p>

        <p>
          «Оллоҳ таоло сени Ўз халқи устидан подшоҳ қилиб масҳ этди. Бугун
          Салсаҳга етганингда, Бинямин чегарасида, Роҳийл Бибининг мозори олдида
          икки одам қаршингдан чиқади. Улар сенга, эшаклар топилди, отанг сендан
          хавотир оляпти, дейишади.
        </p>

        <p>
          Кейин Табардаги дарахтга етганингда ибодат қилиш учун Байтилга кетаётган
          уч одамни кўрасан. Бири уч улоқ, иккинчиси учта нон, учинчиси бир меш
          май олиб кетаётган бўлади. Сен билан сўрашиб, қўлингга икки нон
          беришади.
        </p>

        <p>
          Кейин Гивадаги Тангри тоғига, филистийлар қароргоҳига келасан. Шаҳарга
          кирганингда бир гуруҳ пайғамбарлар чолғу асбоблари билан зикр тушиб
          тепаликдан энаётган бўлади. Оллоҳнинг Руҳи устингга тушади – сен ҳам
          улар билан бирга зикр тушасан, бошқа одамга айланасан.
        </p>

        <p>
          Бу оятлар амалга ошгач, тўғри деб билган ишингни қилавер, чунки Оллоҳ
          сен билан! Кейин Гилгалга бор. Мен ҳам қурбонлик қилиш учун у ерга
          бораман. Етти кун мени кут: борганимда нима қилиш кераклигини сенга
          айтаман».
        </p>
      </div>
    </main>
  );
}