'use client';



export default function QuddusShorosi() {
  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>Қуддус шўроси</p>
      </div>

      <div className="main_text">
        <p>
          Толут билан Барнобо (р.а.) Антокияда эканлигида, Яҳузиядан келган
          баъзи кишилар у ердаги биродарларга: «Сизлар хатна бўлишингиз керак.
          Мусо пайғамбарнинг шариати шундай дейди. Хатна қилинмасангиз нажот
          топмайсиз», деб таълим берар эдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Толут билан Барнобо (р.а.) улар билан бу борада кўп тортишдилар. Охири
          бу мавзуъни саҳобалар-у жамоа оқсоқоллари ҳал қилишсин, деб Толут
          (р.а.) билан Барнобони у ердаги бир нечта биродарлар билан биргаликда
          Қуддусга жўнатишди. Қуддусга борар эканлар, улар йўл бўйи Финиқия ва
          Сомира шаҳарларидаги жамоалар билан кўришиб, ғайри яҳудийларнинг
          имонга келганини айтиб, ҳаммани хурсанд қилдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Қуддусда саҳобалар ва оқсоқоллар уларни яхши кутиб олишди. Кейин улар
          Худонинг улар орқали қилган барча ишларини айтиб беришди. Лекин
          тақводорлар фирқасидан Масиҳга имон келтирган бир нечта одам ўрнидан
          туриб: «Ғайри яҳудийлар имонга келса, уларни хатна қилишимиз керак.
          Улар ҳам шариатга риоят қилишлари лозим», дедилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шундан сўнг, саҳобалар ва оқсоқоллар бу ҳақда қарор қабул қилиш учун
          алоҳида мажлис тайин этдилар. Анча баҳс-тортишувлардан сўнг Сафвон
          (р.а.) ўрнидан туриб деди:
        </p>
      </div>

      <div className="main_text">
        <p>
          «Биродарлар, ҳаммангизга маълумки, ғайри яҳудийларга хушхабар етказиш
          учун Худо анча вақт олдин орамиздан мени танлаган эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ҳар бир инсоннинг қалбини биладиган Худо, Ўз Руҳини худди бизга
          бергандай, ғайри яҳудийларга ҳам ато этиб, уларни ҳам қабул қилганини
          бизга кўрсатди, биз билан уларнинг орасига ҳеч қандай фарқ қўймади.
          Бизнинг юрагимизни имон билан қандай поклаган бўлса, уларнинг юрагини
          ҳам шундай поклади. Унда нима учун биз оталаримиз ҳам, ўзимиз ҳам
          кўтара олмаган юкни бошқаларнинг елкасига юклаб, Худони синамоқчимиз?
          Нима, ҳазрати Исонинг текин ҳадяси билан ҳамма бирдай нажот топишига
          ишонмаймизми?»
        </p>
      </div>

      <div className="main_text">
        <p>
          Шу билан ҳамманинг оғзи боғланди ва Барнобо билан Толут (р.а.) га сўз
          бердилар. Барнобо билан Толут (р.а.), Худо улар орқали ғайри яҳудийлар
          орасида кўрсатган мўъжизаларни бирма-бир айтиб бердилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Улар гапириб бўлгандан кейин, Яъқуб (р.а.) ўрнидан туриб гап
          бошладилар: "Биродарлар, қулоқ солинглар! Сафвон сизларга Худонинг
          ғайри яҳудийлар орасида ҳам Ўз номини аён қилганини айтиб берди.
          Пайғамбарларнинг оятлари ҳам буни тасдиқлайди. Каломда ёзилганидай:
        </p>
      </div>

      <div className="main_text">
        <p>
          «Шундан кейин Мен қайтиб келиб, Довуднинг йиқилган салтанатини
          тиклайман. Ғайри яҳудийлар ҳам, Мен танлаган ҳамма халқлар ҳам Мени
          излаши учун унинг вайроналарини обод қиламан. Мана, Худованд Ўзининг
          азалий режасини сизларга очди».
        </p>
      </div>

      <div className="main_text">
        <p>
          Яъқуб (р.а.) гапларини давом эттирдилар: «Шунинг учун, менинг
          фикримча, Худога имон келтирган ғайри яҳудийларга муаммо туғдирмайлик.
          Фақат уларга, бутларга сўйилган ҳаром қурбонлик гўштидан, бўғилиб
          ўлган ҳайвонлар гўшти, шунингдек қон истеъмол қилишдан, ҳамда зинодан
          сақланинглар деб мактуб ёзайлик. Чунки бу амрлар қадим замонлардан
          бери ҳар бир шаҳарда ваъз қилинади, ҳар шанбада тиловатхоналарда
          айтилади».
        </p>
      </div>

      <div className="main_text">
        <p>
          Шундан сўнг саҳобалар ўзларидан икки кишини танлаб, Толут (р.а.) ва
          Барнобо (р.а.) лар билан бирга Антокияга жўнатишга қарор қилдилар. Бу
          икки киши Барсобо лақабли Яҳузо ва Силос бўлиб, иккиси ҳам жамоатда
          таниқли одамлар эди. Уларга берилган мактубда бундай деб ёзилган эди:
        </p>
      </div>

      <div className="main_text">
        <p>
          «Биз саҳобалар, жамоа оқсоқоллари ва Қуддусдаги барча имонлилар
          томонидан Антокия, Сурия ва Қилиқиядаги сиз ғайри яҳудий
          биродарларимизга салом!
        </p>
      </div>

      <div className="main_text">
        <p>
          Эшитишимизча, бизнинг жамоадан бир неча киши олдингизга бориб,
          ўзларича нималардир деб сизларни озурда қилибди. Уларни биз
          юбормаганмиз. Шу сабабдан энди, орамиздан икки кишини танлаб, Барнобо
          ва Толут билан бирга олдингизга жўнатишга қарор қилдик. Барнабо ҳам,
          Толут ҳам устозимиз Исо Масиҳ учун жонларини хатарга қўйган севикли
          биродарларимиздир.
        </p>
      </div>

      <div className="main_text">
        <p>
          Масалангиз борасида қандай қарор қабул қилганимизни Яҳузо билан Силос
          сизларга оғзаки тасдиқлаб беради. Чунки елкангизга ортиқча юк қўйиш
          Худонинг Руҳига ҳам, бизга ҳам ноўриндек туюлди. Фақат бутларга
          сўйилган қурбонлик гўштидан, ҳаром ўлган ҳайвонлар гўшти, шунингдек
          қон истеъмол қилишдан ва зинодан ўзларингизни асранг. Шунда яхши иш
          қилган бўласизлар. Саломат бўлинглар!»
        </p>
      </div>

      <div className="main_text">
        <p>
          Шундоғ қилиб, бу одамлар йўлга тушиб, Антокия шаҳрига етиб келдилар,
          имонлилар жамоасини бир ерга йиғиб, мактубни топширдилар. Улар
          мактубни ўқиб беҳад хурсанд бўлдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Яҳузо билан Силос -- уларда пайғамбарлик инъоми бор эди -- кўп
          насиҳатомиз сўзлар айтиб, биродарларни рағбатлантирди. Бироз муддатдан
          сўнг улар Қуддусга қайтиб кетишди, Толут билан Барнобо (р.а.) эса
          Антокияда қолиб, хушхабарни ваъз қилишда, таълим беришда давом этдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бир қанча вақтдан сўнг Толут (р.а.) Барнобога: «Худонинг каломини ваъз
          қилган шаҳарларимизга бориб, имонга келган биродарлардан хабар
          олайлик», деди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Барнобо хўп деб, Миррих лақабли Яҳёни ҳам ўзи билан бирга олиб
          кетмоқчи бўлди. Лекин Толут (р.а.) буни хоҳламади, чунки Миррих
          аввалроқ Памфилияда уларни тарк этиб, ҳамкорлик қилишдан бош тортган
          эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Уларнинг бу масалада ихтилофи шу қадар жиддийлашдики, охири
          бир-бирларидан айрилдилар. Барнобо Миррих билан Кипрга кетди. Толут
          (р.а.) Силосни танлади ва имонлилар дуосини олиб, Сурия ва Қилиқия
          жамоаларини мустаҳкамлаш учун сафарга чиқдилар.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Икромнинг хатна бўлгани</p>
      </div>

      <div className="main_text">
        <p>
          Кейин Толут (р.а.) Силос билан бирга Дарба шаҳрига, кейин ундан ўтиб
          Листра шаҳрига келдилар. Листрадаги жамоада Икром деган бир йигит бор
          эди. Онаси расулуллоҳга имон келтирган яҳудий, отаси эса юнон эди.
          Листра ва Қўниядаги биродарлар Икром ҳақида яхши гаплар айтар эдилар.
          Шунга Толут (р.а.) уни ўзи билан сафарга олиб кетмоқчи бўлдилар ва у
          ердаги яҳудийларнинг ҳурмати учун хатна қилдилар. Чунки унинг отаси
          юнон экани ҳаммага маълум эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Кейин шаҳарма-шаҳар кезиб, Қуддусдаги ҳаворийлар қабул қилган қарорни
          жамоатларга етказдилар. Жамоатлар имонда мустаҳкамланиб, кундан кунга
          сон жиҳатдан кўпаяр эди.
        </p>
      </div>
    </main>
  );
}