'use client';

import '../../../qisas-uzb/stories.css';
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function ZakariyaVaYahya() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble1',
    'bubble2',
    'bubble3',
    'bubble4',
    'bubble5',
    'bubble6',
    'bubble7',
    'bubble8',
  ]);

  return (
    <main className="stories relative">
      <article className="flex gap-6">
        <div className="sm:w-1/2">
          <p className='!text-green-600 sm:!text-gray-600 !text-[14px] leading-[15.5px]'>
           «Закариё дуо қилиб деди: «Раб­бим, мен­га ўз ҳу­зу­ринг­дан яхши бир
            фар­занд бер! Албатта Сен дуолар­ни эшит­гув­чи­сан»{' '}
            <span className=""> (Оли Имрон 38). </span>
          </p>
        </div>

        <div className="-mt-3 hidden sm:block sm:w-1/2 rtl">
          <p   dir="rtl" 
                  lang="ar" 
                  className="font-amiri !text-[18px] !leading-[44px]">
          
            هُنَالِكَ دَعَا زَكَرِيَّا رَبَّهُۥ ۖ قَالَ رَبِّ هَبْ لِى مِن
            لَّدُنكَ ذُرِّيَّةًۭ طَيِّبَةً ۖ إِنَّكَ سَمِيعُ ٱلدُّعَآءِ
          </p>
        </div>
      </article>


      <div className="main_text">
        <p></p>
        <p>
          <span className="vitalic">
            Исо (а.с.) нинг шогирдларидан бири бўл­миш Луқо (р.а.) нинг ривоят
            қи­лишича{' '}
          </span>
          Зака­риё алайҳис-салом под­шоҳ Ҳирудис даврида Яҳузия ви­ло­я­ти­да
          яша­ган­лар.
        </p>
        <p> </p>
        <p></p>
      </div>

      <div className="main_text">
        {openBubbles['bubble1'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble1')}
          >
            <p>
              <sup>1</sup> Салабий ёзишича, Закариё (а.с.) нинг ёши бу пайтда
              тўқсондан ошган эди (“Ароис”, 375-бет). Ибн-и Асирнинг “Комил”
              китобида ҳам шундай маълумот келган.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble1')}>
          У киши ҳам, аёли Ашба Биби ҳам Ҳорун авлодидан, яъни ру­ҳо­нийлар
          нас­лидан бўлиб, Оллоҳ­­нинг амр­ла­ри­га риоя қи­ла­ди­ган тақ­во­дор,
          солиҳ одам­лар эди. Лекин фар­занд­ла­ри йўқ эди – Ашба Биби туғмас,
          икка­ла­­си ҳам анча ёшга бориб қолган эдилар.<sup>1</sup>
        </p>
        <p></p>
      </div>

      <div className="main_text">
        <p className='vitalic'>
          Закариё (а.с.) фарзанд тилаб Оллоҳга кўп дуо­лар қилгани ҳақида
          Қуръоннинг Марям сурасида бундай деб ёзилган:
        </p>

        {openBubbles['bubble2'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble2')}
          >
            <p>
              <sup>2</sup> Қуръоннинг Оли Имрон су­ра­сида «яхши бир фарзанд»
              де­йилган (Оли Имрон 3:38).
            </p>
          </div>
        )}

        <p
          className="boldItalic cursor-pointer"
          onClick={() => toggleBubble('bubble2')}
        >
          “Пар­вар­ди­горим, мана, ме­нинг суяк­ла­рим мўрт­лаш­ди,
          кек­са­лик­дан бошим-со­чим оқар­ди. Ё Раббим, мен сенга дуо қи­либ{' '}
          <span className="vitalic"> (ҳеч қачон)</span> ноумид бўл­ган эмасман.
          Ор­тим­да қола­ди­ган қа­рин­дош-уруғларим{' '}
          <span className="vitalic"> (ди­ни­­мизни зое қи­либ юбо­риш­лари) </span>
          дан хавф­да­ман. Хо­ти­ним туғмас. Сен ўз дар­го­ҳингдан менга ва
          Яъқуб хонадонига ме­рос­xўр бўла­ди­ган бир валий<sup>2</sup> ҳадя эт,
          уни Ўзинг рози бў­ла­ди­ган{' '}
          <span className="vitalic">(солиҳ кишилардан)</span> қил!”{' '}
          <span className="vitalic">(Марям сураси 19:4-6).</span>
        </p>
      </div>

      <div className="paragraph_heading">
        <p> Дуоларининг ижобат бўлгани </p>
      </div>

      <div className="main_text">
        <p>
          Бир куни, кўп одамлар қурбонлик қилиш учун йиғилган вақтда меҳробга
          кириб ибодат қилиш шарафи ҳазрати За­ка­ри­ё­нинг чекига тушди.
          Ибодатни адо этаёт­ган­ларида, бир­дан қурбонгоҳнинг ўнг та­ра­фида бир
          фа­риш­та пайдо бўлди! Зака­риё (а.с.) уни кўриб қўрқиб кетдилар.
        </p>

        <p></p>
      </div>

      <div className="main_text">
        {openBubbles['bubble3'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble3')}
          >
            <p>
              <sup>3</sup> Қуръони каримда бу ҳақ­да бундай деб ёзилган:
              «Меҳ­роб­да дуо қилаётган вақ­ти­да фа­ришталар нидо қил­ди­лар:
              «Шодлан! Оллоҳ сенга Яҳё исм­ли фарзанд хуш­ха­ба­рини бе­рур! У
              Оллоҳ­нинг Сўзи­ни тас­диқ эта­ди­ган, хожа бўла­ди­ган, (ўзини
              ҳар нарсадан) тия­ди­ган солиҳ пай­ғамбар бўлур» (Ол-и Имрон 39).
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble3')}>
          «Қўрқма, – деди фаришта. – Мен сенинг олдингга яхши хабар билан
          келдим. Дуо­ла­ринг ижобат бўлди. Худо сенга ўғил ато этди. Хотининг
          ҳомиладор бўлиб ўғил ту­ға­ди. Исмини Яҳё қўясан.<sup>3</sup>
        </p>

        <p>
          Унинг та­вал­лу­ди сенга ва кўплаб одамларга шодлигу қу­вонч
          келтиради. Онасининг қорнидан қуд­сий руҳга тўлиб тушади. Оллоҳнинг
          ол­ди­да мартабаси баланд бўлади. Маю шароб ич­майди. Кўпларни
          Яратганга қайтаради, Илёс пайғамбарнинг руҳи ва қудратида ке­либ,
          оталарни фарзандларга, осийларни аҳли илмга тортади. Халқни Мавлононинг
          ке­ли­ши­га тайёрлайди».
        </p>

        <p></p>
      </div>

      <div className="main_text">
        {openBubbles['bubble4'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble4')}
          >
            <p>
              <sup>4</sup> Оли Имрон сураси 41-оят.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble4')}>
          «Шундай бўлишини қандай биламан? – деб сўради Закариё (а.с.). – Ахир
          мен ҳам, хотиним ҳам қариб қолганмиз,{' '}
          <span className="boldItalic">менга бир аломат кўрсат».</span>
          <sup>4</sup>
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble5'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble5')}
          >
            <p>
              <sup>5</sup> Оли Имрон сураси 40-оят.
            </p>
          </div>
        )}

         <p className="cursor-pointer" onClick={() => toggleBubble('bubble5')}>
          «Мен Оллоҳнинг даргоҳида хизмат қи­ла­ман. Исмим Жаб­ро­ил.

       
          <span className="boldItalic">Оллоҳ истаган иши­ни қилади.</span>
          <sup>5</sup> Бу гаплар ўз вақтида амал­га ошади. Лекин сен ўша
          пайт­гача тил­дан қоласан, чунки сўзларимга ишон­ма­динг.
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble6'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble6')}
          >
            <p>
              <sup>6</sup> Оли Имрон 41-оятда: «Сенга бериладиган оят шуки уч
              айём одам­ларга фақат рамз билан га­пи­ришингда бў­лади», деб
              ёзилган. Сомий тил­ларида «уч кун» ё «уч тун» деган сўз катта бир
              давр­ни ўз ичига олиши мумкин.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble6')}>
          <span className="boldItalic">Мана шу нарса сен учун оят-бел­ги бўлади»,</span>
          <sup>6</sup> деди фаришта.
        </p>

        <p>
          Бу пайтда одамлар ташқарида кутиб қо­либ, нега у шунча вақт ичкарида
          қолиб кетди, деб ҳайрон эдилар. Закариё (а.с.) ташқарига чиққач,
          одамлар бил­ди­ки, у меҳробда қандайдир бир рўё кўр­ган. Чунки
          гапиролмас, айтадиган нар­са­си­ни имо ишора билан англатаётган
          эди­лар.
        </p>

        <p>
          Ибодатлар тугагач, Закариё пайғамбар уйи­­га-оиласига қайтиб келдилар.
          Ора­дан ҳеч қанча вақт ўтмай, Ашба Биби ҳо­ми­ла­дор бўлди ва беш ой
          уйидан чиқмади. Ай­тар­ эдики: «Оллоҳ менга меҳри­бон­лик қил­ди, халқ
          олдида юзимни шар­ман­да­лик­дан қут­қарди».
        </p>
      </div>

      <div className="paragraph_heading">
        <p> Яҳё (а.с.) нинг туғилиши </p>
      </div>

      <div className="main_text">
        <p>
          Вақти соати келиб, Ашба Биби ўғил туғди. Қўни-қўшнилар,
          қариндош-уруғ­лар бир­га­лик­да йи­ғи­либ, Оллоҳнинг кўр­сат­ган
          мар­ҳа­ма­ти учун хурсандчилик қил­ди­лар.
        </p>

        <p>
          Саккизинчи куни чақалоқни хатна қилиб, унга отасининг отини қўймоқчи
          бўл­ди­­лар. Ле­­кин онаси: «Йўқ, Яҳё деб от қўя­миз», деб туриб олди.
          «Қариндош-уру­ғинг ора­си­да ҳеч Яҳё деган одам йўқ-ку!» деб
          ҳай­рон бўлишди улар. Кейин ча­қа­лоқ­нинг ота­си­дан: «Сиз нима
          дейсиз?» деб им­лаб сў­ра­дилар.
        </p>

        <p>
          Закариё пайғамбар бир тахтача олиб, ус­ти­га “Унинг исми Яҳё бўлади”
          деб ёздилар. Одам­лар ҳай­рон бўлди. Шу онда Закариё (а.с.) тилга
          ки­риб, Оллоҳга ҳамду санолар айт­ди­лар.
        </p>

        <p>
          Ҳаммани ҳаяжон босди. Тезда ён-ат­роф­даги қишлоқларга ҳам гап
          тарқади. Эшит­ганларнинг ҳаммаси: “Ким бўлар экан энди бу бола?” деб
          ҳайратга тушар, ўйга чў­марди. Чунки унда Оллоҳнинг қудрати на­мо­ён
          эди.
        </p>
      </div>

      <div className="paragraph_heading">
        <p> Яҳё (а.с.) нинг ёшлиги </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble7'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble7')}
          >
            <p>
              <sup>7</sup> Марям сураси 19:12-15 оят­лар.
            </p>
          </div>
        )}

        <p className="cursor-pointer boldItalic" onClick={() => toggleBubble('bubble7')}>
          «<span className="vitalic">(Биз унга:)</span> “Эй Яҳё! Китобни маҳкам
          ушла» <span className="vitalic">(дедик).</span> Унга гўдаклик чоғидаёқ
          ҳик­мат-маърифат бердик. Яна унга ўз дар­го­ҳи­миздан меҳр ва поклик
          ато эт­дик. У жуда муттақий бўлди. Ота-она­сига меҳ­ри­бон эди, жабру
          ситам қи­лув­чи, осий эмас эди. Унга туғилган ку­ни­да ҳам, ва­фот
          этадиган кунида ҳам, қай­та ти­ри­ла­ди­ган кунида ҳам салом
          бўлсин”.<sup>7</sup>
        </p>

        <p>
          Яҳё (а.с.) ўсиб-улғайиб руҳан кучли инсонга айланди ва то пайғамбарлик
          хиз­ма­ти­ни бош­ла­ма­гунча дашту биёбонларда яша­ди.
        </p>
      </div>

      <div className="paragraph_heading">
        <p> Яҳё (а.с.) нинг Оллоҳга хизмати </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble8'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble8')}
          >
            <p>
              <sup>8</sup> Бу пайтда Яҳузияда Понтий Пилат, Жалилада эса Ҳирод
              ҳо­ким­лик қилар эди.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble8')}>
          Рум императори Тибериюс подшоҳ­ли­ги­нинг ўн бешинчи йилида<sup>8</sup>{' '}
          Яҳё пайғамбарга Оллоҳ­дан ваҳий келди.
        </p>

        <p>
          Шундан сўнг у киши Ўрдун дарёси атрофидаги мин­та­қа­лар­ни кезиб,
          одамларга: «Ос­мон Сал­та­на­ти яқинлашди, тавба қи­линглар,
          гу­ноҳ­ла­рин­гиз кечирилади», деб тарғиб қи­ла бош­ла­ди­лар.
        </p>

        <p>
          Устларида туя жу­ни­дан тў­қил­ган кийим, белида те­ри­дан ясал­ган
          камар, ов­қати эса чи­гирт­каю ёв­во­йи асал эди.
        </p>

        <p>
          Ишаъё пайғамбар етти аср аввал бу ҳақда башорат қилиб айтган эдиларки:
          “Мана, даштда нидо янграяпти: Мавло­но­нинг ке­ли­шига йўл
          тай­ёр­ланг­лар. Ҳар бир сой тўл­ди­рилсин, ҳар бир тепалик
          па­сай­син. Эгри йўлларни тўғирлаб, паст-ба­ланд­ликларни
          те­кис­ланг­лар. Ҳар бир ин­сон Оллоҳ­нинг на­жо­тини кўрадиган кун
          кел­ди!”
        </p>

        <p>
          Халқ Ўрдун дарёси атрофидан, Байт-ул-Му­қаддасдан ва Яҳузиянинг қолган
          жой­ла­ри­дан келиб, Яҳё пайғамбарнинг гап­ла­рини тинглар, кейин
          гуноҳларига иқрор бў­либ у кишининг василасида Ўрдун дарё­си­да ғусл
          олар эди. Тавба қи­ла­ёт­ган одам­лар кўп эди.
        </p>

        <p>
          Фарзий ва саддуқийлардан ҳам кўп одам­лар ғусл оламиз, деб Яҳё (а.с.)
          нинг ҳу­зу­ри­га келдилар.
        </p>

        <p>
          Шунда у киши уларга қараб: «Эй илонлар насли! Ким сизларга шу йўл билан
          Оллоҳ­нинг ғазабидан қочиб қуту­ласиз, деб айт­ди?! Тавба қиладиган
          бўлсангизлар, тав­ба­га муносиб мева бе­ринг­лар! – деди­лар. – “Биз
          Иброҳим ав­ло­ди­миз”, деб ўзингизни овутманг. Мен сизларга
          ай­та­ман­ки, Оллоҳ мана шу тошлардан ҳам ҳаз­рати Иб­ро­ҳим­га авлод
          тиклашга қодир! Ана, чарх­лан­ган болта дарахтларнинг ил­ди­зи­ни
          чо­па­ман деб турибди! Яхши мева бер­май­ди­ган ҳар қандай дарахт
          кесилиб, олов­га таш­ла­на­ди».
        </p>

        <p>Шунда баъзи одамлар у кишидан: «Ай­тинг, биз нима қилишимиз керак?» деб сў­ра­ди­лар.</p>

        <p>
          «Кийиминг иккита бўлса, бирини муҳ­тож­га бер. Овқатингни ҳам
          йўқсиллар би­лан бўлиш», деб жавоб бердилар у киши.
        </p>

        <p>
          Ғусл олиш учун келганлар орасида со­лиқ­чи­лар ҳам бор эди. Улар:
          «Устоз, биз нима қилайлик?» деб сў­ра­ди­лар.
        </p>

        <p>«Бел­ги­лан­га­ни­дан ортиқ солиқ ол­манг­лар», деди Яҳё (а.с.).</p>

        <p>
          «Биз-чи, биз нима қилайлик?» деб сўрашди аскарлар. «Талончилик қилманг.
          Ҳеч ким­нинг ҳаққини еманг. Ноҳақ ҳеч кимни айб­ла­манг. Маошингизга
          қаноат қилинг», дедилар у киши.
        </p>
      </div>

      <div className="paragraph_heading">
        <p> Келиши керак бўлган Масиҳ </p>
      </div>

      <div className="main_text">
        <p>
          Кўпчилик Оллоҳ ваъда қилган Нажот­кор­нинг келишини кутаётган эди. Яҳё
          пай­ғам­бар­нинг олдига келган одамлар ҳам, ваъда қи­линган Масиҳ шу
          киши эмасмикан, деб ўйлаётган эдилар.
        </p>

        <p>
          Ҳазрати Яҳё бунга жа­во­бан дедилар: «Мен сизларни тав­ба­га “ошно”
          қиляпман. Лекин менинг ортим­дан келаётган улуғроқ! Мен у кишининг
          чо­ри­ғи­ни ечишга ҳам арзимайман. У сизлар­ни Руҳ билан ёки оташ
          билан ҳам­на­фас қи­ла­ди. Паншахаси қў­ли­да, хирмонини
          шо­­пир­моқчи: буғдойини ом­бо­ри­га йиғиб, со­мо­нини ўчмас ўтда
          куй­диради».
        </p>

        <p>
          Яҳё пайғамбар қайта-қайта халққа наси­ҳат қи­лар, нажот даври
          яқинлашганини одам­лар­га ту­шун­ти­рар эдилар.
        </p>

        <p></p>
      </div>
    </main>
  );
}