'use client';

 
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function MotherAgar() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble1',
    'bubble2',
    'bubble3',
    'bubble4',
  ]);

  return (
    <div className="stories relative">
      <div className="separate_into_two_columns">
        <main className="sep_part1">
         
          <div className="main_text">
            <p>
              Ҳазрати Иброҳимнинг аёли Сора ҳеч туғмас эди. Шунга у бир куни
              эрига мисрлик жорияси ҳақида гапириб: «Мана, Оллоҳ менга фарзанд
              бергани йўқ. Сиз энди Ҳожарнинг ёнига киринг, балки ундан фарзандли
              бўларман», деди. Расулуллоҳ рози бўлдилар.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble1'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble1')}
              >
                <p>
                  <sup>1</sup> Ибн Халдун, «Тарих», 2-жилд, 1-қисм, 36-бет.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble1')}
            >
              Шу тариқа, Канъонга кўчиб келганларига ўн йил бўлганда, Сора Биби
              (р.а.) мисрлик жорияси Ҳожарни эрига хотинликка олиб берди. Ҳеч
              қанча вақт ўтмай, Ҳожар ҳомила бўлди. Ҳомила бўлганини билгач,
              кундошига — Сора Бибига паст назар билан қарай бошлади.
              <sup>1</sup>
            </p>

            <p>
              Шунда Сора онамиз расулуллоҳнинг олдига келиб шикоят қилди:
              «Ҳаммасига сиз жавобгарсиз! Бу жорияни сизнинг қўйнингизга мен
              солган эдим. Бўйида бўлдию мени назарига илмай қўйди. Худонинг Ўзи
              орамизда қазоват қилсин!» деди.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble2'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble2')}
              >
                <p>
                  <sup>2</sup> Табарийнинг «Тарих» китобида, Ибн Асирнинг
                  «Комил» китоби, Суҳайлийнинг «Равд ул-унуф» китобларида
                  ёзилишича, Сора Биби рашк қилиб аччиқ устида Ҳожар онамизни у
                  ердан қувган.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble2')}
            >
              Иброҳим (а.с.) эса: «У ўз мулкинг! Нима десанг де!» деб жавоб
              қилдилар. Шундан сўнг Сора (р.а.) жориясини қийнай бошлади. Охири
              Ҳожар онамиз у ердан қочиб кетди.
              <sup>2</sup>
            </p>
          </div>

          <div className="paragraph_heading">
            <p>ХУДОНИНГ ФАРИШТАСИ ҲОЖАР БИБИНИ ЙЎЛДАН ҚАЙТАРАДИ</p>
          </div>

          <div className="main_text">
            <p>
              Чўлда, Шур йўлидаги чашма бўйига етиб борганида Оллоҳ таолонинг
              фариштаси Ҳожар (р.а.) га зоҳир бўлди ва: «Эй Соранинг жорияси
              Ҳожар! Қаердан келяпсан, қаерга кетяпсан?» деб сўради. Ҳожар Биби:
              «Бекамнинг олдидан қочиб келяпман», деб жавоб берди.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble3'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble3')}
              >
                <p>
                  <sup>3</sup> Исмоил деган сўз “Худо эшитади” деган маънони
                  билдиради.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble3')}
            >
              «Йўқ! — деди фаришта унга. — Бекангнинг олдига қайт. Айтганини
              қил! Оллоҳ таоло сени қўллайди. Сенинг наслингни шунчалик
              кўпайтирадики, ҳеч ким сон-саноғига етолмайди. Мана, сен
              ҳомиладорсан, ўғил туғасан. Ўғлингга “Исмоил” деб от қўясан.
              <sup>3</sup> Чунки Оллоҳ зорингни эшитди. Ўғлинг бургут каби
              эрксевар ва дашт отидек мустақил инсон бўлади. Ҳамма укаларидан
              айрилиб алоҳида яшайди. Унинг қўли ҳамманинг ёқасида, ҳамманинг
              қўли унинг ёқасида бўлади», деди.
            </p>
          </div>

          <div className="paragraph_heading">
            <p>ИСМОИЛ (А.С.) НИНГ ТУҒИЛИШИ</p>
          </div>

          <div className="main_text">
            {openBubbles['bubble4'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble4')}
              >
                <p>
                  <sup>4</sup> Бу хабар Ибн Халдунда ҳам келтирилган. Яна
                  қаранг: Ибн Қутайба, “Маориф”, 16-бет; Яъқубий, “Тарих”,
                  1-жилд, 25-бет.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble4')}
            >
              Шундай қилиб Ҳожар онамиз Сора Бибининг олдига қайтди. Ой-куни
              тўлиб расулуллоҳга ўғил туғиб берди. Иброҳим пайғамбар ўғлига
              Исмоил деб от қўйдилар. (Ўшанда у киши саксон олти ёшда
              <sup>4</sup> эдилар.)
            </p>
          </div>
        </main>
      </div>
    </div>
  );
}