// app/components/QisasUzbekIntroBox.tsx

export default function QisasUzbekIntroBox() {
  return (
   <section
  className="
     absolute hidden top-4 xl:block 
        rounded-[18px]
        border border-[#eadfbe]
        p-6
  "
    >
  <p
    className="
       text-[12px]
       text-[#8d7425]
      italic
    "
  >
    Aлҳамду лиллаҳи раббил аъламийн. Вас-солату вас-саламу аъла
    саййидина Муҳаммад ва аъла алиҳи ва асҳобиҳи ажмаъийн.
    Ассалому алайкум ва раҳматуллоҳи ва баракотуҳу. Аъмма баъд...
  </p>

  <div className="my-4 space-y-2">
    <p
      className="
      text-[12px]
        text-[#4f463c]
      "
    >
      Ушбу китоб <span className="font-semibold text-[#8c7c05]">“Қисас ал-Анбия”</span>
      {" "}— пайғамбарлар (а.с.) тарихи ҳақидаги машҳур исломий
      асарлардан бири бўлиб, қадимий уламоларнинг ривоятлари ва ишончли манбалар
      асосида тузилган. Асарда Қуръони каримда зикр қилинган
      пайғамбарлар ҳаёти, уларнинг қавмлари ва ибратли воқеалар
      баён қилинади.
    </p>

    <p
      className="
        text-[12px]
    
        text-[#4f463c]
      "
    >
      Пайғамбарлар тарихи асрлар давомида араб, форс ва туркий
      халқлар орасида катта қизиқиш билан ўқиб келинган. Афсуски,
      ўзбек тилида бу соҳадаги китоблар унчалик кўп эмас. Шу
      сабабли биз ушбу тўпламни ўзбек тилига баҳоли қудрат таржима қилишга ҳаракат
      қилдик.
    </p>

    <p
      className="
        text-[12px]
        text-[#4f463c]
      "
    >
      Умид қиламизки, ушбу китоб қалбингизга илҳом бериб, сизни 
      яхшилик, ҳақиқат ва тақво йўлига чорлайди.
    </p>
  </div>
    <p
      className="
        text-[12px]
        tracking-wide
      "
    >
      Ҳурмат билан,
      <br />
      таржимонлар гуруҳи.
    </p>
</section>
  );
}