'use client';


import { useSpeechBubbles } from '@/app/hooks/useSpeechBubbles';

export default function TeachingsFour() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble6',
    'bubble7',
  ]);

  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>17-боб: Таклиф қилинганларнинг зиёфатдан маҳрум бўлгани</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Нурлуқ (р.а.) нинг ривоят қилишича, </span>
          бир куни бир тақводор келиб, Исо (а.с.) ни шогирдлари билан бирга
          уйига меҳмонга чақиради.
        </p>
      </div>

      <div className="main_text">
        <p>
          Таом еб ўтирганларида бир киши: «Оллоҳнинг Салтанатида зиёфат
          ейдиган инсон қандай бахтли», деди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Исо (а.с.) эса бунга жавобан мана бу масални айтиб бердилар: «Бир
          киши халққа эҳсон қилай, деб катта бир зиёфат бермоқчи бўлибди. Кўп
          одамларни уйига таклиф қилибди. Зиёфат тайёр бўлгач хизматкорини
          жўнатиб: “Бор, чақирилганларга айт, дастурхон тайёр, келаверишсин”,
          дебди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Лекин таклиф қилинган одамлар, худди ҳаммаси ўзаро келишиб олгандек
          узрларини айта бошлабди. Биринчиси: “Мен ер сотиб олдим, ҳозир уни
          бориб кўришим керак. Мени маъзур тутинг”, дебди. Иккинчиси: “Беш жуфт
          ҳўкиз олувдим, шуларни синашга кетяпман, илтимос, мени кечиринг”,
          дебди. Учинчиси эса: “Мен хотин олдим, шунга боролмайман”, деб баҳона
          қилибди. Хизматкори қайтиб келиб хўжайинига уларнинг гапини етказибди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Хўжайини ғазабланиб: “Бўпти, сен ҳозир тез шаҳарнинг кўчаларини
          айлан. Камбағал, майиб, кўр ва шолларни зиёфатга олиб кел”, дебди.
          Хизматкори бироздан кейин қайтиб келиб: “Хўжайин, айтганларингизни
          қилдим, лекин ҳали ҳам бўш жойлар бор, нима қилай?” деб сўрабди.
          Хўжайини эса: “Бор, шаҳардан ташқари чиқ, ҳамма ёқдан одамларни
          келишга даъват қил, уйимиз тўлсин”, дебди.
        </p>

        <p>
          Шунга ўхшаб, мен ҳам сизларга айтаманки, таклиф қилинганлардан
          биронтаси менинг зиёфатимдан баҳраманд бўлмайди».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>18-боб: Исо (а.с.) ўз ўлими ҳақида учинчи бор огоҳлантиради</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Миррих (р.а.) Сафвон (р.а.) нинг тилидан ривоят қилади:{' '}
          </span>
          «Исо (а.с.) шогирдлари билан Қуддус сари кетаётган эдилар. Расулуллоҳ
          олдинда, биз-шогирдлар ҳайратда, бирга келаётган одамларни қўрқув
          босган. Кейин у киши ўн икки саҳобани алоҳида чеккага олиб, уёқда нима
          бўлишини тушунтира бошладилар:
        </p>
      </div>

      <div className="main_text">
        <p>
          «Мана, Қуддусга кетяпмиз. У ерда Инсон Ўғли руҳонийлар ва фақиҳлар
          қўлига таслим қилинади. Улар мени ўлимга ҳукм қилиб, ғайридинларга
          топширишади. Масхара қилиб юзимга туфуришади, қамчилашади ва ниҳоят
          ўлдиришади. Учинчи куни эса мен тириламан».
        </p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Нурлуқ (р.а.) нинг мусаннафида ёзилишича </span>
          саҳобалар ҳеч нарсани тушунишмаган: «Бу гаплар улардан яширин қолди:
          айтилган сўзларнинг маъносини улар англамадилар».
        </p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Атоуллоҳ (р.а.) Исо (а.с.) дан эшитиб қилган ривояти:{' '}
          </span>
          «Устозимиз бизга: «Илоҳий Салтанатни хамирни ошириш учун уч тоғора
          унга қўшилган хамиртурушга ҳам ўхшатса бўлади», деб айтган эдилар».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>19-боб: «Улар жим бўлсалар, тошлар чинқиришни бошлайди»</p>
      </div>

      <div className="main_text">
        {openBubbles['bubble6'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble6')}
          >
            <p>
              <sup>6</sup>{' '}
              <span className="vitalic">
                Атоуллоҳ (р.а.) нинг ривоят қилишича Исо (а.с.) кейин: «шунда
                у дарров бериб юборади»,{' '}
              </span>
              <span className="vitalic">деб айтган эканлар.</span>
            </p>
          </div>
        )}

        <p onClick={() => toggleBubble('bubble6')}>
          <span className="vitalic">
            Нурлуқ (р.а.) саҳобалардан эшитиб ривоят қилади:{' '}
          </span>
          «Зайтун тоғи этагида жойлашган Байтфожия ва Байтания қишлоқларига
          яқинлашганларида жаноби расулуллоҳ шогирдларидан иккитасига: «Тўғридаги
          қишлоққа киринглар. Кирганингизда боғланган эшак билан минилмаган
          хўтикни кўрасизлар. Ечиб буёққа олиб келинг. Агар биров бирон нарса
          деса, мавлонога керак, деб айтинглар»,
          <sup>6</sup> дедилар.
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble7'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble7')}
          >
            <p>
              <sup>7</sup>{' '}
              <span className="vitalic">
                Атоуллоҳ (р.а.) нинг мусаннафидан: «Шу тариқа пайғамбар тили
                билан айтилган мана бу башорат амалга ошган: «Эй Исроил халқи,
                Сион қизлари! Мана, Подшоҳингиз келаётир! Хоксор, камтар
                эгангизни, хўтикка минган Султонингизни кутиб олинглар!»
              </span>
            </p>
          </div>
        )}

        <p onClick={() => toggleBubble('bubble7')}>
          Икки шогирд қишлоққа кириб қарасалар, дарҳақиқат эшак билан хўтик
          кўчада боғланиб турган экан. Хўтикни ечаётганларида, эгалари: «Нега
          ечяпсизлар?» деб сўради. «Мавлонога керак», дейишди улар. Кейин
          хўтикни олиб келиб устига чопон ёпиб Исо (а.с.) ни миндирдилар.
          Одамлар кийимлар ва яшил баргларни у кишининг йўлига пойандоз
          қилдилар.
          <sup>7</sup> Зайтун тоғидан пастга тушар эканлар, расулуллоҳга эргашган
          ҳамма одамлар — жуда катта бир оломон — хурсанд бўлиб, кўрсатган
          мўъжизалари учун баланд овоз билан Оллоҳни улуғлар эди:
        </p>
      </div>

      <div className="main_text">
        <p className="!my-0 sm:pl-6">«Арши-аълода Оллоҳга ҳамду санолар!</p>
      </div>

      <div className="main_text">
        <p className="!my-0 sm:pl-6">Раббимиз юборган Подшоҳ муборак!</p>
      </div>

      <div className="main_text">
        <p className="!my-0 sm:pl-6">Довуд бобомиздан келаётган подшоҳлик муборак!</p>
      </div>

      <div className="main_text">
        <p className="!my-0 sm:pl-6">
          Оллоҳ билан бандалари орасига сулҳу тинчлик келсин!»
        </p>
        
      </div>

      <div className="main_text">
        <p>
          Шунда оломон ичидан баъзи тақводорлар: «Устоз, шогирдларингизга
          айтинг, бундай демасин», деди. У киши эса: «Агар улар жим бўлса,
          тошлар чинқиришни бошлайди», деб жавоб бердилар».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>20-боб: Йўқолган қўй ва танга масали</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Нурлуқ (р.а.) дан: </span>
          «Солиқчилар, гуноҳкорлар ва бошқа ҳар хил одамлар расулуллоҳнинг
          сўзларини эшитиш учун у кишининг олдига келар эдилар. Фақиҳлар ва
          тақводорлар буни кўриб: «Бу одам гуноҳкорларнинг дўсти, ёмонлар билан
          ҳамтовоқ», деб гап қилишди. Шунда устозимиз уларга мана бу масал билан
          жавоб бердилар:
        </p>
      </div>

      <div className="main_text">
        <p>
          «Қайси бирингиз юзта қўйи бўлса-ю, биттасини йўқотиб қўйса, тўқсон
          тўққизини даштда қолдириб, йўқолган биттасини то топмагунча изламайди?
          Топгандан кейин елкасига қўйиб хурсанд бўлиб олиб келади. Уйга келгач
          қўшнилари ва ёр-биродарларини чақириб: “Мен билан бирга хурсанд
          бўлинглар, чунки мен йўқолган қўйимни топдим”, дейди. Сизларга
          айтаманки, тавбага муҳтож бўлмаган тўқсон тўққиз солиҳдан кўра, тавба
          қилган битта гуноҳкор учун арши-аълода кўпроқ хурсандчилик бўлади».
        </p>
      </div>

      <div className="main_text">
        <p>
          Ёки қайси аёл, ўнта тангаси бўлса-ю, биттасини йўқотиб қўйса, то
          топмагунча чироқ ёқиб, уйини супуриб-сидириб изламайди? Топгач,
          дугоналари-ю қўшниларини чақириб: “Мен билан бирга хурсанд бўлинглар,
          мен йўқотган тангамни топдим”, дейди. Сизларга айтаманки, тавба
          қилган битта гуноҳкор учун ҳам арши-аълода шодлигу хурсандчилик бор».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>21-боб: Расулуллоҳнинг шаҳар учун йиғлагани</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Нурлуқ (р.а.) дан. Саҳобалар ривояти: </span>
          «Қуддусга етганларида, шаҳарни кўриб Исо (а.с.) нинг кўзларидан ёш
          оқди: «Оҳ Қуддус, Қуддус! Кошки бугун тинчлик учун сенга нима керак
          эканини билсанг эди! Афсус бу нарса ҳозир сендан яширин. Бошингга
          шундай кунлар тушадики, душман атрофингга ғов қўйиб, сени ҳар тарафдан
          қамал қилади. Қўрғону уйларингни яксон қилиб, фарзандларингни қонга
          белайди, чунки Оллоҳнинг элчиси келди, сен эса у келган вақтни билишни
          истамадинг».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>22-боб: “Менинг уйим ибодат уйи деб аталгай”</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Атоуллоҳ (р.а.) ривоят қилади: </span>
          «Қуддусга кирганимизда бутун шаҳарни ғавғо тутди. Одамлар бир-биридан:
          «Ким экан бу? Ким келди?» деб сўрар эдилар. Жавобига эса: «Носиралик
          Исо, Оллоҳнинг пайғамбари», деб айтар эдилар. Кейин расулуллоҳ
          Байтуллоҳга келдилар. Байтуллоҳ ҳовлисига кириб, олди-сотди қилаётган
          одамларни ҳайдаб чиқардилар: саррофларнинг тахталарини, каптарфурушларнинг
          курсиларини ағдариб ташладилар».
        </p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Миррих (р.а.) нинг мусаннафида ёзилишича, </span>
          Исо (а.с.) кейинроқ, халққа таълим бераётган пайтда бундай деган
          эканлар: «Китобда битилган: Оллоҳнинг Уйи ҳамма халқлар учун Ибодат
          уйи деб аталгай. Сизлар-чи?! Сизлар уни ўғрилар уясига айлантирибсиз».
        </p>
        <p>
          Халқ расулуллоҳнинг сўзларини, таълимотини яхши кўриб эшитар эди.
          Фақиҳлар ва бош руҳонийлар буни кўриб қўрқдилар ва у кишини ўлдириш
          пайига тушдилар».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>23-боб: Йўқолган ўғил масали</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Нурлуқ (р.а.) ривоят қилишича, Исо (а.с.) ўшанда фақиҳларга мана бу
            масални ҳам айтиб берган эканлар:{' '}
          </span>
          «Бир одамнинг икки ўғли бор экан. Бир куни кичик ўғли отасига: “Ота,
          мулкингиздан менга тегишли қисмини ажратиб беринг”, дебди. Ота
          бисотини икки ўғлига бўлиб берибди. Ҳеч қанча вақт ўтмай кичик ўғил
          бор-йўғини йиғиштириб, узоқ бир мамлакатга жўнабди. У ерда исрофда
          яшаб, бутун мол-дунёсини елга совурибди. Кейин ўша юртда қаттиқ
          очарчилик бошланиб, йигит муҳтожликка йўлиқади ва бориб, ўша ерлик бир
          одамга ишга кириб, далада чўчқа боқа бошлайди. Бечора шунчалик оч
          эдики, ҳатто чўчқалар ейдиган қўзоқ билан қорнини тўйдиришни орзу
          қилар, ҳеч ким унга ҳеч нарса бермаётган эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бир куни у ниҳоят ўзига келиб дебди: “Отамнинг уйида нечта уста бор,
          ҳаммаси хоҳлаганча нон ейди, мен эса бу ерда очликдан ўляпман. Отам
          олдига қайтай. Бориб, ота, мен Худонинг олдида ҳам, сизнинг олдингизда
          ҳам гуноҳ қилдим. Энди ўғлингиз деб аталишга лойиқ эмасман. Мени
          усталарингиздан бири деб қабул қилинг, деб айтаман”, дебди. Сўнг
          отасининг уйига қараб равона бўлибди.
        </p>
      </div>

      <div className="main_text">
        <p>
          У ҳали узоқда эканида, ота ўғлини кўради. Кўриб, юраги ачишади.
          Югурганча бориб, қучоқлаб, юз-кўзларидан ўпади. “Ота, — дейди ўғли. —
          Мен Худога ҳам, сизга ҳам қарши гуноҳ қилдим. Энди ўғлингиз деб
          аталишга лойиқ эмасман”. Ота эса хизматкорларига: “Бўлинглар, уйдан
          энг яхши тўнни олиб чиқиб елкасига ёпинглар! Қўлига узук тақинг,
          оёқларига чориқ кийгизинг. Бўрдоқи буқани олиб чиқиб сўйинглар,
          еб-ичамиз, хурсандчилик қиламиз! Менинг бу ўғлим ўлик эди — тирилди,
          йўқолган эди — топилди!” дер эмиш. Уйда хурсандчилик бошланибди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Катта ўғил бу пайтда далада эди. Уйга келар экан қулоғига мусиқа ва
          рақс садолари эшитилади. Шунда у болалардан бирини чақириб: “Нима гап?
          Нима бўляпти?” деб сўрабди. У эса: “Укангиз келди, отангиз унинг
          соғ-саломат қайтиб келганига бўрдоқи сўйди”, дебди. Шунда каттанинг
          аччиғи чиқиб, уйга киришдан бош тортибди. Отаси ташқари чиқиб, ўғлига
          кирсанг-чи, деб ўтинар эмиш. У эса отасига:
        </p>
      </div>

      <div className="main_text">
        <p>
          “Мен шунча йилдан бери сизга қулдек ишладим. Бир марта ҳам
          буйруғингиздан бўйин товлаганим йўқ. Шундоғ бўлса ҳам, ўртоқларим
          билан хурсандчилик қилишга бир дона улоқ ҳам бермадингиз.
          Мол-мулкингизни фоҳишаларга сарфлаб қайтган анави ўғлингизга эса
          бўрдоқи сўйибсиз!” дер экан.
        </p>
      </div>

      <div className="main_text">
        <p>
          Отаси унга: “Ўғлим! Сен доим мен билан биргасан, менинг ҳамма нарсам
          сеники. Лекин бугун байрам қилишимиз керак, хурсанд бўлишимиз керак.
          Чунки уканг ўлик эди — тирилди, йўқолган эди — топилди”, деб
          тушунтирар эмиш».
        </p>
      </div>
    </main>
  );
}