'use client';

 
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function Isaak() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble1',
    'bubble2',
  ]);

  return (
    <div className="stories relative">
      <div className="separate_into_two_columns">
        <main className="sep_part1">
          <div className="decor_line"></div>

          <div className="main_text">
            <p>
              <span className="vitalic">
                Орадан анча вақт ўтди. Соро Биби ҳам вафот этди.
              </span>{' '}
              Иброҳим (а.с.) ҳам кексайиб анча ёшга бориб қолдилар. Оллоҳ
              субҳанаҳу ва таоло у кишини ҳар жиҳатдан баракалаган эди.
            </p>
          </div>

          <div className="paragraph_heading">
            <p>ИСҲОҚ (А.С.) НИНГ УЙЛАНИШ ТАРИХИ</p>
          </div>

          <div className="main_text">
            <p>
              Ҳазрати Иброҳим (а.с.) бир куни энг ишонган хизматкорини олдларига
              чақирдилар:
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble1'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble1')}
              >
                <p>
                  <sup>1</sup> Канъонда бутларга сиғи­на­ди­ган мушрик халқлар
                  яшар эди.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble1')}
            >
              «Буёққа кел! Ўғлим Исҳоққа бу ердаги канъонийлардан
              <sup>1</sup> хотин олиб бермайман деб қасам ич, — дедилар. —
              Исҳоқни уйлантириш учун қавм-қариндошларим олдига бориб, улардан
              келин олиб келасан».
            </p>

            <p>
              «Агар келин бўладиган қиз мен билан бу ерга келишга кўнмаса нима
              қиламан? — деб сўради хизматкори. — Ўғлингизни қариндошларингиз
              олдига юбораманми?»
            </p>

            <p>
              «Йўқ! — дедилар расулуллоҳ. — Ўғлимни зинҳор уёққа юборма! Оллоҳ
              таоло Ўз фариштасини сен билан бирга юборади. Сен ўша ердан ўғлимга
              хотин олиб келасан. Чунки мени ота юртимдан олиб чиққан Худо: “Мен
              бу ерни сенинг наслингга бераман”, деб менга ваъда берган. Агар қиз
              келишга кўнмаса, бу қасамдан озодсан. Лекин зинҳор ўғлимни уёққа
              жўната кўрма».
            </p>

            <p>
              Иброҳим (а.с.) нинг хизматкори хўжайини олдида қасам ичиб,
              туялардан ўнтасига қимматбаҳо ҳадялар ортиб йўлга чиқди ва Ноҳур
              яшаган Арам-наҳрайн вилоятига етиб келди.
            </p>

            <p>
              Келиб, туяларни шаҳар ташқарисида қудуқ бўйида чўкдирди. Кеч бўлиб
              қолган, шаҳарлик хотинлар ҳар доимгидай сув олиш учун қудуқ бўйига
              келаётган эдилар.
            </p>

            <p>
              Шунда хизматкор қўлини дуога очди: «Ё Оллоҳ, хўжайиним Иброҳим
              билан аҳд тузган Парвардигор! Илтижо қиламан, соҳибим Иброҳимдан
              меҳрингни дариғ тутма, ишимни ўнгидан келтир. Мана, қудуқ бошида
              турибман. Шаҳар қизлари сув олиш учун келишяпти. Мен қайси қизга:
              “Кўзангни тушир, озгина сув ичай” десам, у бўлса: “Ичинг,
              туяларингизга ҳам сув тортиб бераман” деса, шунда мен қулинг Исҳоқ
              учун сайлаган қизинг шу эканини, хўжайиним Иброҳимга марҳамат
              кўрсатганингни биламан...».
            </p>
          </div>

          <div className="paragraph_heading">
            <p>ДУОНИНГ ИЖОБАТ БЎЛИШИ</p>
          </div>

          <div className="main_text">
            <p>
              У ҳали дуосини тугатмай туриб, Батуийлнинг қизи Рафиқа елкасида
              кўза кўтариб, қудуқ бошига келди. (Батуийл — Иброҳим (а.с.) нинг
              укаси Ноҳурнинг ўғли эди.) Рафиқа бениҳоят чиройли қиз эди.
              Қудуққа эниб кўзасини тўлдирди-да юқорига қайтиб чиқди. Шунда
              хизматкор шошиб унинг олдига чиқди: «Кўзангни бер, озгina сув
              ичай».
            </p>

            <p>
              «Ичинг, ичинг», деди Рафиқа кўзасини елкасидан тушириб. Кейин:
              «Туяларингизни ҳам сувга қондирай», деди ва чопиб бориб кўзада
              қолган сувни охурга тўкди ва яна сув олиш учун югурди. Шу тартибда
              туяларнинг ҳаммаси сувга тўйди.
            </p>

            <p>
              Иброҳим (а.с.) нинг хизматкори эса “Оллоҳ сафаримни бахайр
              қилганга ўхшайди”, деб овозини чиқармай диққат билан қизга қараб
              турган эди.
            </p>

            <p>
              Туялар сув ичиб бўлгандан кейин, у бурунга таққич қимматбаҳо тилла
              ҳалқа билан иккита катта тилла билакузук олиб, Рафиқадан: «Кимнинг
              қизисан? Уйингларда тунашга жой борми?» деб сўради.
            </p>

            <p>
              «Батуийл деганнинг қизиман. Ноҳур билан Милка деганнинг
              неварасиман», деб жавоб берди қиз. Кейин: «Бизникида тунашга жой
              бор. Туяларингиз учун сомон ҳам, ем ҳам кўп», деди.
            </p>

            <p>
              Шунда ҳазрати Иброҳимнинг хизматкори ерга бош қўйиб Оллоҳ таолога
              сажда қилиб: «Ё Оллоҳ, хўжайиним Иброҳимнинг Худоси! Сен ҳеч қачон
              хўжайинимдан меҳрингни, садоқатингни дариғ тутмагансан. Мана бугун
              ҳам менинг йўлимни очиб, хўжайинимнинг қариндошлари олдига олиб
              келдинг. Сенга ҳамду санолар бўлсин!» деди.
            </p>
          </div>

          <div className="paragraph_heading">
            <p>БАТУИЙЛНИНГ УЙИДА</p>
          </div>

          <div className="main_text">
            <p>
              Қиз уйига югурди, ва бориб, рўй берган воқеани уйдагиларга айтди.
              Унинг Лобон деган акаси бор эди. У синглисининг гапларини эшитиб,
              бурнидаги ҳалқани, қўлларидаги билакузукларни кўриб, қудуққа қараб
              чопди. Иброҳим пайғамбарнинг хизматкори ҳали ҳам ўша ерда,
              туяларининг ёнида турган эди.
            </p>

            <p>
              Лобон саломлашиб: «Нега бу ерда турибсиз? Юринг бизникига. Мен
              сизларга жой қилдириб қўйдим. Туяларга ҳам жой бор», деди.
            </p>

            <p>
              Ҳаммалари Лобоннинг уйига бордилар. Лобоннинг хизматкорлари юкларни
              тушириб, туяларга ем-сомон беришди. Кейин Иброҳим (а.с.) нинг
              хизматкорига ва у билан бирга келган ҳамроҳларига оёқларини ювиш
              учун сув келтирдилар.
            </p>

            <p>
              Дастурхон ёзилганда Иброҳим (а.с.) нинг хизматкори: «То нима учун
              келганимни айтмасам нон емайман», деди. «Шундайми? Бўлмаса
              гапингизни айтинг», деди Лобон.
            </p>

            <p>
              «Мен ҳазрати Иброҳимнинг хизматкориман, – деб сўз бошлади у. –
              Оллоҳ таоло хўжайинимни жуда баракалади. Улуғ, номдор одамга
              айлантирди. Сурув-сурув қўйлар, подалар, тиллаю кумуш,
              қулу-чўрилар ато этди.
            </p>

            <p>
              Хўжайиним қарigan чоғида хотини Сородан бир ўғил кўрган эди. Ҳозир
              бутун мол-мулкини ана шу ўғлига мерос қилиб берган.
            </p>

            <p>
              Шу сафар хўжайин мени чақиртириб, ўғлимни канъонийларга
              уйлантирмайсан, келинни менинг ота юртимдан, қариндошларимдан олиб
              келасан, деб қасам ичирди.
            </p>

            <p>
              Мен эса, агар қиз келишни хоҳламаса-чи, деб сўрадим. Шунда у киши:
              “Мен Оллоҳ таолонинг йўлида юрибман. У сен билан Ўзининг
              фариштасини юборади, сафарингни бахайр қилади. Сен
              қариндошларимдан, отамнинг хонадонидан менинг ўғлимга хотин олиб
              келасан. Қариндошларим олдига бор. Агар мабодо улар бизга қиз
              бермаса, бу қасамдан озодсан”, деди.
            </p>

            <p>
              Бугун қудуқ бўйида Оллоҳга дуо қилдим: “Ё Худовандо, йўлимни оч.
              Мана, қудуқ бошида турибман. Сувга келган қайси қизга: “Кўзангдан
              озгина сув ичай”, десам, у бўлса менга: “Ичинг, туяларингизга ҳам
              сув тортиб берай”, деса, шунда мен Сенинг Исҳоққа танлаган қизинг
              шу эканини биламан”, деб айтдим.
            </p>

            <p>
              Ичимда дуо қилиб турганимда, Рафиқа елкасида кўза кўтариб сувга
              келди. Қудуққа бориб кўзасини тўлдирди. Мен: “Озгина сув ичай”,
              дедим. У дарров елкасидан кўзасини тушириб: “Ичинг”, деди. Кейин:
              “Туяларингизга ҳам сув тортиб берай” деди.
            </p>

            <p>
              Туялар сувга қонгач, мен ундан: “Кимнинг қизисан?” деб сўрадим.
              У: “Батуийлнинг қизиман, Ноҳур билан Милканинг неварасиман”, деди.
              Кейин мен унинг бурнига ҳалқа, қўлларига билакузук тақдим ва ерга
              бош қўйиб, Худога сажда қилдим. Хўжайиним ўғлига амакисининг
              неварасини олиб бериш учун мени бу ерга олиб келган Оллоҳ таолога,
              хўжайиним Иброҳимнинг Худосига ҳамду санолар айтдим. Мана, бўлган
              гап шу. Нима дейсизлар: хўжайинимнинг илтимосини қабул
              қиласизларми? Рози бўлмасангиз айтинг. Шунда мен бундан буёғига
              нима қилишни ўйлаб кўраман».
            </p>

            <p>
              Лобон билан Батуийл унинг гапларини эшитиб: «Бу Оллоҳнинг
              буюргани. Биз нима дея оламиз? — деб жавоб беришди. — Мана Рафиқа.
              Олиб кетинг, биз розимиз. Оллоҳ буюрганидек, хўжайингизнинг ўғлига
              хотин бўлсин».
            </p>

            <p>
              Иброҳим (а.с.) нинг хизматкори буни эшитиб, ерга эгилиб Оллоҳ
              таолога сажда қилди. Кейин олиб келган тилла ва кумуш тақинчоқларни,
              сарполарни олиб Рафиқага узатди. Рафиқанинг акасию онасига ҳам
              қимматбаҳо совғалар берди. Шундан сўнг ёнидаги ҳамроҳлари билан
              бирга еб-ичдилар ва кечани ўша ерда ўтказдилар.
            </p>
          </div>

          <div className="paragraph_heading">
            <p>УЙГА ҚАЙТИШ</p>
          </div>

          <div className="main_text">
            <p>
              Эртасига саҳар туриб: «Энди рухсатингиз билан мен хўжайиним олдига
              қайтсам», деди. Бироқ Рафиқанинг акаси билан онаси: «Шошманг,
              қизимиз беш-ўн кун биз билан турсин, кейин кетарсизлар», деди.
            </p>

            <p>
              «Йўқ, мана, Оллоҳ ишимизни ўнгидан келтирди, энди мени маътал
              қилманглар. Хўжайинимнинг олдига қайтай».
            </p>

            <p>
              Шунда улар: «Бўлмаса қизни чақириб ўзидан сўрайлик, нима дер экан?»
              деб Рафиқани чақиришди: «Бу киши кетамиз дейди, кетасанми?»
            </p>

            <p>«Кетаман», деб жавоб берди Рафиқа.</p>

            <p>
              Шундай қилиб улар Рафиқани, энагаси билан бирга меҳмонлар билан
              жўнатадиган бўлдилар ва: «Синглимиз Рафиқа, Худо сенга қўша-қўша
              фарзандлар берсин. Минг-минглаб невара-эваралар кўр. Фарзандларинг
              душманларининг шаҳарларига эга бўлсин», деб дуо қилдилар.
            </p>

            <p>
              Кейин Рафиқа билан чўрилари ўринларидан туриб туяларга миниб
              Иброҳимнинг хизматкори билан йўлга тушдилар.
            </p>

            <p>
              Бу пайтда Исҳоқ (а.с.), Биър-лиҲай-Роидан Жанубистонга қайтиб
              келган эди. Бир куни у кечқурун далага чиқиб хаёл суриб турган эди,
              қараса туялар келяпти. Туяларни кўриб, уларга қараб юрди.
            </p>

            <p>
              Рафиқа ҳам Исҳоқни кўрди-да, дарров туядан тушиб Иброҳим
              пайғамбарнинг хизматкоридан: «Ана у одам ким?» деб сўради.
              «Хўжайиним», деди у. Рафиқа рўмолини тушириб юзини ёпди. Кейин
              хизматкор бўлган ҳамма воқеаларни Исҳоққа айтиб берди.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble2'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble2')}
              >
                <p>
                  <sup>2</sup> Исҳоқ (а.с.) Рафиқа Бибига уйланганларида 40 ёшда
                  эдилар.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble2')}
            >
              Исҳоқ (а.с.) Рафиқани Соро Бибининг чодирига жойлаштирди. Рафиқа
              билан никоҳ қилиб, у онасининг вафотидан кейин анча тасалли топди,
              чунки Рафиқани жуда яхши кўрар эди.
              <sup>2</sup>
            </p>
          </div>
        </main>
      </div>
    </div>
  );
}