'use client';

import '../../../qisas-uzb/stories.css';
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function EXAMPLE() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble1',
    'bubble2',
    'bubble3',
  ]);

  return (
    <div className="stories relative">
      <div className="separate_into_two_columns">
        <main className="sep_part1">
          <div className="main_text">
            {openBubbles['bubble1'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble1')}
              >
                <p>
                  <sup>1</sup> Ибн Ҳабиб, “Китаб-ул мухаббар”, 296-бет; Масъудий,
                  “Муруж уз-заҳаб”, 1-жилд, 47-бет.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble1')}
            >
              Исҳоқ (а.с.) қариб, кўзлари яхши кўрмай қолган эди.
              <sup>1</sup> Кунлардан бир кун у киши тўнғич ўғли Ийсуни олдига
              чақирдилар: «Ўғлим!»
            </p>

            <p>«Лаббай, отажон», деди Ийсу (р.а.).</p>
          </div>

          <div className="main_text">
            {openBubbles['bubble2'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble2')}
              >
                <p>
                  <sup>2</sup> У киши, Иброҳим (а.с.) га ваъда қилинган барака
                  занжирини тўнғич ўғлим давом эттириши керак, деб ўйлар эди.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble2')}
            >
              Исҳоқ (а.с.): «Мана, мен қариб қолдим, қачон куним битишини
              билмайман, — дедилар. — Шунга камонингни олиб, мен учун ов овлаб
              кел. Кейин гўштидан мен яхши кўрган таомни пишир. Ўлишимдан олдин
              сенга Оллоҳнинг баракасини бермоқчиман».
              <sup>2</sup>
            </p>

            <p>
              Рафиқа Биби уларнинг суҳбатини эшитиб турган эди. Ийсу овга кетиши
              билан у дарров кичик ўғли Яъқубни чақириб деди:
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble3'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble3')}
              >
                <p>
                  <sup>3</sup> Ийсу тўнғичлик ҳуқуқини аллақачон укаси Яъқубга
                  сотиб қўйган эди. Шундай бўлса ҳам у отасига бу ҳақда ҳеч нарса
                  демай ов овлашга кетган эди.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble3')}
            >
              «Ўғлим! Отанг ҳозир Ийсуга: “Менга ов овлаб кел. Мен яхши кўрган
              таомни пишир. Ўлишдан олдин Оллоҳнинг баракасини сенга бермоқчиман”,
              деди. Энди гапларимни диққат билан эшит! Ҳозир тез бориб, сурувдан
              икки семиз улоқ олиб кел. Мен отанг яхши кўрган таомни пишираман.
              Сен уни отангга олиб кирасан. Eб ўлишдан олдин баракани сенга
              беради, Ийсуга
              <sup>3</sup> эмас», деди.
            </p>

            <p className="vitalic">
              Эсингиздами, Оллоҳ субҳанаҳу ва таоло бир вақтлар Рафиқа Бибига:
              «Қорнингда икки эл бор, сендан икки алоҳида-алоҳида халқ туғилади.
              Бири иккинчисидан зўр келиб, каттаси кичигига хизмат қилади», деб
              ваъда берган эди. Бу икки эл — мана шу икки ака-укадан пайдо
              бўладиган халқлар. «Каттаси кичигига хизмат қилади» дегани эса,
              «барака занжири кичик ўғлингнинг насли орқали давом этади», деган
              маънода эди. Шу сабабдан Рафиқа Биби Исҳоқ (а.с.) нинг гапини
              эшитиб қаттиқ безовта бўлди.
            </p>

            <p>
              «Она! — деди Яъқуб (а.с.). — Акамнинг бадани юнгли, меники эса
              силлиқ. Мабодо отам мени ушлаб кўрса ёлғончи бўламан! Кейин: “Сенми
              мени аҳмоқ қиладиган!” деб менга барака ўрнига қарғиш беради!»
            </p>

            <p>
              «Ўша қарғиш менинг бўйнимга, — деди Рафиқа. — Бор, мен айтган
              гапни қил, улоқларни келтир».
            </p>

            <p>
              Яъқуб (а.с.) улоқларни келтириб сўйди. Рафиқа Биби Исҳоқ (а.с.)
              хуш кўрадиган таомни пиширди. Кейин уйдан Ийсунинг яхши кийимларини
              олиб, Яъқуб (а.с.) га кийдирди. Қўллари билан бўйнини эса улоқ
              териси билан ёпди. Сўнг таом билан нонни унинг қўлига тутқазди-да
              отасининг олдига киргизди.
            </p>
          </div>

          <div className="main_text">
              <p className='m-1'>—Ота!</p>
              <p className='m-1'>—Ҳа ўғлим? Кимсан, Ийсумисан, Яъқубмисан? — деб сўради отаси.</p>
              <p className='m-1'>
              —Бу мен — тўнғич ўғлингиз Ийсуман, — деди Яъқуб отасига. — Мана,
              дуойингизни олай, деб ов гўштидан таом ҳозирладим. Тура қолинг,
              еволинг.
            </p>
              <p className='m-1'>—Қандай қилиб мунча тез топиб келдинг? — деб ҳайрон бўлди отаси.</p>
              <p className='m-1'>—Оллоҳ рўпара қилди», деб жавоб берди Яъқуб (а.с.).</p>
              <p className='m-1'>—Яқинроқ кел-чи ўғлим, ушлаб кўрай қани, ростдан ҳам Ийсумисан?</p>
          </div>

          <div className="main_text">
            <p className=''>
              Яъқуб (а.с.) отасига яқинлашди. Отаси уни сийпаб: «Овоз Яъқубнинг
              овози, лекин қўллари Ийсуники», деди.
            </p>

            <p>
              Яъқуб (а.с.) нинг қўлларига тери ёпилган, акаси Ийсуникидай юнгли
              эди. Шунинг учун Исҳоқ (а.с.) уни Ийсу деб ўйладилар, лекин яна бир
              марта:
            </p>

            <p className='m-1'>—Сен ростдан Ийсумисан? — деб сўрадилар.</p>

            <p className='m-1'>—Ҳа, Ийсуман, — деди Яъқуб (а.с.).</p>

            <p>
              Шундан кейин отаси: «Таомингни олиб кел. Кейин сенга барака
              бераман», дедилар.
            </p>
          </div>

          <div className="paragraph_heading">
            <p>БИР МАРТА БЕРИЛАДИГАН БАРАКА</p>
          </div>

          <div className="main_text">
            <p>
              Еб-ичиб бўлганларидан кейин ҳазрати Исҳоқ: «Яқинроқ кел, ўғлим,
              мени ўп!» дедилар. Яъқуб (а.с.) яқин бориб отасини ўпди. Исҳоқ
              (а.с.) унинг кийимини ҳидлаб, уни дуо қилиб деди: «Ўғлимнинг ҳиди,
              Оллоҳ баракалаган даштнинг ҳидидай!
            </p>

            <div className='pl-4 leading-tight space-y-1'>
              <p></p>
              <p>Худо ҳамиша экинларингга ёмғир берсин,</p>
              <p>ерларинг ҳосилдор, ғалланг кўп, узуминг мўл бўлсин.</p>
              <p>Халқлар сенга хизмат қилсин, эллар сенга итоат этсин.</p>
              <p>Биродарларингга бошлиқ бўлгайсан,</p>
              <p>Қариндошларинг сенга таъзим қилгай.</p>
              <p>Сени лаънатлаган лаънат олсин,</p>
              <p>Сенга барака тилаган барака топсин!»</p>

            </div>
          </div>

          <div className="main_text">
            <p>
              Яъқуб (а.с.) отасининг дуосини олиб, энди чиқиб кетган пайтда акаси
              Ийсу овдан қайтиб келди ва емак тайёрлаб, отасининг олдига кирди:
              «Ота, туринг. Ов гўштидан сиз яхши кўрадиган таомни пишириб келдим,
              еб менга дуо беринг».
            </p>
          </div>

          <div className="leading-tight space-y-0">
            <p className="m-0 leading-tight">
              —Нима?! Кимсан сен? — деб сўради Исҳоқ (а.с.).
            </p>
            <p className="m-0 leading-tight">
              —Тўнғич ўғлингиз Ийсуман.
            </p>
          </div>

          <div className="main_text">
            <p>
              Буни эшитиб Исҳоқ (а.с.) қаттиқ безовта бўлдилар: «Боя таом
              пишириб келган ким эди? Мен еб унга барака бердим. Энди барака
              уники бўлди», дедилар титраб.
            </p>

            <p>
              Ийсу (р.а.) буни эшитиб, аччиқланганидан ўзини қаерга қўйишини
              билмай қолди. Кейин: «Ота, отажон, менга ҳам барака беринг,
              отажон», деб ялина бошлади.
            </p>

            <p>«Уканг ҳийла билан сенинг баракангни олиб кетди, болам», деди Исҳоқ (а.с.).</p>

            <p>
              Ийсу (р.а.) эса: «Унга Яъқуб деб бекорга от қўйишмаган, — дер эди
              додлаб. — У иккинчи марта мени алдади. Олдин тўнғичлик ҳуқуқимни
              мендан олиб қўйди. Энди баракамни ҳам олиб кетибди. Менга битта ҳам
              барака қолдирмадингизми?»
            </p>

            <p>
              «Мен уни сенга бошлиқ қилдим. Ҳамма ака-укаларинг сенга қул бўлади,
              дедим. Уни ғаллаю узум билан таъминладим. Сен учун энди нима ҳам
              қилоламан, ўғлим?» деди ҳазрати Исҳоқ.
            </p>

            <p>«Нахотки сизда фақат биттагина барака бўлса? Менга ҳам барака беринг!» деб йиғларди у.</p>

            <p>
              «Серҳосил ерлардан бенасиб бўласан. Шамширинг соясида яшаб, уканг
              хизматида юрасан. Лекин озод бўлишни хоҳласанг, кишанларини узиб
              ташлайсан», деди Исҳоқ (а.с.).
            </p>

            <p>
              Ийсу (р.а.) укасини жуда ёмон кўриб қолган эди: “Майли, отам ҳали
              тирик экан, индамайман. Бироқ вақти келсин, ўлдирмай қўймайман”,
              дерди у ўзига-ўзи.
            </p>
          </div>
        </main>
      </div>
    </div>
  );
}