'use client';

 
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function Samuel() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble1',
    'bubble2',
    'bubble3',
    'bubble4',
  ]);

  return (
    <main className="stories relative">
     <article className="flex gap-6">
        <div className="sm:w-1/2">
          <p className='!text-[14px] leading-[15.5px]'>
            «Биз Тавротни нозил қилдик. Унда ҳидоят ва нур бор. У билан У зотга
            таслим бўлган набилар, Оллоҳнинг ки­то­би­ни муҳофаза қилишга
            му­кал­лаф бўлган роббонийлар ва аҳ­бор­лар яҳудий бўлганларга ҳукм
            юритарлар» <span className="vitalic">(Моида 5:44).</span>
          </p>
        </div>

        <div className="-mt-2 hidden sm:block sm:w-1/2 rtl">
          <p   dir="rtl" 
                  lang="ar" 
                  className="font-amiri !text-[18px] !leading-[40px] text-justify">
            إِنَّآ أَنزَلْنَا ٱلتَّوْرَىٰةَ فِيهَا هُدًۭى وَنُورٌۭ ۚ يَحْكُمُ
            بِهَا ٱلنَّبِيُّونَ ٱلَّذِينَ أَسْلَمُوا۟ لِلَّذِينَ هَادُوا۟
            وَٱلرَّبَّـٰنِيُّونَ وَٱلْأَحْبَارُ بِمَا ٱسْتُحْفِظُوا۟ مِن
            كِتَـٰبِ ٱللَّهِ
          </p>
        </div>
      </article>

      <div className="paragraph_heading">
        <p> ХУДО ЭШИТАДИ </p>
      </div>

      <div className="main_text">
        <p>
          Афройимнинг Раматоим деган қиш­ло­ғи­да Ёлқин деган бир одам яшар эди.
          Унинг икки хотини бўлиб, бирининг исми Ҳано, ик­кинчисининг исми Фанина
          эди. Ҳано ҳеч фарзанд кўрмас, кундоши эса тез-тез буни юзига солиб,
          уни ранжитар эди.
        </p>

        <p>
          Шу тарзда орадан анча вақт ўтди. Ҳар гал Байтуллоҳга борганларида
          кундоши бир нарса деб Ҳанони хафа қилар, Ҳано ке­йин йиғлаб овқат емай
          қўярди. Эри унга: «Нега ҳеч нарса емаяпсан? Нега хафа бў­ла­ве­ра­сан?
          Ахир мен сенга ўн ўғилдан яхшироқ эмасманми?» дер эди.
        </p>

        <p></p>
      </div>

      <div className="main_text">
        {openBubbles['bubble1'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble1')}
          >
            <p>
              <sup>1</sup> Байтуллоҳ бу пайтда Шилоҳ шаҳрида эди
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble1')}>
          Бир йили улар яна Байтуллоҳга<sup>1</sup> борганла­рида, Ҳано зор-зор
          йиғлаб, Оллоҳга дардини тўкди.
        </p>

        <p>
          Аччиқ-аччиқ йиғлаб Худога: «Ё Парвардигор! Агар менга биргина ўғил
          бер­санг, бутун умр уни Сенинг хизматингга қўяр эдим», деб ваъда берди.
          Кейин анча­га­ча дуо қилиб ўтирди. У ичида га­пирар, ово­зи
          эши­тилмас, фақат лаб­лари қи­мир­лаёт­ган эди.
        </p>

        <p>
          Ўша пайтда Байтуллоҳда Али деган киши руҳонийлик қилар, Ҳано дуо
          қилаётганда у эшик олдида ўтирган эди. Ҳанонинг ҳолатини кўриб, уни
          ичган бўлса керак, деб ўйлади ва: «Қачонгача маст бўлиб юра­сан?
          Ичмасанг бўлмайдими?» деб танбеҳ берди.
        </p>

        <p>
          «Йўқ, ҳазратим, – деди Ҳано. – Нега ундай дейсиз? Шароб ҳам, бўза ҳам
          ичганим йўқ. Ичимдаги дардимни Оллоҳга айтяпман холос. Шу сабабдан узоқ
          дуо қилдим».
        </p>

        <p>
          «Қайғурма, – деди ҳазрати Али. – Бу ҳақда кўнглинг хотиржам бўлсин.
          Оллоҳ дуоларингни ижобат қилгай».
        </p>

        <p>
          Ҳано ташаккур айтиб Байтуллоҳдан чиқди. Бориб овқат еди. Кайфияти анча
          кўтарилган, чеҳраси ҳам ёришган эди.
        </p>
      </div>

      <div className="paragraph_heading">
        <p> ДУОНИНГ ИЖОБАТ БЎЛГАНИ </p>
      </div>

      <div className="main_text">
        <p>
          Оллоҳ таоло Ҳанонинг дуосини қабул қилган эди. Орадан ҳеч қанча вақт
          ўтмай, Ҳано ҳомиладор бўлиб ўғил туғди. “Боламни Оллоҳдан тилаб
          олдим!” деб исмини Сомуил қўйди.
        </p>

        <p>
          Бола сутдан ажрагач, улар уч яшар буқа, бир чора ун ва бир меш узум
          шарбати билан болани Байтуллоҳга, руҳоний Алининг олдига олиб келдилар.
        </p>

        <p>
          «Мени эслайсизми? – деди Ҳано руҳо­нийга. – Мен мана шу ерда Оллоҳдан
          фарзанд тилаб дуо қилган эдим. Ўғил берсанг, хизматингга қўяман, деб
          ваъда бе­рувдим. Мана, Оллоҳ дуойимни ижобат қилди. Шун­га энди
          хизматини адо этсин, деб Бай­тул­лоҳга олиб келдим», деди бола­си­ни
          кўрсатиб.
        </p>

        <p>
          Сўнгра кичкина Сомуилни ҳазра­ти Алининг қарамоғида қолдириб,
          уйлари­га қайтдилар.
        </p>
      </div>

      <div className="paragraph_heading">
        <p> РУҲОНИЙНИНГ ЎҒИЛЛАРИ </p>
      </div>

      <div className="main_text">
        <p>
          Ҳазрати Алининг ўғиллари ярамас йигитлар эди. Улар Оллоҳни менсимас,
          ру­ҳо­нийлик масъулиятини тан олмас эдилар. Халқ қурбонлик олиб келиб
          сўйганда, ҳали ёғи куйдирилмай туриб, улар қурбонлик гўшти­дан ейиш
          учун олар, бу эса Худога нисба­тан беҳурматлик эди.
        </p>

        <p>
          Қурбонлик қилаёт­ган одам: «Шошма, олдин Раббимизга аталган ёғни
          куйдирай, кейин хоҳлаганча олаверасан», деса, улар: «Йўқ, ҳозир
          берасан, бўлмаса зўрлик билан тортиб оламан», деб жавоб беришарди.
        </p>

        <p>
          Бу пайтда кичкина Сомуил Оллоҳга хизмат қилиб юрган эди. Онаси ҳар йили
          унга бир сидра кийим тикар, эри билан Байтуллоҳ­га келганида, тиккан
          кийимини ўғлига кийдирар эди.
        </p>

        <p>
          Уйга қайтадиган вақтда, Байтуллоҳ ру­ҳонийси уларни дуо қилар, «Оллоҳ
          Со­муил­нинг ўрнини тўлдирсин, уйингизга яна ўғил-қизлар берсин», деб
          улар учун Худодан фарзанд тиларди. Оллоҳнинг мар­ҳамати билан Ҳано Биби
          яна учта ўғил-у икки қизли бўлди.
        </p>
      </div>

      <div className="paragraph_heading">
        <p> “МЕНИ ИЗЗАТ ҚИЛГАН ИЗЗАТ ТОПАДИ...” </p>
      </div>

      <div className="main_text">
        <p>
          Руҳоний қариб қолган эди. У ўғиллари қилиб юрган ишларни эшитар,
          Байтуллоҳ эшигида хизмат қиладиган аёллар билан зино қилаётганларини
          ҳам биларди.
        </p>

        <p>
          «Болаларим, нима қиляпсизлар ўзи?! Агар инсон инсонга қарши гуноҳ
          қилса, Худо унга шояд шафоат қилар. Бироқ Худога қарши гуноҳ қилганга
          ким шафоат қилади?» дерди у куйиниб. Лекин ўғиллари унинг гапига қулоқ
          солмас эдилар.
        </p>

        <p>
          Кунлардан бир куни Оллоҳ азза ва жалла руҳоний Алининг олдига бир
          одамни пайғом билан жўнатди:
        </p>

        <p></p>
      </div>

      <div className="main_text">
        {openBubbles['bubble2'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble2')}
          >
            <p>
              <sup>2</sup> Оллоҳ (с.в.т.) ҳазрати Алининг хонадонини, тўғрироғи,
              у кишининг отасининг хонадонини Байтуллоҳга руҳонийлик хизматига
              тайин қилган эди.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble2')}>
          «Сизлар Мен учун қилинаёт­ган қур­бон­ликларни оёқости қиляп­сизлар!
          Нима учун ўғилларингни Мендан баланд тутасан? Сизларни бу хизматга
          <sup>2</sup> Мен қўйган эдим, энди Ўзим бу шарафдан маҳрум қиламан.
          Мени иззат қилганни Мен иззат қиламан, Мени хор қилган эса шар­манда
          бўлади», деди.
        </p>
      </div>

      <div className="paragraph_heading">
        <p> Сомуил (а.с.) га ваҳий келиши </p>
      </div>

      <div className="main_text">
        <p>
          Ўша пайтларда Оллоҳ таолонинг каломи кам келар, ваҳий фақат
          аҳён-аҳёнда нозил бўлар эди. Бир куни кечаси, Оллоҳ таоло Сомуилни
          чақирди. Сомуил ўша вақт Байтуллоҳда, Аҳд Сандиғи қўйилган хонада
          ухлаб ётган эдилар. Товушни эшитиб: «Лаббай, ҳазратим!» деб югуриб
          ру­ҳо­нийнинг олдига бордилар.
        </p>

        {openBubbles['bubble3'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble3')}
          >
            <p>
              <sup>3</sup> Табарий, “Тарих”, 1-жилд, 242-бет; Салабий, “Ароис”,
              263-бет; Ибн-и Асир, “Комил”, 1-жилд, 218-бет.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble3')}>
          У эса: «Мен сени чақирганим йўқ, жо­йинг­га бориб ухла», деди. Сомуил
          (а.с.) жо­йи­га бориб ётдилар.<sup>3</sup>
        </p>

        <p></p>
      </div>

      <div className="main_text">
        <p>
          Би­роздан кейин яна: «Сомуил, эй Сомуил!» деган товуш келди. Сомуил
          (а.с.) яна ўрин­ла­ри­дан туриб ҳаз­ра­ти Алининг олдига бор­дилар-да:
          «Мени чақирдингизми?» деб сў­ра­дилар.
        </p>

        <p>«Ча­қир­ганим йўқ, ўғлим! Бор, жойингга ёт», деди руҳоний.</p>

        <p>
          Сомуил (а.с.) ҳалигача Худодан сўз эшитмаган, шунинг учун ҳам ҳозир
          Худо гапираёт­ганини тушунмас эдилар.
        </p>

        <p>
          Кейин Оллоҳ учин­чи марта у кишини чақирди. Сому­ил (а.с.) яна:
          «Лаббай ҳазратим», деб ру­ҳо­нийнинг олдига бордилар.
        </p>

        <p>
          Шунда ҳазрати Али Оллоҳдан сўз келганини англади. Кейин: «Бориб
          жойингга ёт. Агар яна овоз келса, лаббай ё Раббим, амрингга тайёрман,
          деб жавоб бер», деди.
        </p>

        <p>
          Бироздан сўнг Оллоҳдан яна сўз келди. Сомуил (а.с.): «Лаббай ё Раббим,
          амрингга тайёрман», деб жавоб бердилар.
        </p>

        <p>
          Шунда Худо: «Мен Алига сенинг хонадонингни маҳкум қиламан деб айтган
          эдим, – деди. – Чунки у ўғилларининг гуноҳларини билса ҳам, ҳеч нарса
          қилмади. Энди айтган гапла­римни амалга ошираман».
        </p>

        <p>
          Эртасига эрталаб, Сомуил (а.с.) ҳар доимгидек Байтуллоҳ эшикларини
          очдилар. Худонинг сўзларини эса руҳонийга айтишга қўрқ­дилар.
        </p>

        <p>
          Кейин ҳазрати Али у кишини чақириб: «Ўғлим, Худо нима деди? Ҳаммасини
          айт. Ҳеч нарсани яширма», деди. Оллоҳнинг пай­ғо­ми­ни эшитганидан
          сўнг: «Ҳа, У Худо. У нимаики деса маъқул», деди боши­ни хам қилиб.
        </p>

        <p></p>
      </div>

      <div className="main_text">
        {openBubbles['bubble4'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble4')}
          >
            <p>
              <sup>4</sup> Тавротда “Оллоҳ Сомуил айтган сўзлардан бирортасининг
              ерга тушишига йўл қўймади”, деган сўзлар бор. Маъноси, Сомуил
              (а.с.) ёш бўлсалар-да, у киши айтаётган башоратларининг ҳар бири
              амалга ошаётган эди.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble4')}>
          Шу-шу, Сомуил (а.с.) га Худодан сўз келадиган бўлди. Улғаяр эканлар,
          Оллоҳ таоло ҳамиша у киши билан бирга эди.<sup>4</sup>
        </p>

        <p>
          Тез орада бутун мамлакат бўйлаб: “Янги пайғамбар чиқибди, Оллоҳ Ўзига
          пайғамбар танлабди”, деган хабар тарқади.
        </p>
      </div>
    </main>
  );
}