'use client';


import { useSpeechBubbles } from '@/app/hooks/useSpeechBubbles';

export default function TeachingsSix() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble8',
    'bubble9',
    'bubble10',
    'bubble11',
    'bubble12',
    'bubble13',
  ]);

  return (
    <main className="stories relative">
       <div className="paragraph_heading">
        <p>30-боб: Оллоҳнинг даъватини қандай қабул қиласиз?</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Атоуллоҳ (р.а.) Исо (а.с.) дан мана бу масални ривоят қилади:{' '}
          </span>
          «Оллоҳнинг Салтанатини ўғлини уйлантириш учун халққа зиёфат берган
          бир подшоҳ масалига ўхшатиш мумкин. Зиёфат тайёр бўлгач, подшоҳ таклиф
          қилинганларни чақириш учун хизматкорларини юборибди. Улар эса келишни
          хоҳламабдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шунда подшоҳ бошқа хизматкорларини жўнатиб: «Бориб чақирилган
          одамларга айтинг, дастурхон тайёр, ҳўкизу бўрдоқи буқалар сўйилган,
          тўйга келсинлар», дебди. Улар эса назарга илмай, баъзилари даласига,
          баъзилари савдо-сотиғига кетибди. Қолганлари бўлса подшоҳнинг
          элчиларини ушлаб, таҳқирлаб ўлдиришибди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Буни эшитган подшоҳ қаттиқ ғазабланиб, уларнинг устига лашкар
          юборибди. Қотилларни ўлдириб, шаҳарни оловга буркабди. Кейин
          хизматкорларига: «Тўй тайёр, лекин таклиф қилинганлар нолойиқ экан.
          Энди сизлар катта кўчаларга чиқиб, кимни кўрсанглар тўйга чақиринглар»,
          дебди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Хизматкорлар кўчаларга бориб, яхшими-ёмонми кимни топса, зиёфатга
          чақиришибди. Тўйхона меҳмонлар билан тўлибди. Подшоҳ бир вақт,
          меҳмонлар билан кўришай деб ичкари кирса, келганлардан бири эски
          кийимда экан. «Дўстим, — дебди подшоҳ, — Сен бу ерга бу кийимда қандай
          кирдинг? Нега ҳойлик кийим киймадинг?!» У одам жавоб беролмабди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шунда подшоҳ хизматкорларига: «Уни қўл-оёғидан боғлаб, ташқарига
          қоронғулик қаърига, доду фарёд қўпадиган, тишлар ғижирлайдиган жойга
          итқитинг!» деб амр қилибди. Дарҳақиқат, даъват қилинганлар кўп, лекин
          танланганлар оз».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>31-боб: Уёқдан буёққа ўтиб бўлмайди</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Нурлуқ (р.а.) нинг мусаннафида ёзилган масал. Ҳазрат Исо (а.с.)
            айтадилар:{' '}
          </span>
          «Қимматбаҳо кийимлар киядиган, ҳар куни зиёфат ейдиган бир бой бор
          экан. Унинг эшиги тагида эса бутун баданини яра босган, доим итлар
          келиб яраларини ялайдиган бир Лазар исмли тиланчи ётар, очлигидан:
          “Қани эди, ҳеч бўлмаса бойнинг дастурхонидан тушган нарсаларни есам”,
          деб орзу қилар экан.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бир куни тиланчининг ажали етиб, фаришталар уни ҳазрати Иброҳимнинг
          олдига олиб кетишибди. Кейин бой ҳам вафот этибди. Ўликлар юртида азоб
          чекар экан, узоқдан Лазарнинг Иброҳим пайғамбар билан бирга тепада
          ўтирганини кўриб:
        </p>
      </div>

      <div className="main_text">
        <p>
          «Иброҳим ота, Иброҳим ота, — деб нола қилибди. — Менга раҳмингиз
          келсин, Иброҳим ота! Лазарни юборинг, бармоғига сув олиб, тилимни
          ҳўлласин. Олов ичида қаттиқ қийналяпман», дебди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Иброҳим отамиз эса: «Биласан ўғлим, сен у дунёда яхши яшадинг, Лазар
          эса қийналди. Энди у бу ерда ором оляпти, сен эса азобдасан. Бундан
          ташқари, сизлар билан бизнинг орамизда чуқур жарлик бор: буёқдан сен
          томонга, ё сен томондан буёққа ҳеч ким ўта олмайди», дебди.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Ота, ота, — деб ялинибди бой. — Унда Лазарни бизнинг уйимизга
          юборинг, илтимос! Чунки менинг бешта ака-укам бор. Тағин улар ҳам шу
          азобга дучор бўлмасин, Лазар бориб уларни огоҳлантирсин!» дебди.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Йўқ, болам, – дебди Иброҳим (а.с.). – Уларнинг қўлида Мусонинг
          ваҳийлари, пайғамбар битиклари бор. Ўшаларга қулоқ солсин». «Йўқ,
          Иброҳим ота, улар қулоқ солмайди, — дер эмиш бой. — Фақат кимдир
          ўлимдан тирилиб келсагина улар тавба қилади». Иброҳим пайғамбар эса:
          «Йўқ, агар улар Мусо ва пайғамбарларга қулоқ солмаса, кимдир ўлимдан
          тирилиб келса ҳам барибир имон келтиришмайди», деб жавоб берибди».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>32-боб: «Цезарнинг ҳаққини Цезарга...»</p>
      </div>

      <div className="main_text">


        <p onClick={() => toggleBubble('bubble8')}>
          <span className="vitalic">Нурлуқ (р.а.) нинг мусаннафида айтилишича </span>
          дин пешволари ўз айғоқчиларини Ҳироднинг одамлари билан бирга
          расулуллоҳнинг олдига жўнатадилар: «Улар ўзларини самимий қилиб
          кўрсатиши, кейин мабодо Исо (а.с.) бирон ножўя гап айтсалар, у кишини
          ҳибсга олиб ҳокимнинг
          <sup>8</sup> олдига олиб боришлари керак эди.
        </p>
                {openBubbles['bubble8'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble8')}
          >
            <p>
              <sup>8</sup> Ўша пайтда Яҳузияга Понтий Пилат ҳокимлик қилар эди.
            </p>
          </div>
        )}
      </div>

      <div className="main_text">
        <p>
          Улар келиб: «Устоз, биз биламиз, сиз ҳеч ким учун тарафкашлик
          қилмайсиз. Сўзингиз ҳам, таълимотингиз ҳам тўғри, – деб гап
          бошладилар. – Оллоҳнинг йўлини ҳақиқат асосида халққа ўргатяпсиз.
          Айтинг-чи, Цезарга солиқ тўлашимиз Оллоҳнинг олдида тўғрими ё йўқми?»
        </p>
      </div>

      <div className="main_text">
        <p>
          Исо (а.с.) уларнинг найрангини сезиб: «Менга румийларнинг тангасини
          кўрсатинг», дедилар. Кейин: «Бу ерда кимнинг номи, кимнинг сурати нақш
          қилинган?» деб сўрадилар. Улар: «Цезарники», дейишди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Расулуллоҳ шунда: «Цезарникини Цезарга беринглар, Оллоҳникини
          Оллоҳга», дедилар. Шу билан улар у кишини тузоққа тушира олмай, олган
          жавобларидан ҳайратга чўмиб жим қолдилар».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>33-боб: Боғда ишлаган мардикорлар масали</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Атоуллоҳ (р.а.) Исо (а.с.) нинг тилидан ривоят қилади:{' '}
          </span>
          «Илоҳий Салтанатни, узумзорига мардикор ёллаган мана бу боғ эгасига
          ўхшатиш мумкин. У эрталаб саҳар ўрнидан туриб, бир нечта мардикорни,
          бир кунга бир динордан бераман, деб узумзорига ишга олиб келибди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Икки-уч соатдан кейин яна шаҳар майдонига чиқиб, бир нечта мардикорга:
          «Юринглар, менинг боғимда ишланглар, ишлаган вақтингизга қараб
          ҳақингизни бераман», дебди. Улар ҳам ишга тушибди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Пешинга яқин — соат ўн иккиларда, кейин пешиндан сўнг — соат учларда
          яна икки марта майдонга чиқиб, яна бир нечта мардикорни боғига олиб
          келибди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Соат бешларда майдонга чиқса, иш излаб кутиб турган мардикорлар ҳали
          ҳам бор экан. Улардан: «Нега куни билан бекор турибсизлар?» деб
          сўрабди.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Бизни ҳеч ким ишга чақирмаяпти», дейишибди улар. Шунда боғ эгаси:
          «Юринглар, сизлар ҳам менинг боғимда ишлайсизлар», дебди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Кеч киргач, нозирини чақириб: «Мардикорларга пул бер. Аввал энг
          охирида келганлардан бошла», дебди. Соат бешда келган ишчиларнинг
          ҳаммаси бир динордан пул олибди. Биринчи келганлар буни кўриб, бизга
          кўпроқ берса керак, деб ўйлабдилар. Лекин нозир уларга ҳам бир
          динордан ҳақ тўлабди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шунда улар уй эгасидан нолиб: «Охирида келганлар фақат бир соат
          ишлади, биз эса кун бўйи офтоб тиғида қийналдик. Нега бизга уларга
          бергандек пул бердингиз?» дебди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Боғ эгаси эса улардан бирига: «Дўстим, мен сенинг ҳаққингни еганим
          йўқ. – дебди. – Сен бир динорга ишлайман, деб айтмаганмидинг? Шундоғ
          экан, пулингни ол-да, кетавер. Мен охирида келганларга ҳам сеникича
          пул берсам нима қилибди? Ё пулимни қандай сарфлашга ҳақим йўқми? Ё
          менинг саховатимни кўролмаяпсанми?» дебди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шунга ўхшаб, Оллоҳнинг Салтанатида ҳам кўп охиргилар биринчи ва
          биринчилар охирги бўлади».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>34-боб: Саддуқийлар берган савол</p>
      </div>

      <div className="main_text">
  

        <p onClick={() => toggleBubble('bubble9')}>
          <span className="vitalic">Нурлуқ (р.а.) нинг мусаннафида ёзилишича </span>
          Исо (а.с.) нинг олдига саддуқийлар
          <sup>9</sup> келиб бундоқ деб савол берадилар: «Устоз, Мусо пайғамбар
          бизга, агар ким уйланиб фарзанд кўрмай ўлса, унинг укаси бева қолган
          аёлни никоҳига олиб, акаси учун насл қолдирсин, деб амр қилган. Етти
          ака-ука бор эди. Биринчиси уйланди-ю, фарзанд кўрмай ўлди. Шунда
          иккинчи ўғил янгасини никоҳига олди. Аммо у ҳам фарзанд кўрмай вафот
          этди. Кейин учинчиси, кейин тўртинчиси, хуллас етти ака-уканинг ҳаммаси
          унга уйланиб, фарзанд кўрмай дунёдан ўтдилар. Охирида у аёл ҳам ўлди.
          Энди ўликлар тирилганда у уларнинг қайси бирига хотин бўлади? Етти
          ака-уканинг ҳаммаси у билан бирга никоҳ қилган-ку!»
        </p>
              {openBubbles['bubble9'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble9')}
          >
            <p>
              <sup>9</sup> Садуқийлар — ўлимдан кейин ҳаёт йўқ, деб даъво
              қиладиган ҳизб эди.
            </p>
          </div>
        )}
      </div>

      <div className="main_text">
        <p>
          Расулуллоҳ бундай деб жавоб бердилар: «Уйланиш ва эрга тегиш бу
          дунёнинг фарзандларига хос. Лекин у дунёнинг ҳаётига лойиқ бўлиб
          тирилганлар на уйланадилар ва на эрга тегадилар. Улар учун энди ўлим
          йўқ. Шу жиҳатдан улар фаришталарга ўхшайди — улар Янги Ҳаёт учун
          тирилган беҳишт фарзандларидир.
        </p>
      </div>

      <div className="main_text">
      

        <p onClick={() => toggleBubble('bubble10')}>
          Ўликларнинг тирилишига келсак, Мусо пайғамбар ҳам бу ҳақда ёзган.
          Ёнаётган бутани кўрганида, Оллоҳ унга “Мен Иброҳимнинг, Исҳоқнинг ва
          Яъқубнинг илоҳиман” деб айтган. Оллоҳ эса ўликларнинг эмас,
          тирикларнинг илоҳи, Унинг наздида ҳамма тирик».
          <sup>10</sup>
        </p>
          {openBubbles['bubble10'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble10')}
          >
            <p>
              <sup>10</sup>{' '}
              <span className="vitalic">
                Миррих (р.а.) нинг мусаннафида ёзилишича, Исо (а.с.) уларга:
                «Сизлар Оллоҳнинг қудратини ҳам, китобларини ҳам тушунмайсизлар.
                Шунинг учун адашяпсизлар»,{' '}
              </span>
              <span className="vitalic">деб айтган эканлар.</span>
            </p>
          </div>
        )}
      </div>

      <div className="main_text">
        <p>
          Шундан сўнг саддуқийлар бошқа савол беришга журъат қилмадилар.
          Суҳбатни тинглаган олимлардан бир нечтаси: «Устоз, жуда яхши
          гапирдингиз», деб айтишди».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>35-боб: Дуоларнинг қабул бўлиши ҳақида</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Нурлуқ (р.а.) ривоят қилади: </span>
          «Расулуллоҳ бир куни шогирдларига, руҳингиз тушмасин, ҳар доим дуо
          қилинглар, деб мана бу масални айтиб бердилар:
        </p>
      </div>

      <div className="main_text">
        <p>
          «Бир шаҳарда Худодан қўрқмайдиган, одамлардан уялмайдиган бир қози
          бор экан. Бир бева аёл унинг олдига қайта-қайта келиб: «Фалончи менга
          зулм қилди. Адолат қилиб беринг», деб ялинаверибди. Қози анча вақтгача
          эътибор бермабди. Кейин ўзича: «Мен-ку Худодан қўрқмайман, одамлардан
          ҳам уялмайман. Лекин шу аёлнинг ҳақини ажрим қилиб берай, бўлмаса
          келавериб мени безор қилади», дебди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Қозининг гапини эшитяпсизми? — деб давом этдилар расулуллоҳ. — У-ку
          фосиқ! Нахотки Оллоҳ Ўз танлаганларига эътибор бермаса?! Куну тун нола
          қилаётган бандаларини тез оқламаса? У Ўз бандалари устидан сабр-тоқат
          қилиб, гуноҳларини кечириб турибди-ку! Албатта оқлайди! Лекин Инсон
          Ўғли қайтиб келганида ер юзида имон топармикан?»
        </p>
      </div>

      <div className="paragraph_heading">
        <p>36-боб: Энг улуғ амр</p>
      </div>

      <div className="main_text">
        <p>
          Саддуқийларнинг лол қолганини эшитиб тақводорлар бир жойда
          тўпланадилар ва ўзаро маслаҳатлашиб, Исо (а.с.) нинг олдига келадилар.
          Улардан бири, фиқҳ олими, саддуқийлар билан бўлган баҳсга шоҳид бўлган
          эди. У синаш учун расулуллоҳга: «Устоз, Тавротдаги энг улуғ амр нима?»
          деб савол беради.
        </p>
      </div>

      <div className="main_text">
      

        <p onClick={() => toggleBubble('bubble11')}>
          <span className="vitalic">Миррих (р.а.) Сафвон (р.а.) дан эшитиб ривоят қилади: </span>
          «Расулуллоҳ уларга: «Энг улуғ амр мана бу: “Эшит, эй бани Исроил,
          Раббимиз Оллоҳ ягонадир. Раббингни бутун қалбинг билан, бутун жонинг
          билан, бутун ақлинг билан ва бутун куч-қувватинг билан сев”. Иккинчи
          энг муҳим амр эса: “Қўшнингни ўзингни севгандек сев”, деган амр.
          Булардан улуғроқ амр йўқ»,
          <sup>11</sup> деб жавоб бердилар.
        </p>
          {openBubbles['bubble11'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble11')}
          >
            <p>
              <sup>11</sup> Атоуллоҳ (р.а.) нинг мусаннафида зикр қилинишича,
              Исо (а.с.): «Бутун Таврот ҳамда пайғамбар оятлари мана шу икки
              амрга суянади», деб айтган эканлар.
            </p>
          </div>
        )}
      </div>

      <div className="main_text">
        <p>
          «Сиз ҳақсиз, — деди фақиҳ. — Оллоҳ дарҳақиқат ягона, Ундан бошқа илоҳ
          йўқ. Қурбонлигу назрлар қилгандан кўра Оллоҳни бутун дилинг, бутун
          ақлинг ва бутун куч-қувватинг билан севсанг, қўшнингни ўзингни яхши
          кўргандек яхши кўрсанг, шу афзал».
        </p>
      </div>

      <div className="main_text">
        <p>
          Расулуллоҳ унинг донолик билан гапирганини кўриб: «Сиз Оллоҳнинг
          Салтанатидан узоқ эмассиз», дедилар».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>37-боб: Оллоҳ камтарларни улуғлайди</p>
      </div>

      <div className="main_text">
        <p>
          Кейин ўзини солиҳ ҳисоблаб, бошқаларга паст назар билан қарайдиган
          одамлар учун мана бу масални айтиб бердилар:
        </p>
      </div>

      <div className="main_text">
        <p>
          «Икки киши дуо қилиш учун Байтуллоҳга кирибди: бири тақводор,
          иккинчиси солиқчи экан. Тақводор киши ўзини одамлардан нарироқ олиб:
          «Ё Оллоҳ, Сенга ҳамду санолар бўлсин! – деб дуо қила бошлабди. – Чунки
          мен бошқа одамларга, талончи, фосиқ ва зинокорларга, ўғри ё мана бу
          солиқчиларга ўхшамайман. Мана, ҳафтада икки бор рўза тутяпман, ҳамма
          нарсамдан ушр беряпман...».
        </p>
      </div>

      <div className="main_text">
        <p>
          Солиқчи бўлса бир четда, кўзларини ерга тикканча: «Ё Оллоҳ, мен учун
          каффора бер!» деб кўкрагига уриб йиғлар эмиш. Сизларга айтаманки, ана
          шу солиқчи уйига оқланиб қайтди, тақводор эмас. Чунки ўзини юқори
          олган ҳар бир одамни Оллоҳ пасайтиради, ўзини паст олганни эса
          улуғлайди».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>38-боб: Масиҳ ким?</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Атоуллоҳ (р.а.) ривоят қилади: </span>
          «Исо (а.с.) тақводорларга: «Қани айтинг-чи, Масиҳ ким? У кимнинг
          ўғли?» деб деб савол бердилар.
        </p>
      </div>

      <div className="main_text">
        <p>Улар эса: «Ҳазрати Довуднинг», деб жавоб беришди.</p>
      </div>

      <div className="main_text">
        <p className='cursor-pointer' onClick={() => toggleBubble('bubble12')}>
          «Унда нега Довуд пайғамбарга Масиҳ сенинг хожанг, деб ваҳий келган? –
          деб сўрадилар расулуллоҳ. – Оятда ёзилган-ку: “Раббим менинг хожамга,
          то душманларингни оёқларинг остига таслим қилмагунимча, Менинг ўнг
          қўлимда ўтир, деб айтди”.   Агар Довуд алайҳис-салом уни хожам деб атаган бўлса, қандай қилиб у
          Довуднинг ўғли бўлади?»<sup>12</sup> 
        </p>
              {openBubbles['bubble12'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble12')}
          >
            <p>
              <sup>12</sup> Халқ устознинг гапларини мароқ билан эшитар эди.
            </p>
          </div>
        )}
      </div>

      <div className="main_text">
       
        <p >
        
          Ҳеч ким ҳеч нарса деб жавоб беролмади ва ўшандан сўнг ҳеч ким у кишига савол беришга ботина олмади».
        </p>
   

      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Бир дафъа ҳазрати Исо (а.с.) шогирдларига, менинг келишимга тайёр
            бўлиб туринглар, ғафлатда қолманглар, деб бир масал айтиб берадилар.{' '}
          </span>
          Шунда Сафвон (р.а.): «Ҳазратим, сиз бу масални фақат биз учун
          айтяпсизми ё ҳамма учунми?» деб сўраган эканлар.{' '}
          <span className="vitalic">Нурлуқ (р.а.) нинг ривояти: </span>
        </p>
      </div>

      <div className="main_text">
        <p>
          «Доно ва ишончли хизматкор ким? — деб жавоб бердилар расулуллоҳ. —
          Хўжайини бошқа хизматкорларнинг еб-ичишига қараб турсин деб кимни
          бошқарувчи қилиб тайинлайди? Қайтиб келганида уни иш устида кўрса,
          бутун мол-мулки устидан нозир қилиб қўяди. Бироқ агар хизматкори,
          хўжайин ҳали келмайди, деб қўл остидагиларни урса, еб-ичиб маст бўлса,
          хўжайини у кутмаган-билмаган соатда келиб қолади ва уни тилка-пора
          қилиб, кофирлар оладиган меросга дучор қилади.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ким хўжайинининг хоҳишини билиб туриб қилмаса, тайёргарлик кўрмаса,
          кўп таёқ ейди. Ким билмай нотўғри иш қилса, кам таёқ ейди. Кимга кўп
          берилса, ундан кўп сўралади, кимга кўп ишонилса, ундан кўп нарса талаб
          қилинади».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>39-боб: Исо (а.с.) нинг диний хизматни бошлаши</p>
      </div>

      <div className="main_text">
   

        <p className='cursor-pointer' onClick={() => toggleBubble('bubble13')}>
          <span className="vitalic">Нурлуқ (р.а.) саҳобалардан эшитиб ривоят қилади: </span>
          «Устозимиз илоҳий Руҳ қудратига тўлган ҳолда Жалилага қайтдилар
          <sup>13</sup> ва тиловатхоналарда таълим бера бошладилар. Ҳадемай
          овозалари бутун Жалилага эшитила бошлади. Ҳамма у кишини ҳурмат қилар
          эди».
        </p>
             {openBubbles['bubble13'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble13')}
          >
            <p>
              <sup>13</sup> Бу пайтда Яҳё пайғамбар Жалила ҳокими Ҳирод
              томонидан ҳибсга олинган эди.
            </p>
          </div>
        )}
      </div>
    </main>
  );
}