'use client';


import { useSpeechBubbles } from '@/app/hooks/useSpeechBubbles';

export default function Yunus() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble1',
    'bubble2',
    'bubble3',
    'bubble4',
  ]);

  return (
    <main className="stories relative">
       <article className="flex gap-6">
        <div className="sm:w-1/2">
        <p className='!text-green-600 sm:!text-gray-600 !text-[14px] leading-[15.5px]'>
            «Қанийди бирон қишлоқ аҳли имон келтирса, имонлари фойда қилган
            бўлар эди. Фақат Юнус қавми имон кел­тир­ган­ла­ри­да улардан ҳаё­ти
            дунёдаги хорлик азобини ку­шо­йиш қилдик ва уларни маъ­лум вақт­га­ча
            фой­да­­лан­­тир­дик»{' '}
            <span className="">(Юнус сураси 10:98).</span>
          </p>
        </div>

        <div className="-mt-2 hidden sm:block sm:w-1/2 rtl">
          <p   dir="rtl" 
                  lang="ar" 
                  className="font-amiri !text-[20px] !leading-[44px]">
          
           فَلَوْلَا كَانَتْ قَرْيَةٌ ءَامَنَتْ فَنَفَعَهَآ إِيمَـٰنُهَآ
            إِلَّا قَوْمَ يُونُسَ لَمَّآ ءَامَنُوا۟ كَشَفْنَا عَنْهُمْ
            عَذَابَ ٱلْخِزْىِ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا وَمَتَّعْنَـٰهُمْ
            إِلَىٰ حِينٍۢ
          </p>
        </div>
      </article>

      <div className="paragraph_heading">
        <p> MУҚАДДИМА </p>
      </div>

      <div className="main_text vitalic">
        <p className='vitalic'>
          Юнус (а.с.) Бани Исроилдан чиққан пай­ғам­бар­лардан бўлиб, Ислом
          та­ри­хида «Со­ҳи­бул ҳут» ҳамда «Зуннун» исм­лари би­лан маш­ҳур
          (Қуръонга қаранг – ал-Ан­бия 21:87).
        </p>

        <p className='vitalic'>Оллоҳ субҳанаҳу ва таоло у ки­ши­ни Найнаво шаҳрига даъват қилишга юбо­ради.</p>

        <p className='vitalic'>
          Найнаволиклар эса бутларга си­ғи­на­диган, зулмга-ёвузликка берилган
          халқ бўлиб, Бани Исроилга душман эди.
        </p>
      </div>

      <div className="main_text vitalic">
   

        <p className="cursor-pointer vitalic" onClick={() => toggleBubble('bubble1')}>
          Юнус пайғамбар Оллоҳнинг Найнаво ус­тига офат юборишини хоҳлаган,
          лекин Оллоҳ раҳмон ва раҳимдур. Найнаво­лик­лар гуноҳ ишлар билан
          аслида ўзла­ри­га ўз­ла­ри зулм қилаётганларини анг­ла­мас, Оллоҳ
          таоло­нинг:{' '}
          <span className="boldItalic">
            «Бутларга си­ғи­ниш­дан четлаб Оллоҳга қайт­ган­лар­га хушхабар
            бор»,
          </span>
          <sup>1</sup> де­ган ваъдасидан бехабар эди­лар.
        </p>
     {openBubbles['bubble1'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble1')}
          >
            <p>
              <sup>1</sup> Зумар сураси 39:17.
            </p>
          </div>
        )}
      </div>

      <div className="paragraph_heading">
        <p> ОЛЛОҲДАН КЕЛГАН АМР </p>
      </div>

      <div className="main_text">
        <p className="boldItalic">
          «Юнус ҳам шак-шубҳасиз пайғамбар­лар­дан­дир. У ... одамлар билан тўла
          кемага қараб қочган эди»{' '}
          <span className="vitalic">(Вас-Соффот сураси, 37:139-140.)</span>.
        </p>

     
        <p className="cursor-pointer" onClick={() => toggleBubble('bubble2')}>
          Оллоҳ жалла жалолаҳу бир куни Юнус (а.с.)<sup>2</sup> га бундай деб амр
          қилади: «Тур, Найнаво шаҳрига бор, бошларига келаётган мусибатдан
          уларни огоҳлантир. Мен уларнинг қилмишларидан хабардорман», дейди.
        </p>
   {openBubbles['bubble2'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble2')}
          >
            <p>
              <sup>2</sup> Юнус (а.с.) нинг отасининг исми Матто эди.
            </p>
          </div>
        )}

      </div>

      <div className="paragraph_heading">
        <p> Кемага миниш </p>
      </div>

      <div className="main_text">
   

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble3')}>
          Найнаво – <span className="vitalic"> ҳозирги Ироқ ҳуду­ди­да жойлашган </span>
          буюк бир шаҳар эди. Юнус (а.с.) итоат этиш ўрнига бош­қа мин­та­қа­га
          қочмоқчи бўладилар.<sup>3</sup> Ёппа­да­ги бандаргоҳга келиб, киросини
          бериб, денгизга чиқаётган бир кемага минадилар.
        </p>
     {openBubbles['bubble3'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble3')}
          >
            <p>
              <sup>3</sup> Юнус (а.с.) нинг қачон кемага мингани ҳақида ихтилоф
              бор. Баъзи уламолар фикрича, Юнус (а.с.) аввало Найнаво хал­қига
              ваъз қил­ганлар, улар унамагандан сўнг ғазабланиб, кемага ми­ниб
              қочганлар. Бошқа уламолар эса, Қуръондаги дуои аъзам деб аталмиш
              машҳур оятни ҳисобга олиб (инни кунту мин аз-золи­мийн), бу воқеа
              Найнавога боришдан аввал содир бўлган дейишади, хусусан Ибн Аббос
              ва Табарий шу фикрда бўлганлар.
            </p>
          </div>
        )}
      </div>

      <div className="main_text">
        <p className="vitalic">
          Қуръони каримда:{' '}
          <span className="boldItalic">
            «Токи сизлар кемада бўл­ганингизда ва яхши еллар ила уларни олиб
            кетганида ҳамда улар бундан хур­санд бўлганларида, қаттиқ шамол келур
            ва уларга ҳар томондан тўлқин келур»,
          </span>{' '}
          деган оят бор (Юнус сураси 10:22.).
        </p>

        <p>
          Дарҳақиқат, кема денгизга чиққандан ке­йин Оллоҳ азза ва жалла кучли
          бир шамол юбориб, денгизда даҳ­шатли бўрон бошланади. Бўрон кемани
          пар­ча­лаб юборай дер эди. Ваҳимага тушган одам­лар ўзларининг
          худоларидан ёрдам сўра­дилар. Сўнгра кема енгиллашсин деб юк­лар­ни
          денгизга ташлай бошладилар.
        </p>

        <p>
          Юнус пайғамбар эса бу пайтда кеманинг пастки бўлмасида қаттиқ ухлаб
          ётган эдилар. Бир пайт кема дарғаси у киши ётган жойга тушиб: «Нега
          ухлаяпсан?! Тур, сен ҳам ўз худойингга илтижо қил! Балки у бизларни
          сақлаб қолар», деб айтади.
        </p>
      </div>

      <div className="paragraph_heading">
        <p> “МЕНИ ДЕНГИЗГА ТАШЛАНГЛАР” </p>
      </div>

      <div className="main_text">
        <p className="boldItalic">
          «Бас кемадагилар билан қуръа таш­ла­шиб мағлуб бўлгач{' '}
          <span className="vitalic">(уни денгизга улоқ­тир­дилар)</span>».{' '}
          <span className="vitalic">Вас-Соффот сураси, 141.</span>
        </p>

        <p>
          Бўрон борган сари кучаяр эди. Кемадагилар бир вақт: «Келинглар, қуръа
          ташлайлик. Бу фалокатга ким сабабчи эканини билайлик», дедилар. Қуръа
          ташлаганларида, қуръа Юнус (а.с.) га тушди.
        </p>

        <p>
          Шунда улар: «Кимсан?.. Нима учун бошимизга бу мусибат келди?.. Қайси
          элдансан?.. Нима иш қиласан?.. Қаердан келяпсан?» деб пайғамбарни
          саволларга кўмиб ташлайди. У киши эса: «Мен ибронийман. Оллоҳга –
          сувларни ва қуруқликни яратган осмон худосига сиғинаман», деб уларнинг
          саволларига жавоб бера бошладилар.
        </p>

        <p>
          Шунда улар Юнус пайғамбарнинг Оллоҳ­нинг амридан қочиб келаётганини
          англадилар. Англаб яна ҳам қаттиқроқ даҳ­шат­га тушдилар ва: «Энди нима
          қилдик? Нима қиламиз? Бўрон тўхташи учун сени нима қилишимиз керак?!»
          деб сўрадилар. Сабаби бўрон борган сари кучайиб бораётган эди.
        </p>

        <p>
          Юнус (а.с.) уларга: «Мени ушлаб денгизга ташланглар, шунда денгиз
          тинчийди. Бу бўронга мен сабабчиман», деб айтдилар. Денгизчилар эса
          бунинг ўрнига, кемани қирғоққа олиб бориш учун зўр бериб эшкак эшдилар,
          бироқ уддасидан чиқол­ма­ди­лар – денгиз бадтар қутуриб, улар­ни орқага
          суриб ташлайверди.
        </p>
      </div>

      <div className="main_text">
    

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble4')}>
          Охири улар Оллоҳ таолога ёлвориб: «Ё Оллоҳ! Булар­нинг ҳаммаси Сенинг
          ироданг экан, бу бегуноҳнинг ўлимига бизни айбдор қилма», деб Юнус
          (а.с.) ни денгизга ташладилар.<sup>4</sup>{' '}
          <span className="vitalic">Ла ҳавла ва ла қуввата илла бил­лаҳ...</span>{' '}
          Оллоҳнинг қудратини қаранглар – денгиз ўша заҳоти тинчланибди!{' '}
          <span className="vitalic">Оллоҳу акбар! </span> Буни кўрган денгизчилар
          Оллоҳ­дан қаттиқ қўрқувга тушдилар. Кейин Оллоҳ таолога атаб
          қурбонликлар келтиришади, бир нечалари бўйинларига назр ҳам оладилар.
        </p>
            {openBubbles['bubble4'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble4')}
          >
            <p>
              <sup>4</sup> Афиф Абдул-Фаттоҳ Таб­бо­ра­нинг «Маъал-анбия фи
              ал-Қуръанил-карим» ки­то­бига қаранг.
            </p>
          </div>
        )}
      </div>
    </main>
  );
}