'use client';

import '../../qisas-uzb/stories.css';
import { useSpeechBubbles } from '../../hooks/useSpeechBubbles';
import ConverterForQisas from './ConverterForQisas';
import './converterForQisas.css';

export default function Introduction() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble1',
    'bubble2',
    'bubble3',
    'bubble4',
  ]);

  return (
        <main className="stories relative">
          <p className="!text-[rgba(133,127,0,0.9)] font-['Aga_islamic'] !text-[32px] text-center mt-10 !mb-20">
            ﷽
          </p>

          <article className="hidden sm:flex gap-6">
            <div className="w-1/2">
              <p className='text-[10px] font-normal leading-[15.5px]'>
                «Эй барча мулкнинг эгаси Раббим! Хоҳлаган кишингга мулк берурсан ва
                хоҳлаган кишингдан мулкни тортиб олурсан, хоҳлаган кишингни азиз
                қилурсан, хоҳлаган ки­шингни хор қилурсан. Барча яхшилик Сенинг қўлингда.
                Албатта, Сен ҳар бир нарсага қо­дир­сан. Кечани кун­дуз­га ки­ри­тур­сан
                ва кундузни ке­ча­га киритурсан, ўлик­дан тирикни чи­қа­рур­сан ва
                тирикдан ўликни чиқарурсан ҳамда хоҳ­ла­ган ки­­шинг­­га бе­ҳи­соб ризқ
                берурсан» <span className="vitalic">(Оли Имрон 3:26-27).</span>
              </p>
            </div>

            <div className="w-1/2 rtl">
               <p 
                  dir="rtl" 
                  lang="ar" 
                  className="font-amiri !text-[22px] !leading-[44px] text-justify"
                >
                ٱللَّهُمَّ مَـٰلِكَ ٱلْمُلْكِ تُؤْتِى ٱلْمُلْكَ مَن تَشَآءُ وَتَنزِعُ
                ٱلْمُلْكَ مِمَّن تَشَآءُ وَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُ ۖ
                بِيَدِكَ ٱلْخَيْرُ ۖ إِنَّكَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ تُولِجُ
                ٱلَّيْلَ فِى ٱلنَّهَارِ وَتُولِجُ ٱلنَّهَارَ فِى ٱلَّيْلِ ۖ وَتُخْرِجُ
                ٱلْحَىَّ مِنَ ٱلْمَيِّتِ وَتُخْرِجُ ٱلْمَيِّتَ مِنَ ٱلْحَىِّ ۖ
                وَتَرْزُقُ مَن تَشَآءُ بِغَيْرِ حِسَابٍۢ
              </p>
            </div>
          </article>

    

          <div className="uzbek_quron">
            {openBubbles['bubble1'] && (
              <div className="speech-bubble" onClick={() => toggleBubble('bubble1')}>
                <p>
                  <sup>1</sup> Абу Зар Ғифорий шундай дейди: «Ё Расулaллоҳ, Мусонинг
                  саҳифаларида нималар бор эди?» деб сўрадим. Пайғамбаримиз
                  алайҳиссалом: «Ҳаммаси ибрат эди» дедилар.
                </p>
                <p className="who_wrote">(Ибн-и Сод. “Табақот”, 1-жилд, 155-бет.)</p>
              </div>
            )}

            <article
              className="w-full boldItalic cursor-pointer border border-gray-400  px-4 rounded-md"
              onClick={() => toggleBubble('bubble1')}
            >
              <p className='boldItalic my-2'>
                «Батаҳқиқ, <span className="vitalic">(пайғамбарлар)</span> қиссаларида
              ақл эгалари учун ибрат бор».
              <span className="vitalic"> (Юсуф сураси, 111-оят)</span>
              <sup>1</sup>
              </p>
            </article>
          </div>

          <div className="main_text">
            <p>
              Aлҳамду лиллаҳи раббил аъламийн. Вас-солату вас-саламу аъла саййидина
              Муҳаммад ва аъла алиҳи ва асҳобиҳи ажмаъийн. Ассалому алайкум ва
              раҳматуллоҳи ва баракотуҳу. Аъмма баъд...
            </p>

            <p>
              Ушбу китоб араб тилида “Қисас ал-Анбия” деб аталиб, пайғамбарлар (а.с.)
              тарихини ҳикоя қилади. Бу жанрда ёзилган китоблар бир нечта. Улардан
              биринчиси Муҳаммад Ибн Исҳоқнинг тўплами бўлиб, у киши ўз асарини асосан
              уч мавзуга бағишлаган: дунёнинг яратилиши ҳамда Муҳаммад (с.а.в.) дан
              аввалги пайғамбарлар тарихи (Kitab al-mubtada’), пайғамбаримиз (с.а.в.)
              нинг ҳаёти ва олган ваҳийлари (Сира), ва у кишининг ҳарбий юришлари
              (Maghozi).
            </p>

            <p>
              Афсуски, Ибн Исҳоқнинг асари бизгача етиб келмади, лекин баъзи уламолар,
              масалан Ал-Табарий ўз тафсирида ва олам тарихи ҳақида ёзган китобида Ибн
              Исҳоқнинг гапларини қайта-қайта тилга олган (қаранг: Tarikh al-rusul
              wa-l-muluk). Хусусан, сўнгги китобнинг ғоясида ҳам, шаклида ҳам Ибн
              Исҳоқнинг таъсири жуда кучли.
            </p>

            <p>
              Қисас ал-Анбия жанрида қалам тебратган ёзувчилардан яна бири аслан келиб
              чиқиши форсий бўлмиш яманлик Ваҳб ибн Мунаббиҳ. У киши пайғамбарлар тарихи
              ҳақида баён қилувчи юзта бўлимни ўз ичига олган тўплам соҳиби. Араб тилидан
              ташқари, иброний ҳамда арамий тилларини ҳам яхши билган. Таврот ва Забур
              китобларини асл матнда ўқий олар, шу сабабдан қадимги пайғамбарлар тарихини
              кучли далил ва ҳужжатлар билан баён этган.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble2'] && (
              <div className="speech-bubble" onClick={() => toggleBubble('bubble2')}>
                <p>
                  <sup>2</sup> Бу қўлёзмада дунёнинг яратилиши, Иброҳим (а.с.) ва у
                  кишидан аввал умр сурган пайғамбарлар тарихи баён этилган.
                </p>
              </div>
            )}

            <p
              onClick={() => toggleBubble('bubble2')}
              className="cursor-pointer "
            >
              Қисас ал-Анбиянинг яна бир тўплами хуросонлик Исҳоқ ибн Бишрга тегишли.
              У киши бошқа мавзуларда ҳам асарлар яратган, пайғамбарлар тарихига атаб
              эса «Mubtada’ al-dunyа wa qisas al-Anbiyа», деган китоб ёзган (яъни,
              «Дунёнинг бошланиши ва пайғамбарлар тарихи»). Яқин-яқингача бу китоб
              йўқолган саналар, бахтга кўра бир неча йил олдин китобнинг биринчи қисми
              топилиб, дунё кутубхонаси яна битта қўлёзмага бойиди.<sup>2</sup>
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble3'] && (
              <div className="speech-bubble" onClick={() => toggleBubble('bubble3')}>
                <p>
                  <sup>3</sup> Абу Исҳоқ пайғамбаримиз Муҳаммад (с.а.в.) дан 400 йил
                  кейин яшаган таҳлилчи олим эди.
                </p>
              </div>
            )}

            <p
              onClick={() => toggleBubble('bubble3')}
              className="cursor-pointer "
            >
              Пайғамбарлар тарихининг кейинги тўплами Абу Исҳоқ ал-Салабийники.
              <sup>3</sup> Унинг илоҳий битикларга ёзган тафсирлари катта илмий
              аҳамиятга эга бўлса-да, халқ орасида унчалик шуҳрат қозонмади.
            </p>

            <p>
              Навбатдаги ёзувчи Ал-Ҳайсам ибн Муҳаммад ал-Бушанжий. Унинг араб тилида
              битилган «Qisas al-Qur’аn» тўплами ҳам алоҳида диққатга сазовор. Китоб
              Қуръонда айтилган пайғамбарлар тарихини, пайғамбарлар ҳақида айтилган
              ривоятларни, ҳамда набий Муҳаммад (с.а.в.) нинг ҳаётини баён қилади.
            </p>

            <p>
              Қуддуслик Аҳмад ибн Абу Узайба ҳам «Қисас ал-Анбия» тўплаган, лекин
              бизгача унинг фақат битта қўлёзмаси етиб келган, холос.
            </p>

            <p>
              Араб бўлмаган муаллифлар ичида эса Насриддин Рабғузийнинг туркий тилда
              ёзган китоби энг муҳим ўрин эгалласа керак. Унинг пайғамбарлар ҳақида
              ёзган қиссалари катта ҳажмда бўлиб, кўп тафсилотларни ўз ичига олган
              ривоят ва афсоналардан иборат.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble4'] && (
              <div className="speech-bubble" onClick={() => toggleBubble('bubble4')}>
                <p>
                  <sup>4</sup> Айтиш лозимки, мана шу охирги юз йил мобайнида Ибн
                  Касирнинг тўплами оммага кенг таъсир ўтказди.
                </p>
              </div>
            )}

            <p
              onClick={() => toggleBubble('bubble4')}
              className="cursor-pointer "
            >
              Кейинроқ Ибн Таймийя ҳамда унинг шогирди Ибн Касир, ўша замонда мавжуд
              бўлган Қисас ал-Анбия китобларини текширувдан ўтказадилар. Баъзи
              ҳикояларни, айниқса яҳудий ҳамда насроний матнларда мавжуд бўлган
              қиссаларни рад этадилар.<sup>4</sup>
            </p>

            <p>
              Ҳа, асрлар оша авлоддан авлодга ўтиб келаётган бу адабий жанр, «Қисас
              ал-Анбия» китоблари, ҳануз ўқувчилар орасида машҳур. Араб, форс ҳамда
              туркий халқлар орасида «Пайғамбарлар тарихи» қайта-қайта нашр қилинмоқда.
              Масалан, мисрлик ал-Шаровийнинг “Қисас ал-Анбия” си ҳам жуда машҳур. 3000
              саҳифадан ортиқ бу китоб беш томдан иборат бўлиб, пайғамбарлар тарихини
              замонавий тарзда шарҳлаган, юзаки бўлса ҳам, жуда кўп маълумотни ўз ичига
              олган.
            </p>

            <p>
              Шу пайтгача араб тилида, форс тилида ҳамда туркий тил­ларда пай­ғам­барлар
              тарихи кўп марта нашр бўлган. Лекин афсуски, ўзбек тилида бу адабий жанр
              жуда кам бо­силди. Шу сабабдан биз ҳам, айтишга арзигулик бўлмаса-да, бу
              борада бироз тер тўкиб, ўтган пайғамбарлар та­рихи ҳақида озгина бўлса ҳам
              маълумот етказишга ҳаракат қилдик.
            </p>

            <p>
              Ушбу китоб Абу Ҳамид ибн Муҳаммад­нинг тўплами. У киши пайғамбарлар
              тарихини қадимий ишончли манбалардан, хусусан Таврот ва Забури шарифлардан
              ўрганган, Қуръони каримда бу ҳақда ёзилган оятларни таҳлил қилган ва Ислом
              динидаги буюк уламолар, жумладан Табарий, Ибн Исҳоқ, Ибн Халдун ҳамда
              Яъқубий каби олимларнинг тафсирларини ҳисобга олган. Биз бу тўпламни
              баҳоли-қудрат ўзбек тилига таржима қилдик. Умид қиламизки, пай­ғам­барлар
              қиссаси қалбингизга ил­ҳом бе­риб, ях­ши­лик­ка, тўғ­риликка, тақволи
              ҳаётга даъват этса.
            </p>

            <p>Ҳурмат билан, таржимонлар гуруҳи.</p>
          </div>

          <ConverterForQisas />

          <footer>
            <div>
              <p>© 2016 Abdul-Ghafur ibn Abdul-Sattar</p>
            </div>
          </footer>
        </main>

  );
}