'use client';

 
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function NuhAlayhissalam() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble1',
    'bubble2',
    'bubble3',
    'bubble4',
    'bubble5',
    'bubble6',
    'bubble7',
  ]);

  return (
    <div className="stories relative">
      <div className="separate_into_two_columns">
        <main className="sep_part1">
          <div className="main_text">
            {openBubbles['bubble1'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble1')}
              >
                <p>
                  <sup>1</sup> Қуръони каримнинг Юнус сураси 10:72-73.
                </p>
              </div>
            )}

            <p
              className="boldItalic cursor-pointer "
              onClick={() => toggleBubble('bubble1')}
            >
              «Менинг ажрим фақат Оллоҳ­­дан, – деди{' '}
              <span className="vitalic">(Нуҳ алайҳис-салом). </span> – Ва мен
              му­сул­мон бўлишга амр қилинганман». Сўнг­ра уни ёл­ғон­чи­га
              чи­қаришди. Бас, Биз уни ва у ила бирга бўлганларни ке­ма­да
              қутқар­дик ва уларни хали­фа­лар қил­дик. Оятларимиз­ни
              ёл­ғон­га чи­қар­ган­лар­ни ғарқ этдик. Огоҳлантирилган­лар­нинг
              оқи­ба­ти қан­дай бўл­га­ни­га назар сол».
              <sup>1</sup>
            </p>
          </div>

          <div className="main_text">
            <p>
              Орадан анча вақт ўтди.{' '}
              <span className="vitalic">
                Одамлар кўпайди. Одамлар кўпайган сари гуноҳ ҳам кўпайди.
              </span>{' '}
              Ёмонлик авж олиб, одамларнинг ўю хаёли ҳамиша ёмонлик билан
              машғул бўладиган бўлди. Оллоҳ бундан норози эди. Чунки Оллоҳ
              яратган халқ, Оллоҳнинг иродасига қарши чиқиб, осийлик йўлини
              танлаган эди.
            </p>

            <p>«Мен инсониятни ер юзидан йўқ қиламан», деди Худо.</p>

            <p>
              Фақат Нуҳ (а.с.) Оллоҳнинг ризосини топган эдилар. Нуҳ (а.с.)
              Худо йўлида юрадиган, Худога итоат этадиган солиҳ одам бўлиб,
              замондошлари орасида бенуқсон деб танилган эдилар.
            </p>
          </div>

          <div className="paragraph_heading">
            <p>ГУНОҲ УЧУН ЧИҚАРИЛГАН ҲУКМ</p>
          </div>

          <div className="main_text">
            <p>
              Оллоҳ таоло одамларнинг бузилиб кетганини, зўравонликка
              берилганини, бутун ер юзининг бузуқлик ва зулмга тўлганини кўриб,
              Нуҳ пайғамбарга деди:
            </p>

            <p>
              «Одамлар ер юзини зулм билан тўлдирди. Мен энди бутун инсониятни
              қириб ташлайман. Сен сарв дарахтидан кема яса. Ичини хона-хона
              қилиб қур. Кейин ҳам ичидан, ҳам ташқарисидан қатрон сурт.
              Эшигини ён тарафдан қўй. Мен ер юзига сув тўфони юбораман.
              Ердаги ҳамма одамларни йўқ қиламан. Сен билан эса аҳд тузаман.
              Сени, аҳлингни, ўғилларингу келинларингни кемада сақлаб қоламан»,
              деди.
            </p>

            <p>
              Ҳазрати Нуҳ (а.с.) Оллоҳнинг ҳамма буйруқларини айтилганидек
              бажардилар.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble2'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble2')}
              >
                <p>
                  <sup>2</sup> Насафий, «Мадорик»; Суютий, «Дур-ул-мансур».
                </p>
              </div>
            )}

            <p
              className="vitalic cursor-pointer "
              onClick={() => toggleBubble('bubble2')}
            >
              Тасаввур қилиб кўринг: на денгизи ва на дарёси бўлмаган далада
              Оллоҳнинг расули каттакон кема қуриш билан банд. Кеманинг узунлиги
              тахминан 137 метр, кенглиги 23 метр ва баландлиги 14 метр эди.
              <sup>2</sup> Уни қуриб битириш учун озмунча вақт кетмайди. Нуҳ
              (а.с.) нинг танишлари, қўшнилари унинг йиллаб кема қураётганини
              кўриб, қандай фикрларга борган экан?
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble3'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble3')}
              >
                <p>
                  <sup>3</sup> «Нуҳ (а.с.) нинг қавми пайғамбарларни ёлғончи
                  қилди» (Қуръондан, Шуъаро 26:105).
                </p>
              </div>
            )}

            <p
              className="vitalic cursor-pointer "
              onClick={() => toggleBubble('bubble3')}
            >
              Кимдир у кишини ақлдан озган деб ўйлади. Кимдир калака қилди.
              “Худо ер юзига тўфон юбормоқчи, тавба қилинглар!” деса кимлардир
              ёмон кўрди. “Қандоғ тўфон?! Нима деяпсан ўзи?!” Бироқ Худо
              дарҳақиқат, ер юзига тўфон юбораман, деб ваъда қилган эди.
              <sup>3</sup>
            </p>
          </div>

          <div className="paragraph_heading">
            <p>ТЎФОН</p>
          </div>

          <div className="main_text">
            <p className="boldItalic">
              «Қасамки, Биз Нуҳни ўз қавмига пайғамбар қилдик. ... Бас, уни
              ёлғончи қилдилар. Шунда Биз уни ва у билан бирга бўлган зотларни
              кемада қутқардик ва Бизнинг оятларимизни ёлғон деган кимсаларни
              ғарқ қилиб юбордик»
              <span className="vitalic"> (Аъроф сураси, 7:59,64).</span>
            </p>

            <p>
              Ниҳоят, вақт-соати келганда, Оллоҳ таоло Нуҳ (а.с.) га: «Бор,
              хонаводангни олиб кемага кир, — деди. — Мен ер юзида сендан бошқа
              солиҳ одам топмадим. Насли йўқолиб кетмаслиги учун ўзинг билан
              ҳалол ҳайвон ва қушларнинг ҳар биридан етти жуфт, ҳаром
              ҳайвонлардан бир-бир жуфт, эркак-урғочи аралаш оласан. Мен етти
              кундан сўнг ер юзига қирқ кечаю қирқ кундуз ёмғир ёғдираман.
              Ўзим яратган бутун тирик мавжудотни ер юзидан супуриб ташлайман»,
              деди.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble4'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble4')}
              >
                <p>
                  <sup>4</sup> «Кемага мининглар, унинг юриши ҳам, туриши ҳам
                  Оллоҳнинг исми ила бўлур. Албатта, Раббим мағфиратли ва
                  раҳмлидир», деди (Нуҳ (а.с.), Ҳуд сураси 11:41).
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble4')}
            >
              Нуҳ (а.с.) Оллоҳ таолонинг ҳамма буйруқларини айтилганидек
              бажардилар ва хонаводасини, ўғиллари-ю келинларини олиб, тўфондан
              омон қолиш учун кемага
              <sup>4</sup> кирдилар. Ўшанда расулуллоҳ олти юз ёшда эдилар.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble5'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble5')}
              >
                <p>
                  <sup>5</sup> Ҳуд сураси 11:40 га қаранг.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble5')}
            >
              Оллоҳ айтганидай, ҳалолу ҳаром, каттаю кичик ҳайвонлар ва қушлар,
              эркагу урғочиси жуфт-жуфт бўлиб, ҳазрати Нуҳнинг олдига келди ва
              кемага кирди.
              <sup>5</sup>
            </p>

            <p>Ниҳоят Худо кеманинг эшигини беркитди.</p>
          </div>

          <div className="main_text">
            {openBubbles['bubble6'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble6')}
              >
                <p>
                  <sup>6</sup> Табарий: «Тарих», 1-жилд 94-бет; Замаҳшарий:
                  «Кашшоф», 4-жилд, 37-бет.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble6')}
            >
              Кейин ... тўфон бошланди. Ер қаъридаги чашмаларнинг ҳаммаси
              юқорига отилиб чиқди. Осмон қопқалари очилиб, қирқ кечаю қирқ
              кундуз ер юзига шиддатли жала ёғди.
              <sup>6</sup>
            </p>
          </div>

          <div className="main_text">
            <p>
              Бу пайтда ҳазрати Нуҳ ва унинг хонаводаси, ўғиллари Сом, Ҳом,
              Ёфас (р.а.) ва уларнинг хотинлари кеманинг ичида ўтирган эдилар.
            </p>
          </div>

          <div className="paragraph_heading flex justify-center">
            <p>ҚОЛГАНЛАР ҲАММАСИ ҲАЛОК БЎЛДИМИ?</p>
          </div>

          <div className="main_text">
            <p className="boldItalic">
              «Осмон эшикларини шаррос сув билан очиб юбордик. Ва ердан
              отилтириб, булоқлар чиқардик. Бас, сувлар тақдир қилинган иш учун
              бирлашдилар. Ва (Нуҳни) тахталари ва михлари бор нарса устига
              кўтардик»
              <span className="vitalic"> (Қамар сураси 54:11-13).</span>
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble7'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble7')}
              >
                <p>
                  <sup>7</sup> “Ўн беш тирсак”: қаранг, Табарий, Салабий ҳамда
                  Қуртубийнинг «Тафсири».
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble7')}
            >
              Сув тўфони қирқ кун давом этди. Сувлар кўпайиб, тошиб, кемани
              ердан баланд кўтарди. Бора-бора сув шунчалик кўпайдики, энг баланд
              тоғлар ҳам сув остида қолди. Сувлар тошиб, тоғ чўққиларидан ўн беш
              тирсак
              <sup>7</sup> ошиб кетди.
            </p>

            <p>
              Ер юзидаги бор тирик мавжудот: ҳайвонлар, қушлар, инсонлар,
              хуллас, қуруқликда нафас олиб яшаётган ҳамма нарса ҳалок бўлди.
              Ер юзидаги ҳар қандай жонзод — инсондан ҳайвонгача, ерда
              қимирлаган махлуқотдан осмонда учиб юрган қушгача ҳаммаси нобуд
              бўлди. Фақат ҳазрати Нуҳ ва у билан бирга кемага кирганлар тирик
              қолган эдилар.
            </p>

            <p className="vitalic">
              Оллоҳ таоло нима учун одамларни ўлимга маҳкум қилди? Гуноҳдан
              қайтмаганлари учунми? Бир кун эмас бир кун ҳар биримиз Оллоҳнинг
              ҳузурида, муҳокама бўлиш учун тик турамиз. Худо бизни қилган
              ишларимизга биноан ҳукм қилади. Ўша пайтда қаердан нажот топамиз?
              Жон сақлашимиз учун “кема” топилармикан? Ёки охиратини ўйлаганлар
              ҳозирданоқ “Ҳаёт кемасини” излаши керакми?
            </p>
          </div>
        </main>
      </div>
    </div>
  );
}