'use client';

 
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function Jacob() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble1',
    'bubble2',
  ]);

  return (
    <div className="stories relative">
      <div className="separate_into_two_columns">
        <main className="sep_part1">
          <div className="main_text">
            {openBubbles['bubble1'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble1')}
              >
                <p>
                  <sup>1</sup> «Ахёр» сўзи араб тилида «жуда ҳам яхши» де­ган
                  маъ­нони бе­ради. Оят­да исм­ла­ри зикр қи­лин­ган
                  пай­ғам­бар­лар – ҳазрати Иб­ро­ҳим, ҳаз­­ра­ти Исҳоқ ва
                  Яъқуб – Оллоҳ танлаб ол­ган ахёр­лар эди.
                </p>
              </div>
            )}

            <p
              className="boldItalic cursor-pointer "
              onClick={() => toggleBubble('bubble1')}
            >
              «Қўллар ва кўзлар соҳиблари бўлган бандаларимиз Иброҳим, Исҳоқ ва
              Яъқубларни эсла. Албатта, Биз уларни холис бир хислат билан
              ажратдик. У (охират) диёрини эслаш эди. Албатта, улар Бизнинг
              ҳузуримизда танланган ахёрлардандир»
              <sup>1</sup> <span className='vitalic'>(Қуръони карим, 38:45-47).</span>
            </p>
          </div>

          <div className="paragraph_heading">
            <p>ЙЎЛГА ЧИҚИШ</p>
          </div>

          <div className="main_text">
            <p>
              Рафиқа Биби Ийсу (р.а.) нинг ниятидан хабардор эди. Шунга Яъқуб
              (а.с.) ни чақириб деди: «Аканг сени ўлдирмоқчи. Сен энди Ҳоронга,
              тоғанг Лобонникига кетмасанг бўлмайди. То аканг жаҳлидан тушгунча,
              ўша ерда тур. Қилган ишинг эсидан чиқсин, мен ўзим одам юбориб
              сени чақиртираман. Тағин бир кунда икковингиздан ҳам жудо бўлмай!»
            </p>

            <p>
              Кейин ҳазрати Исҳоқнинг олдига бориб: «Бу ҳитий келинлар мени
              жонимдан безор қилди. Агар Яъқуб ҳам ҳитийлардан хотин олса,
              менинг ўлганим яхши!» деди.
            </p>

            <p>
              Исҳоқ (а.с.) ўғли Яъқубни олдига чақирдилар ва уни дуо қилиб: «Мен
              сенинг канъонликлардан уйланишингни хоҳламайман, — дедилар. — Шу
              бугун Байнул-наҳрайнга, бобонг Батуийлнинг уйига қараб йўлга туш.
              Бориб тоғанг Лобоннинг қизларидан бирига уйлан. Оллоҳ таоло сени
              баракаласин, кўп фарзандлар ато қилсин! Наслинг кўпайиб, халқлар
              жамоасига айлан! Сен ва сенинг авлодларинг буванг Иброҳимга ваъда
              қилинган баракага эга бўлиб, Канъон юртини, биз мусофир бўлиб
              яшаётган мана шу юртни қўлга киритгайсизлар!»
            </p>

            <p>
              Шу гаплар билан Исҳоқ пайғамбар уни Байнул-наҳрайнга, тоғаси
              Лобоннинг олдига жўнатди.
            </p>

            <p>
              Отасининг канъонлик келинлардан безор эканини, Яъқубни
              канъонликларга уйланма деб дуо билан Байнул-наҳрайнга жўнатганини
              кўриб, Ийсу (р.а.) ҳам амакиси Исмоил (а.с.) нинг уруғига борди ва
              Набоютнинг синглиси, Исмоил (а.с.) нинг қизи Маҳолатни хотинликка
              олди.
            </p>
          </div>

          <div className="paragraph_heading">
            <p>ЯЪҚУБ (А.С.) НИНГ ТУШИ</p>
          </div>

          <div className="main_text">
            <p>
              Шу билан Яъқуб (а.с.), Беър-Шебадан Ҳоронга — тоғасиникига қараб
              йўлга тушдилар. Кун ботарда бир жойда тўхтаб, тунни ўша ерда
              ўтказмоқчи бўлдилар. Тошларнинг бирига бош қўйиб, уйқуга кетдилар.
            </p>

            <p>
              Уйқусида туш кўрибдилар. Тушида бир зина турган эмиш. Зинанинг бир
              учи ерда, бир учи арши-аълода экан. Худонинг фаришталари зинадан
              тушиб-чиқиб ётган эмиш.
            </p>

            <p>
              Кейин Оллоҳ таоло аршдан Яъқуб (а.с.) га дебди: «Мен бобонг
              Иброҳим ва отанг Исҳоқ билан аҳд қилган Худоман. Сен ётган мана шу
              ерни Мен сенга ва сенинг авлодингга бераман. Сенинг наслинг ер
              юзидаги қумлардай кўп бўлади. Ғарбу шарққа, шимолу жанубга ёйилиб
              кетасизлар. Ер юзидаги ҳамма қавмлар сен ва сенинг зурриятинг
              орқали баракага ворис бўлади.
            </p>

            <p>
              Мен сен билан биргаман. Қаергаки борсанг сени ҳимоя қиламан.
              Вақт-соати келиб шу юртга қайтиб келасан. Мен сени ташлаб
              кетмайман. Сен билан бирга бўламан, айтган ҳамма ваъдаларимни
              амалга ошираман», дейди.
            </p>
          </div>

          <div className="paragraph_heading">
            <p>ЯЪҚУБ (А.С.) ГА БЕРИЛГАН ВАЪДАЛАР</p>
          </div>

          <div className="main_text">
            <p className="vitalic">
              Шундай қилиб Оллоҳ азза ва жалл Яъқуб (а.с.) га ҳам уч нарсани
              ваъда берди:
            </p>
          </div>
              

          <div className='border rounded-md border-green-600 p-3'>
              <p className="vitalic pl-4">~ авлодлари кўп бўлишини,</p>

              <p className="vitalic pl-4">~ ерни унинг авлодлари эгаллашини</p>

              <p className="vitalic pl-4">
                ~ ҳамда унинг зуррияти орқали ер юзидаги ҳамма халқларга барака
                улашишни ваъда қилди.
              </p>
            </div>

          <div>
            <p className="vitalic">
              Агар эсингизда бўлса, Иброҳим пайғамбарга ҳам, Исҳоқ (а.с.) га ҳам
              айни шу гаплар ваъда қилиб айтилган эди.
            </p>
          </div>

          <div className="paragraph_heading">
            <p>ЯЪҚУБ (А.С.) НИНГ НАЗР ОЛГАНИ</p>
          </div>

          <div className="main_text">
            <p>
              Яъқуб (а.с.) уйқудан уйғониб: «Бу ер муқаддас жой экан! Мен
              билмабман», дедилар ҳайрон бўлиб. Кейин юракларига қўрқув тушиб:
              «Бу ер ҳақиқатан арши аълога олиб чиқадиган дарвоза экан!»
              дедилар.
            </p>

            <p>
              Саҳар пайти эди. Яъқуб (а.с.) туриб, бошини қўйган тошни
              турғиздилар-да, устидан зайтун ёғи қуйиб Оллоҳ таолога бағишладилар
              ва ўша жойга Байтил деб от қўйдилар (илгариги оти Луз эди.)
            </p>

            <p>
              Кейин: «Агар Худо мен билан бирга бўлиб, йўлда мени қўриқласа,
              қорнимга нон, устимга кийим бериб турса, отам уйига тинчлик билан
              олиб келса, мен фақат Унга хизмат қиламан. Мен тош қўйган ер
              Байтуллоҳ бўлади. Кейин Оллоҳ менга нимаики ато қилса, ўндан
              бирини назр қиламан», дедилар.
            </p>

            <p className="vitalic">
              Оллоҳ таоло Яъқуб пайғамбарга туш орқали ваҳий нозил қилди. Бир
              тасаввур қилинг: қани эди агар ердан Оллоҳ таоло турган жойга чиқиш
              учун зинапоя қўйилган бўлса! Тепага чиқиб, кўп нарсани кўриб олар
              эдик, кўп нарсани тушунардик, шундай эмасми?! Балки жаннатни ҳам
              кўрармидик, нима деб ўйлайсиз?
            </p>
          </div>

          <div className="paragraph_heading">
            <p>ТОҒАСИНИНГ УЙИДА</p>
          </div>

          <div className="main_text">
            <p>
              Яъқуб (а.с.) сафарини давом эттириб, ниҳоят Ҳорон ерига етиб
              келдилар. Қарасалар бир қудуқ турибди. Қудуқнинг бўйида уч сурув
              қўй ётган, қудуқнинг оғзига эса катта бир тош қўйилган эди. (Тош
              фақат ҳамма одамлар қўйларини ҳайдаб келгандан сўнг олинар, қўйлар
              сув ичиб бўлгач, қудуқнинг оғзини яна ўша тош билан ёпиб қўяр
              эдилар.)
            </p>

            <p className='m-1'>—Биродарлар, қаердансизлар? — деб сўрадилар ҳазрати Яъқуб чўпонлардан.</p>

            <p className='m-1'>—Ҳорондан, — деб жавоб беришди улар.</p>
          </div>

          <div className="main_text">
            {openBubbles['bubble2'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble2')}
              >
                <p>
                  <sup>2</sup> Ноҳур — Иброҳим (а.с.) нинг туғишган акаси эди.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer m-1"
              onClick={() => toggleBubble('bubble2')}
            >
              —Лобон деган одамни танийсизларми? Ноҳур
              <sup>2</sup> деганнинг невараси.
            </p>
          </div>

          <div className="main_text">
            <p className='m-1'>—Ҳа, таниймиз.</p>

            <p className='m-1'>—Яхши юрибдими?</p>

            <p className='m-1'>
              —Ҳа, яхши, — деб жавоб берди чўпонлардан бири. — Ана, қизи Роҳийла
              қўйларини ҳайдаб келяпти.
            </p>

            <p className='m-1'>—Кечгача ҳали вақтли-ку, нега қўйларингизни суғориб, ўтлатишга олиб кетмайсизлар?</p>

            <p className='m-1'>—Сурувларнинг ҳаммаси йиғилмаса, қудуқнинг оғзидаги тошни суролмаймиз, — дейишди улар.</p>

            <p>
              Улар гаплашиб турганда, Роҳийла отасининг қўйларини ҳайдаб қудуққа
              етиб келди. (Отасининг қўйларини Роҳийла боқар эди.) Шунда ҳазрати
              Яъқуб дарров қудуқнинг оғзидаги тошни бир ёққа ағнатиб, тоғасининг
              қўйларини суғордилар. Кейин Роҳийла билан сўрашар эканлар, ўзини
              тутолмай йиғлаб юбордилар:
            </p>

            <p>
              «Мен Рафиқа аммангнинг ўғлиман», деб ўзларини Роҳийлага
              таништирдилар. Роҳийла югуриб бориб, отасига хабар берди.
            </p>

            <p>
              Жияни келганини эшитган Лобон шошиб уни пешвоз олишга чиқди,
              қучоқлаб юзларидан ўпди. Кейин уйига олиб кетди. Уйда
              ўтирганларида Яъқуб (а.с.) бўлиб ўтган воқеаларнинг ҳаммасини
              тоғасига гапириб бердилар.
            </p>

            <p>
              «Қайғурма, — деди Лобон. — Сен менинг жигаримсан. Шу ерда, мен
              билан бирга яшайверасан».
            </p>
          </div>
        </main>
      </div>
    </div>
  );
}