'use client';

 
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function JephthahSacrifice() {
  const { openBubbles, toggleBubble } = useSpeechBubbles(['bubble1']);

  return (
    <main className="stories relative">
      <div className="main_text">
        <p>
          Бироқ Амўн шоҳи Ёффайнинг гапларига қулоқ солгани йўқ.
        </p>

        <p>
          Кейин Ёффай Оллоҳдан қудрат олиб, Жилъ од ва Манашега, кейин
          Жилъоднинг Мисфасига борди, у ердан эса амўнийларга қарши урушга чиқди.
        </p>

        <p>
          Душманга яқинлашар экан ўзича: «Ё Оллоҳ! Агар менга ғалаба берсанг,
          уйга қайтганимда нима биринчи бўлиб дарвозамдан чиқса, Сенга назр
          қилиб, оловда куйдираман», деб қасам ичди.
        </p>

        <p>
          Ўша куни Худо Ёффайни қўллади. У душманларга қаттиқ зарба бериб,
          Ароердан Миннитгача, то Абил Карамимгача уларни тор­мор қилди. Ҳаммаси
          бўлиб йигирмата шаҳар унинг қўлига ўтди. Ғалаба билан Мисфага ­уйига
          яқинлашар экан, не ҳолки, отамни ғалаба билан табриклайман, деб
          тамбурин чалиб, рақсга тушиб ... қизи дарвозадан чиқади. Ёффайнинг ана
          шу қизидан бошқа фарзанди йўқ эди.
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble1'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble1')}
          >
            <p>
              <sup>1</sup> Аслида шариат бўйича, агар бўйнингизга олган назр
              олсангиз ва унинг ҳаром амал эканини билиб қолсангиз, уни
              бажармаслигингиз лозим, аксинча ўрнига каффора берасиз. Бажарсангиз
              икки марта гуноҳкор бўласиз, аввало хато назрни ният қилганингиз
              учун, кейин эса, ҳаром қилинган амални бажарганингиз учун.
            </p>
          </div>
        )}

        <p
          className="cursor-pointer"
          onClick={() => toggleBubble('bubble1')}
        >
          Буни кўриб Ёффайнинг қалбидан оҳ деган нола чиқди. Мусибатдан
          кўйлагини йиртиб: «Эҳ қизгинам, нима қилиб қўйдинг?! Бошимга не
          кўргулик солдинг! – деб фарёд қилди. – Мен Оллоҳга қасам ичувдим, энди
          қасамимни қандай бузаман?!»<sup>1</sup>
        </p>

        <p></p>
      </div>

      <div className="main_text">
        <p>
          «Отажон, – деди қизи отасига, – Оллоҳнинг олдида қасам ичган
          бўлсангиз, қасамингизни бажаринг. Оллоҳ душманларингиздан қасос олишга
          ёрдам берди­ку! Менга фақат икки ой муҳлат берсангиз бас, дугоналарим
          билан тоққа чиқиб, бокиралигимга мотам тутиб келаман».
        </p>

        <p>
          Шу билан Ёффайнинг қизи дугоналари билан тоғларга чиқиб, икки ой
          бокиралигига мотам тутди. Икки ойдан сўнг, уйга қайтгач, отаси ичган
          қасамини адо этди.
        </p>

        <p></p>
      </div>

      <div className="main_text">
        <p>
          Шу-­шу Исроилнинг қизлари ҳар йили тўрт кун Ёффайнинг қизи учун йиғлаб
          мотам тутишни ўзларига одат қилганлар.
        </p>

        <p></p>
      </div>
    </main>
  );
}