'use client';

import '../../../qisas-uzb/stories.css';
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function KainAbel() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble1',
    'bubble2',
  ]);

  return (
    <div className="stories relative">
      <div className="separate_into_two_columns">
        <main className="sep_part1">
          <div className="main_text">
            <p className="boldItalic">
              «Уларга Одамнинг икки ўғли ҳақидаги хабарни ҳаққирост тиловат
              қилинг. У иккови қурбонлик қилганида биридан қабул бўлиб, биридан
              қабул бўлмади. Шунда у «Қасамки, сени ўлдирурман», деганида,
              биродари айтди: «Оллоҳ фақат тақводорлардангина қурбонлик қабул
              қилар»
              <span className="vitalic"> (Моида сураси 5:27). </span>
            </p>
          </div>

          <div className="main_text">
            <p>
              Одам алайҳис-салом билан Ҳавво (р.а.) кейин фарзандлар кўришади.
              Биринчи ўғилга Қобил деб, иккинчи ўғилга Ҳобил деб от қўйишади.
              Йиллар ўтиб улар улғайди. Ҳобил чўпон бўлди, Қобил — деҳқон.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble1'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble1')}
              >
                <p>
                  <sup>1</sup> Табарийнинг “Тарих” китобига қаранг.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble1')}
            >
              Бир куни Қобил ердан олган ҳосилининг бир қисмини олиб келиб,
              Оллоҳга назр қилди. Ҳобил эса сурувидаги сара
              <sup>1</sup> қўчқорларидан сўйиб, энг яхши қисмини қурбон қилди.
              Шунда Яратганга Ҳобил ва унинг қурбонлиги манзур бўлди.
            </p>

            <p>
              Қобил ва унинг ҳадяси эса маъқул бўлмади. Қобил бундан қаттиқ
              аччиқланиб, қовоғини осди.
            </p>

            <p>
              «Нега хафа бўласан? — деб сўради Худо. — Нега қовоқ осиб юрибсан?
              Билиб қўй, тўғри қилинган амал қабул бўлади, бироқ агар амалинг
              нотўғри бўлса, гуноҳ сени аллақачон бўсағада пойлаб ётган. Эҳтиёт
              бўлмасанг, сени эгаллаб олади! Аслида, сен унинг устидан ҳоким
              бўлишинг керак!» деди.
            </p>

            <p className="vitalic">
              Кўряпсизми, Қобил қурбонлиги қабул бўлмаганидан кейин ғазабланди.
              Худонинг ишидан норози бўлди. Бу эса гуноҳ. Гуноҳга йўл берсангиз,
              у сизни ҳам ўзига қул қилади. Аслида эса биз гуноҳнинг устидан
              ҳоким бўлишимиз керак.
            </p>
          </div>

          <div className="paragraph_heading">
            <p>ГУНОҲНИНГ ҚУДРАТИ</p>
          </div>

          <div className="main_text">
            {openBubbles['bubble2'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble2')}
              >
                <p>
                  <sup>2</sup> Кейинги оятда Оллоҳ таолонинг бир қарға юборгани
                  ва ўликни қандай кўмиш кераклигини кўрсатгани ёзилган. Бу ер
                  юзидаги биринчи ўлик эди.
                </p>
              </div>
            )}

            <p
              className="boldItalic cursor-pointer "
              onClick={() => toggleBubble('bubble2')}
            >
              «Бас, нафси унга ўз биродарини ўлдиришни чиройли кўрсатиб Қобил
              уни ўлдирди ва зиён кўргувчилардан бўлиб қолди»
              <span className="vitalic"> (Моида сураси 5:30).</span>
              <sup>2</sup>
            </p>
          </div>

          <div className="main_text">
            <p>
              <span className="vitalic">
                Қобил Оллоҳ таолонинг сўзларини ўзлаштира олмади. У Худога итоат
                қилиш ўрнига,
              </span>{' '}
              укаси Ҳобилни даштга олиб бориб ўлдирди. Кейин Худо Қобилдан:
              «Уканг Ҳобил қани?» деб сўради. «Билмайман. Нима, мен укамга
              қоровулманми?» деб жавоб берди Қобил.
            </p>

            <p>
              «Нима қилиб қўйдинг?! — деди Оллоҳ. — Уканг қони тупроқдан Менга
              фарёд қиляпти! Энди ер сени қарғайди. Қанча ишлов берсанг ҳам,
              сенга ҳосил бермайди. Бутун умр ватанингдан узоқда,
              сарсон-саргардон бўлиб яшайсан!» деди.
            </p>

            <p className="vitalic">
              Савол: Қобил нега Ҳобилни ўлдирди? Нима учун одамлар кўп ҳолатда
              гуноҳ ишлардан ўзларини тўхтата олмайди? Нима деб ўйлайсиз?
              Нахотки гуноҳда инсонни қул қилишга қодир бир куч мавжуд бўлса?!
            </p>

            <p className="boldItalic">
              «Биз Бани Исроилга: «Ким бир жонни ноҳақдан ёки ер юзида фасод
              қилмаган тақдирда ҳам ўлдирса, худди ҳамма одамларни ўлдиргандек
              бўлади. Ким уни тирилтирса, худди ҳамма одамларни тирилтиргандек
              бўлади», деб ёздик. Батаҳқиқ, пайғамбарларимиз уларга баёнотлар
              олиб келдилар. Сўнгра, бундан кейин ҳам, улардан кўплари ер юзида
              исроф қилгувчилардан бўлдилар»
              <span className="vitalic"> (Моида сураси 5:32).</span>
            </p>
          </div>
        </main>
      </div>
    </div>
  );
}