'use client';

 
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function Musa() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble1',
    'bubble2',
    'bubble3',
    'bubble4',
  ]);

  return (
    <div className="stories relative">
      <div className="separate_into_two_columns">
        <main className="sep_part1">
          <div className="main_text">
            <p className="boldItalic">
              «Батаҳқиқ, Биз Мусо ва Ҳорун­га неъмат бердик. Ик­ков­ларига ва
              қавмларига катта ғамдан нажот бердик. Ва уларга нусрат бердик, бас,
              улар ғолиб бўлдилар. Ва Биз ик­ков­ларига равшану комил баён­­ли
              китобни бердик. Ва икков­ла­рини сиротул мус­та­қийм­га ҳидоят
              қилдик» (Вас-Соффот 37:114-118).
            </p>
          </div>

          <div className="paragraph_heading">
            <p>Янги фиръавннинг тахтга ўтириши</p>
          </div>

          <div className="main_text">
            <p>
              Юсуф пайғамбар вафот этганларидан сўнг, орадан уч юз йигирма йилча
              вақт ўтди. Бу давр ичида Яъқуб (а.с.) нинг фарзандлари суръат билан
              кўпайиб катта бир халққа айландилар.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble1'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble1')}
              >
                <p>
                  <sup>1</sup> Ушбу фиръавн, аввалги фиръавнлардан фарқли ўлароқ,
                  ни­ҳо­ятда жоҳил, золим ва Бани Исроилга нисбатан адовати кучли
                  эди. Инсон бўлса ҳам, ўзини худо деб эълон қилган. Нозиот
                  сурасида ёзилишича у: «Мен сизларнинг олий Раб­бин­гизман», деб
                  даво қилган (79:24).
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble1')}
            >
              Кейин Миср тахтига янги подшоҳ келди. У Юсуф (а.с.) ни билмас, унинг
              Миср учун қилган хизматларини тан олмас эди.
              <sup>1</sup>
            </p>
          </div>

          <div className="main_text">
    

            <p>
              У ўз халқига: «Юртимизда Бани Исроил кундан-кунга кўпайиб кетмоқда.
              Агар бирон чорасини кўрмасак, ҳаддан ортиқ кучайиб кетади. Мабодо
              уруш бошланса, душман тарафига ўтиб бизга қарши жанг қилишлари ёки
              юртимиздан кетиб қолишлари мумкин», деди.
            </p>

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble2')}
            >
              Шундан сўнг мисрликлар Бани Исроилни оғир ишлар билан қийнай
              бошладилар. Шу мақсадда устларидан назоратчилар қўйдилар. Мисрдаги
              Фитум ва Раъмасис деган омбор-шаҳарлар ана шундай оғир кунларда
              барпо этилган.
              <sup>2</sup>
            </p>
          </div>

          <div className="main_text">
                    {openBubbles['bubble2'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble2')}
              >
                <p>
                  <sup>2</sup> Фиръавн ҳам, Миср бойлари ҳам текин хизматкорлардан
                  айрилиб қолишни истамас эдилар.
                </p>
              </div>
            )}
            <p className="vitalic">
              Қул бўлиш нима эканини тасаввур қиласизми? Биринчидан, эртаю кеч
              меҳнатдан қўлингиз бўшамайди. Иккинчидан, хоҳлаган нарсангизни еб,
              хоҳлаган нарсангизни кия олмайсиз. Қулдорнинг мулки ҳисобланасиз.
              Учинчидан, қулдор қачон хоҳласа сизни калтаклаши мумкин. Энг ёмони,
              ҳаётингиз ўзгаришига, яхшиланишига умид йўқ. Оёқ-қўлингиз
              кишанланган, ўзингизни ўзингиз озод қилолмайсиз! Хўш, озодликка
              қандай чиқиш мумкин?
            </p>

            <p className="vitalic">
              Бир йўли, хўжайинингиз рухсат берса, яъни қўйиб юборса. Лекин бу —
              камдан-кам учрайдиган ҳолат.
            </p>

            <p className="vitalic">
              Иккинчи йўли, агар бадавлат қариндошларингиз бор бўлса, улар пул
              тўлаб сизни сотиб олишлари мумкин.
            </p>

            <p className="vitalic">
              Биласизми, гуноҳ ҳам кишанга ўхшайди. Гуноҳ кишанига тушган одам
              уни узиб ташлашга кучи етмайди. Бирорта ёмон ишни “қилмайман”
              десангиз ҳам, кучингиз етмаган ва қайта-қайта қилиб қўйган ҳолларингиз
              бўлганми? Нажотни қаердан кутасиз? Ота-онангизданми, ака-укаларданми?
              Оллоҳга дуо қилинг, Оллоҳдан нажот изланг, агар чин юракдан
              тиласангиз Оллоҳ албатта сизга ёрдам беради.
            </p>

            <p>
              Аммо мисрликларнинг тобора ошиб бораётган зуғумига қарамай, Бани
              Исроил кундан-кунга кўпаяверди. Бундан ташвишланган мисрликлар
              уларни яна ҳам кўпроқ қийнай бошладилар.
            </p>
          </div>

          <div className="paragraph_heading">
            <p>ДОЯЛАРГА БЕРИЛГАН БУЙРУҚ</p>
          </div>

          <div className="main_text">
            <p>
              Кейин фиръавн доя хотинларни чақириб: «Ибронийлар туғаётган вақтда
              қаранглар: агар чақалоқ қиз бўлса — қолсин, ўғил бўлса —
              ўлдиринглар», деб амр қилди. Лекин доялар Худодан қўрқар эди. Шунинг
              учун фиръавнга бўйсунмай, туғилаётган ўғил болаларни ўлдирмадилар.
            </p>

            <p>
              Бир муддатдан сўнг фиръавн уларни ўз ҳузурига чақиртирди: «Нега
              буйруғимга итоат этмадинглар? Нега ўғил болаларни тирик
              қолдиряпсизлар?!»
            </p>

            <p>
              «Ё аълоҳазрат! Айб бизда эмас. Иброний хотинлар мисрликларга ўхшаб
              заиф эмас. Улар доя етиб бормасдан олдин туғиб қўйяпти. Бизнинг
              қўлимиздан ҳеч нарса келмаяпти», деб жавоб беришди улар.
            </p>

            <p>
              Шу тартибда, Бани Исроил кундан-кунга кўпайиб, катта бир халққа
              айланди. Оллоҳ таоло доя хотинларга марҳамат қилиб фарзандлар ато
              этди. Чунки уларнинг қалбида Оллоҳдан қўрқув бор эди.
            </p>
          </div>

          <div className="paragraph_heading">
            <p>НАВБАТДАГИ ДАСТУР</p>
          </div>

          <div className="main_text">
            <p className="boldItalic">
              «Фиръавн аҳли сизни ёмон азобларга солиб, ўғилларингизни сўйиб,
              қизларингизни тирик қолдираётган эди...» (Бақара сураси, 49).
            </p>

            <p>
              Кейин фиръавн бутун Миср халқига: «Ибронийлардан туғилган ҳар бир
              ўғил чақалоқни Нил дарёсига ташланглар, қиз чақалоқларни тирик
              қолдиринглар», деб буйруқ берди.
            </p>

            <p className="vitalic">
              Тасаввур қилинг-а? Ўзингизни уларнинг ўрнига бир қўйиб кўринг-а.
              Додлаётган оналарни кўз олдингизга келтиринг. Қўлидан ҳеч нарса
              келмаётган оталарни тушунишга ҳаракат қилинг. Тасаввур қила
              оласизми? Бир халқ томонидан бошқа бир халққа қарши қилинаётган
              улкан бир жиноят эди бу.
            </p>
          </div>

          <div className="paragraph_heading">
            <p>ОЛЛОҲ МУҲАББАТ СОЛГАН ПАЙҒАМБАР ТАВАЛЛУДИ</p>
          </div>

          <div className="main_text">
            <p className="boldItalic">
              «Уни тобутга сол, (тобутни) эса дарёга ташла. Дарё уни соҳилга
              отсин. Уни Менинг душманим ва унинг душмани олади», дедик. Ва сенга
              Ўзимдан муҳаббат солдим. Буни Менинг кўз олдимда етиштирилишинг учун
              қилдим» (Тоҳо сураси, 20:39).
            </p>

            <p>
              Ана шундай кунларнинг бирида, Лобий қабиласида бир ўғил туғилди.
              Чақалоқ жуда чиройли эди. Буни кўрган онаси уч ой уни яшириб юрди.
              Кейин, яшириш имкони қолмагач, қамиш сават олиб ҳамма ёғини қиру
              қатрон билан сувади ва ўғлини ичига солиб Нил дарёси четида,
              қамишзорда қолдирди. Чақалоқнинг опаси эса, укамга нима бўлар экан,
              деб узоқроқдан қараб турди.
            </p>

            <p>
              Бироздан сўнг фиръавннинг қизи ғусл олиш учун дарёга келди. Қараса,
              қамишлар ичида бир сават турибди. «Бор, анави саватни олиб кел»,
              деди канизларидан бирига. Сават қопқоғини очар экан, кўзи йиғлаб
              ётган чақалоққа тушди. «Иброний бола экан», деди ичи куйиб.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble3'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble3')}
              >
                <p>
                  <sup>3</sup> «(Эй Мусо,) ўшанда опанг келиб: «Сизларга бу болага
                  кафил бўладиган (аёлни) кўрсатайми», деганларини эсла!» (Тоҳо
                  сураси, 20:40а).
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble3')}
            >
              Шунда чақалоқнинг опаси югуриб келиб: «Болани эмизишга
              ибронийлардан биронта аёлни чақириб келайми?» деб сўради.
              <sup>3</sup>
            </p>

            <p>
              «Ҳа, — деди фиръавннинг қизи. — Чақир». Шунда қиз бориб онасини
              бошлаб келди. «Мана бу гўдакни ол, менга боқиб берасан, — деди
              фиръавннинг қизи. — Ҳақингни тўлайман».
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble4'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble4')}
              >
                <p>
                  <sup>4</sup> Қуръони каримда Оллоҳ таоло марҳамат қиладики:
                  «Сўнг Биз сени кўзлари қувонсин, ғамгин бўлмасин, деб онангнинг
                  олдига қайтардик». Тоҳо сураси, 20:40б.
                </p>
              </div>
            )}

            <p
              className="vitalic cursor-pointer "
              onClick={() => toggleBubble('bubble4')}
            >
              Шу тариқа, чақалоқ яна онасининг бағрига қайтди.
              <sup>4</sup>
            </p>
          </div>
        </main>
      </div>
    </div>
  );
}