'use client';

import '../../../qisas-uzb/stories.css';
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function WhoAmI() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble1',
    'bubble2',
    'bubble4',
    'bubble5',
    'bubble6',
    'bubble7',
    'bubble8',
    'bubble9',
    'bubble11',
    'bubble13',
    'bubble14',
    'bubble15',
    'bubble16',
  ]);

  return (
    <div className="stories relative">
      <div className="separate_into_two_columns">
        <main className="sep_part1">
           

          <div className="main_text">
            {openBubbles['bubble1'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble1')}
              >
                <p>
                  <sup>1</sup>{' '}
                  <span className="vitalic">
                    Қуръони каримда ёзилишича Фиръавннинг аёли ўз яқинларига:{' '}
                    <span className="boldItalic">
                      «(Бу бола) мен учун ҳам, сен учун ҳам кўз қувончидир. Уни
                      ўлдирманглар. Шоядки, у бизга фойда берса ёки уни бола
                      қилиб олсак»
                    </span>
                    , деган экан (Қасас сураси 28:9). У киши ўзининг кимлигини
                    билар эдилар. Эмизиб катта қилган онасидан эшитганми, ё унга
                    ёмонлик тилаб, фиръавн саройидан маҳрум қилишни истаган одамлар
                    айтганми, бизга номаълум. Маълум бўлган нарса шуки, у киши ўз
                    халқининг тарихини, Оллоҳ таолонинг аҳди ва ваъдаларини
                    билганлар.
                  </span>
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble1')}
            >
              Бола бир оз улғайгандан сўнг, онаси уни фиръавннинг қизига топширди.
              Фиръавннинг қизи уни ўзига ўғил қилиб олди. “Мен уни сувдан тортиб
              олдим”, деб исмини Мусо қўйди. Йиллар ўтди. Мусо (а.с.) вояга
              етдилар.
              <sup>1</sup>
            </p>
          </div>

          <div className="paragraph_heading">
            <p>МИСРДАН ҚОЧИШ</p>
          </div>

          <div className="main_text">
            <p>
              Кунлардан бир кун, ҳазрати Мусо ўз халқини кўриш учун борган пайтида,
              бир мисрликнинг бир ибронийни калтаклаётганини кўриб қолдилар.
              Ён-атрофга қараб ҳеч кимни кўрмадилар ва ҳалиги мисрликни ўлдириб,
              жасадини қумга яширдилар.
            </p>

            <p>
              Эртаси куни у киши яна ўз халқининг олдига бордилар. Бу сафар икки
              иброний бир-бири билан жанжаллашар эди.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble2'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble2')}
              >
                <p>
                  <sup>2</sup> «(Кунларнинг бирида Мусо) шаҳарга унинг аҳолиси
                  ғафлатда бўлган пайтда кирган эди, икки киши урушаётганини кўрди.
                  Бири ўзининг жамоатидан ва бири душманидан эди. ... Мусо мушт
                  уриб уни ўлдириб қўйди. (Сўнг пушаймон бўлиб) деди: «Бу
                  шайтоннинг ишидан. Албатта у йўлдан ургувчи очиқ душмандир»
                  (Қасас сураси).
                </p>

                <p className="MarginTop10px">
                  <sup>3</sup> Қасас сураси 19-оят.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble2')}
            >
              «Уни нега уряпсан? — деб сўрадилар ҳазрати Мусо. — Ахир биз
              бир-биримизга биродармиз-ку!»
              <sup>2</sup>
            </p>
          </div>

          <div className="main_text">
            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble2')}
            >
              «Сенинг нима ишинг бор? Ё{' '}
              <span className="boldItalic">
                “кеча бировни ўлдиргандек мени ҳам ўлдирмоқчимисан?”
              </span>
              » деб жавоб берди у.
              <sup>3</sup> Шунда ҳазрати Мусо, мисрликни ўлдирганим ҳаммага маълум
              бўпти, деб қўрқиб кетдилар.
            </p>

            <p className="vitalic">
              Ҳақиқатан ҳам, бу воқеа ҳамма ёққа овоза бўлган эди. Қуръони каримда
              айтилиши­ча:{' '}
              <span className="boldItalic">
                «...шаҳарнинг нариги четидан бир киши шошиб келиб: «Эй Мусо,
                аниқки, аъёнлар сени ўлдириш учун тил бириктирмоқдалар. Бас, чиқиб
                кет! Албатта, мен сенга насиҳат қил­гув­чи­лар­дан­ман», деди. Бас,
                хавфсираб, аланглаган ҳолда у ер­дан: «Эй Раббим, менга золим
                қавмлардан нажот бергин», деб чиқди»
              </span>{' '}
              (28:20-21).
            </p>

            <p>
              Фиръавн, бўлган воқеадан хабар топгач, одамларига: “Мусони қатл
              қилинглар”, деб фармон беради. Мусо (а.с.) Мадян юртига қочиб
              кетадилар.
            </p>
          </div>

          <div className="paragraph_heading">
            <p>ҲАНИФ АРАБЛАР ҚАБИЛАСИДА</p>
          </div>

          <div className="main_text">
            {openBubbles['bubble4'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble4')}
              >
                <p>
                  <sup>4</sup> Мадян руҳонийсининг исми ҳа­қи­да ихтилоф бор. Ҳасан
                  ал-Басрий ва Молик ибн Анас у кишининг исмини Шуайб де­ган­лар.
                  Ибн Аббос (р.а.) ва Абу Убайда (р.а.) лар «Ятрун» деб айтганлар.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble4')}
            >
              Ўша пайтда Мадянда Шуайб исмли бир руҳоний яшарди. У кишининг еттита
              қизи бўлган. Қизлари ҳар куни отасининг қўйларини суғориш учун қудуқ
              бошига ҳайдаб келишар, қўйларни энди суғормоқчи бўлганларида бошқа
              чўпонлар келиб, қудуқни эгаллаб олар эди.
              <sup>4</sup>
            </p>

            <p>
              Бу сафар ҳам қизлар қўйларни ҳайдаб қудуқ бошига келдилар. Айни шу
              пайтда ҳазрати Мусо Мисрдан келиб, қудуқ бўйида дам олиб ўтирган
              эдилар.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble5'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble5')}
              >
                <p>
                  <sup>5</sup> Қасас сурасининг 23-24 оятларини кўринг.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble5')}
            >
              Қизлар қудуқдан сув тортиб, охурларга қуяётганда яна чўпонлар келиб
              қолишди. «Ҳей, қани, қочинглар, — дейишди улар қизларга. — Олдин биз
              суғорамиз. Ол қўйингни нарёққа!» Шунда ҳазрати Мусо ўринларидан
              туриб, чўпонларни орқага сурдилар. Кейин қизларга қўйларни суғоришга
              ёрдам бердилар.
              <sup>5</sup>
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble6'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble6')}
              >
                <p>
                  <sup>6</sup> Табарий, “Тарих”, 1-жилд, 205-бет; Салабий,
                  “Ароис”, 174-бет; Ибн-и Асокир, “Тарих”, 6-жилд, 322-бет; Ибн-и
                  Асир, “Комил”, 1-жилд, 176-бет.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble6')}
            >
              Қизлар уйга келгач, Шуайб (а.с.) улардан: «Нима бўлди? Бугун нега
              тез қайтдинглар?» деб сўрадилар.
              <sup>6</sup>
            </p>

            <p>
              «Бир мисрлик бизга ёрдам берди. Чўпонлардан ҳимоя қилди. Кейин
              қудуқдан сув тортиб, қўйларимизни ҳам суғорди», дейишди улар.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble7'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble7')}
              >
                <p>
                  <sup>7</sup> «Сўнгра Мадян аҳли ила йилларга қолдинг» (Тоҳо,
                  20:40).
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble7')}
            >
              «Қани у? Нега уйга чақирмадингиз? Боринг, айтиб келинг, бизникида
              меҳмон бўлсин», дедилар Шуайб (а.с.). Шу билан, ҳазрати Мусо шу
              хонадонда яшай бошладилар.
              <sup>7</sup>
            </p>

            <p>
              Кейин Шуайб (а.с.) у кишига ўзининг Сафира деган қизини никоҳлаб
              берди. Вақт-соати келиб Сафира Биби Мусо (а.с.) га ўғил туғиб берди.
              “Бегона юртда ғариб бўлдим”, деб ҳазрати Мусо ўғлига Гаршун, яъни
              “ғариб” деб от қўйган эканлар.
            </p>
          </div>

          <div className="paragraph_heading">
            <p>Оллоҳ БАНИ ИСРОИЛНИ ҚУТҚАРМОҚЧИ</p>
          </div>

          <div className="main_text">
            <p>
              Орадан кўп йил ўтди. Миср подшоҳи ҳам оламдан кўз юмди. Бироқ Бани
              Исроил ҳамон қулликда азоб чекар эди. Ниҳоят улар Оллоҳга оҳу нола
              қила бошладилар. Шунда Оллоҳ уларни озод қилишга қарор қилди, чунки
              У раҳмон ва раҳимдур. У мозийда Иброҳим, Исҳоқ ва Яъқуб пайғамбарлар
              билан аҳд қилган эди.
            </p>

            <p className="vitalic">
              Агар эсингизда бўлса, Оллоҳ таоло уларга учта нарсани ваъда қилган:
            </p>

          </div>
          <div className='border rounded-md border-green-600 p-1'>

            <p className="vitalic px-4">
              ~биринчидан, У Иброҳим пайғамбарга сенинг авлодларинг кўп бўлади, деб
              ваъда берган эди. Дарҳақиқат, Исроил халқи охирги 400 йил ичида
              етмиштадан бир неча миллион одамга кўпайди.
            </p>

            <p className="vitalic px-4">
              ~Иккинчи ваъда ер ҳақида эди: Оллоҳ субҳанаҳу ва таоло:
              “Авлодларинг тўрт юз йил бегона элда келгинди бўлиб яшайди. Қулликда
              жабр-зулм кўради. Кейин Мен уларни у юртдан олиб чиқаман ... Мана шу
              ерни сенинг авлодларингга мерос қилиб бераман”, деган эди.
            </p>

            <p className="vitalic px-4">
              ~Учинчи ваъда — Иброҳим (а.с.) нинг зуррияти орқали ер юзидаги ҳамма
              халқлар баракага эришиши ҳақида эди. Оллоҳ азза ва жалл: «Менга
              итоат этганинг учун ер юзидаги ҳамма миллатларга Мен сенинг
              зурриятинг орқали барака бераман», деб ваъда берган эди.
            </p>
          </div>

          <div>

            <p className="vitalic">
              Кўриб турибсизки, биринчи ваъда Мусо пайғамбар даврига келиб амалга
              ошди. Яъқуб пайғамбарнинг насли катта бир миллатга айланди. Энди эса
              Оллоҳ таоло Ўзининг иккинчи ваъдасини амалга оширмоқчи эди.
            </p>
          </div>

          <div className="paragraph_heading">
            <p>ЁНАЁТГАН БУТА</p>
          </div>

          <div className="main_text">
            <p className="boldItalic">
              «Бас, қачонки у (олов яқинига) келгач: «Эй Мусо», деган нидо
              эшитилди. «Мен сенинг раббингман. Энди кавушларингни еч...»{' '}
              <span className="vitalic">(Тоҳо сураси, 11-12).</span>
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble8'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble8')}
              >
                <p>
                  <sup>8</sup> Сино тоғига.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble8')}
            >
              Мусо (а.с.) қайнотасининг қўйларини боқар эди. Бир куни у сурувни
              чўлнинг нариги томонига, Туводаги тоққа
              <sup>8</sup> қараб ҳайдадилар. Шунда Оллоҳ жалла жалолаҳу ўша ерда у
              кишига олов зоҳир қилди.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble9'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble9')}
              >
                <p>
                  <sup>9</sup> Абулфарад ибн-и Жавзий. “Табсира”, 1-жилд, 219-220
                  бетлар.
                </p>

                <p className="MarginTop10px">
                  <sup>10</sup> Қуръони карим, 20:10.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble9')}
            >
              Ҳазрати Мусо кўрдиларки, бир бута ёняпти, лекин ёниб адо бўлмаяпти!
              «Во ажабо, нима учун бу бута ёнади, лекин адо бўлмайди?» деб ҳайрон
              бўлдилар
              <sup>9</sup> ва{' '}
              <span className="boldItalic">
                «аҳлига: “Кутиб туринглар, мен олов кўрдим, шояд ундан чўғ
                келтирсам ёки олов бошида ҳидоят топсам”, деб»
              </span>{' '}
              бутага яқинлашдилар.
              <sup>10</sup>
            </p>

            <p>
              Шунда оловдан: «Мусо! Мусо!» деган овоз келди. «Лаббай!» дедилар
              Мусо (а.с.).
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble11'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble11')}
              >
                <p>
                  <sup>11</sup> Қуръони каримда ҳам “сенинг (Яъқубнинг) илоҳинг,
                  Иброҳимнинг илоҳи, Исмоил ва Исҳоқнинг илоҳи”, деган ибора бор
                  (Бақара 133). Тавротда бу ибора Оллоҳ таолонинг ушбу
                  пайғамбарлар билан қилган аҳдини таъ­кид­ла­моқда.
                </p>

                <p className="MarginTop10px">
                  <sup>12</sup> Оллоҳ (с.в.т.) қиёматда ҳам ерни Ўз Нури билан
                  ёритади: «Ва ер Рабби нури ила ёришди. Китоб қўйилди.
                  Пайғамбарлар ва гувоҳлар келтирилди...» (Зумар 39:69).
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble11')}
            >
              «Тўхта, бошқа яқинлаша кўрма! Чориқларингни еч, чунки сен муқаддас
              жойдасан. Мен аждодинг Иброҳим, Исҳоқ ва Яъқубнинг илоҳиман», деди
              садо.
              <sup>11</sup>
            </p>

            <p>
              Мусо алайҳис-салом Оллоҳнинг нурига қарашдан қўрқиб юзларини беркитдилар.
              <sup>12</sup>
            </p>

            <p>
              «Менинг халқим азоб-уқубатда. Назоратчилар дастидан фарёд чекмоқда.
              Мен Раҳмонман. Халқимни мисрликлар чангалидан қутқариш вақти келди,
              — деди Оллоҳ таоло. — Мен сизларни Канъонга — сут ва асал ўлкасига
              олиб бораман. Тайёрлан. Сени Мисрга, фиръавннинг олдига юбораман.
              Менинг халқимни, Бани Исроилни сен Мисрдан олиб чиқасан».
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble13'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble13')}
              >
                <p>
                  <sup>13</sup> Табарий, “Тарих”, 1-жилд, 206-бет; Ибн-и Асир,
                  “Комил”, 1-жилд, 178-бет.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble13')}
            >
              Оллоҳ таоло раҳмдил ва раҳмондир. Бани Исроилнинг қулликда азоб
              чекаётганини кўриб Оллоҳнинг раҳми келган эди.
              <sup>13</sup>
            </p>
          </div>

          <div className="paragraph_heading">
            <p>
              «Сен фиръавнга бор, чунки у туғёнга кетди»
              <sup>14</sup>
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble14'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble14')}
              >
                <p>
                  <sup>14</sup> Қуръони карим, Тоҳо сураси, 20:24.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble14')}
            >
              «Мен кимманки, фиръавннинг олдига борсам?! — деди ҳазрати Мусо. —
              Мен қандай қилиб Бани Исроилни Мисрдан олиб чиқаман?»
            </p>

            <p>
              «Мен сен билан бирга бўламан, сени қўллайман. — деди Худо. — Сизлар
              Мисрдан чиқиб, мана шу ерга келасизлар. Мана шу тоғда Менга ибодат
              қиласизлар. Сени Мен юборганимнинг далили шу».
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble15'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble15')}
              >
                <p>
                  <sup>15</sup> Исроил халқи анча йилдан бери Мисрда қулликда яшар,
                  шу сабабдан оламлар рабби — Оллоҳ ҳақида тушунчаси оз эди.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble15')}
            >
              Шунда Мусо (а.с.) яна савол бериб дедилар: «Агар Бани Исроил:
              “Бизнинг Худомиз ким? У нима қила олади?” деб сўраса, нима дейман?»
              <sup>15</sup>
            </p>

            <p>
              Оллоҳ таоло деди: «Мен ал-Қайюмман. Менинг бу исмим насллар-аро зикр
              қилинур. Мисрга бор, оқсоқолларни йиғ. Уларга: “Оталаримиз
              Иброҳимнинг, Исҳоқнинг ва Яъқубнинг илоҳи ал-Қайюм менга зоҳир
              бўлди”, де.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble16'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble16')}
              >
                <p>
                  <sup>16</sup> Қуръони каримда: «Яхшилик қилганга (неъмат) батамом
                  бўлиши учун, ҳар бир нарса батафсил бўлиши учун, ҳидоят ва раҳмат
                  бўлиши учун Биз Мусога Китоб ато этдик, токи (Бани Исроил)
                  Раббилари билан учрашмоққа иймон келтирсалар», деган оят бор
                  (Анъом сураси 154).
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble16')}
            >
              “Мисрдаги аҳволингизни кузатиб турибман. Берган ваъдамга кўра, Мен
              сизларни бу азоб уйидан олиб чиқиб, сут ва асал ўлкасига олиб
              бораман, деб айтди”, де. Улар гапингни қабул қилади. Кейин
              фиръавннинг олдига бориб: “Оллоҳ биз билан учрашмоқчи. Уч кунлик йўл
              юриб чўлга чиқишимизни, ўша ерда Унга атаб қурбонлик қилишимизни
              буюрди”, деб айтасизлар.
              <sup>16</sup>
            </p>

            <p>
              Лекин фиръавн кетишингизга рухсат бермайди. Кейин Мен Ўз қудратимни
              ва мўъжизаларимни намойиш қиламан, мисрликлар устига офатлар
              ёғдираман. Ўшанда у сизларни қўйиб юборишга мажбур бўлади», деди.
            </p>
          </div>
        </main>
      </div>
    </div>
  );
}