'use client';

 
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function ShariahRevealed() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble1',
    'bubble2',
    'bubble4',
    'bubble5',
  ]);

  return (
    <div className="stories relative">
      <div className="separate_into_two_columns">
        <main className="sep_part1">
           

          <div className="main_text">
            <p className="boldItalic">
              «Албатта, Оллоҳ адолатга, эҳсонга, қариндошларга яхшилик қилишга амр
              этадир ва фаҳшу мункар ҳамда зулмкорликдан қайтарадир. У сизларга ваъз
              қилур. Шоядки, эсласангиз. Агар аҳдлашсангиз Оллоҳнинг аҳдига вафо
              қилинг. Қасамларни таъкид қилинганидан сўнг бузманг. Батаҳқиқ, Оллоҳни
              ўзингизга кафил қилгансиз-а! Албатта, Оллоҳ нима қилаётганингизни
              билур» <span className='vitalic'>(Наҳл сураси 90-91).</span>
            </p>
          </div>

          <div className="paragraph_heading">
            <p>Иброҳимнинг аҳдига даъват</p>
          </div>

          <div className="main_text">
            <p>
              Мисрдан чиққанларига икки ой тўлгач Бани Исроил Оллоҳ таолонинг
              раҳнамолиги остида Сино чўлига, Туво дарасидаги тоққа келиб тоғ
              этагида қароргоҳ қурди.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble1'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble1')}
              >
                <p>
                  <sup>1</sup> Моида сурасининг 20-оятида Мусо (а.с.) нинг ўз
                  қавмига: «Эй қавмим, Оллоҳнинг сизга берган неъматларини эсланг.
                  Ахир, У сизларни пайғамбарлар этди, подшоҳлар қилди, оламларда
                  бирортага бермаган нарсаларни берди!» деб айтган сўзлари ёзилган.
                </p>
              </div>
            )}

            <p
              onClick={() => toggleBubble('bubble1')}
              className="cursor-pointer "
            >
              Мусо (а.с.) Оллоҳдан ҳидоят олиш учун тоққа чиқдилар. Шунда у кишига:
              «Мана, Мен сизларни Мисрдан, қуллик уйидан соғ-саломат олиб чиқдим.
              Энди сизлар Меникисиз, — деган садо келди. — Агар гапларимга қулоқ
              солсангиз, Иброҳим билан қилган аҳдимга содиқ бўлсангиз, бутун халқлар
              ичида Менинг бебаҳо хазинам бўласизлар. Ҳа, бутун ер юзи Меники. Лекин
              сизлар Менинг муқаддас салтанатим бўласиз, ҳамма халқларга илм ва
              ҳидоят улашасиз.<sup>1</sup> Бор, Мен айтган гапларни одамларга етказ».
            </p>

            <p className="vitalic">
              Оллоҳ таоло Иброҳим (а.с.) билан аҳд тузган вақтда: «Авлодларинг тўрт
              юз йил бегона юртда келгинди бўлиб умр суради, кейин Мен уларни у
              юртдан олиб чиқаман», деб ваъда берган эди. Мана энди, орадан неча
              асрлар ўтиб, бу ваъда амалга ошди. Бани Исроил Аҳд ворисларига
              айланиб, Китоб Аҳли бўлиб, дунёдаги ҳамма халқларни Оллоҳнинг нурига
              ҳидоят қилиши керак эди.
            </p>

            <p>
              Кейин Мусо алайҳис-салом тоғдан тушиб, оқсоқолларни чақиртирдилар ва
              Оллоҳнинг даъватини баён этдилар. Ҳаммалари бир оғиздан, Оллоҳнинг ҳар
              бир айтганини қиламиз, деб ваъда берди.
            </p>

            <p className="vitalic">
              Яъни, шу тариқа Бани Исроил Оллоҳ субҳанаҳу ва таолонинг Иброҳим
              (а.с.) билан тузган дўстлик аҳдига иймон келтирамиз, деб ваъда беради.
            </p>
          </div>

          <div className="paragraph_heading">
            <p>«Учрашувга тайёрланинглар»</p>
          </div>

          <div className="main_text">
            <p>
              Кейин Оллоҳ Мусо (а.с.) га: «Халқ бугун-эрта ўзларини покласин,
              кийимларини ювиб, учинчи кунга тайёрлансин. Мен учинчи кун ҳамманинг
              кўз олдида, Сино тоғида, мўъжизаларимни намойиш қиламан, — деди. —
              Тоғнинг атрофини чегарала. Ҳаммага тайинла: биронта инсон тоққа
              яқинлашмасин. Кимки тоққа қадам қўйса, тошбўрон қилиб ё ўқ отиб
              ўлдиринглар. Унга инсон қўли тегмасин. Хоҳ ҳайвон бўлсин, хоҳ инсон,
              яшашига изн берманглар. Фақат бурғу садоси давомдор янграгандан сўнг
              одамлар тоққа чиқади», деди.
            </p>

            <p>
              Расулуллоҳ тоғдан тушиб халққа: «Кийимларингизни ювинг, тозаланинг.
              Ҳеч ким хотинига яқинлашмасин. Учинчи кунга тайёрланинг!» дедилар.
            </p>

            <p>
              Учинчи кун эрталаб тоғда чақмоқ чақиб, момақалдироқ янгради. Тоғнинг
              устида қуюқ булут турар, ҳамма ёқдан ҳаддан ташқари кучли карнай овози
              эшитилаётган эди. Қароргоҳдаги одамларнинг ҳаммаси қўрқувдан титради.
            </p>

            <p>
              Мусо (а.с.) халқни қароргоҳдан олиб чиқиб, Оллоҳ билан учраштириш учун
              тоғ этагига олиб келдилар. Шунда тоғ қаттиқ ларзага келди. Оллоҳ таоло
              тоғни олов билан қоплаган, тоғдан қуюқ тутун чиқиб осмонга ўрлар,
              карнай товушлари эса борган сари кучаяётган эди.
            </p>
          </div>

          <div className="paragraph_heading">
            <p>ОллоҳНИНГ ЛИҚОСИ</p>
          </div>

          <div className="main_text">
            {openBubbles['bubble2'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble2')}
              >
                <p>
                  <sup>2</sup> Анъом сураси, 154-оят. Оятнинг тўлиқ кўриниши
                  қуйидагича: «Яхшилик қилганга (неъмат) батамом бўлиши учун, ҳар
                  бир нарса батафсил бўлиши учун, ҳидоят ва раҳмат бўлиши учун Биз
                  Мусога Китоб ато этдик, токи (Бани Исроил) Раббилари билан
                  учрашмоққа иймон келтирсалар».
                </p>
                <p className="MarginTop10px">
                  <sup>3</sup> Оллоҳ таолонинг сўзларини халқ пастда эшитиб турган
                  эди. Шу тариқа улар Мусо пайғамбарнинг Оллоҳ тарафидан қўйилган
                  раҳбар эканлигига яна бир карра амин бўлдилар.
                </p>
              </div>
            )}

            <p
              onClick={() => toggleBubble('bubble2')}
              className="boldItalic cursor-pointer "
            >
              «Биз Мусога Китоб ато этдик, токи (Бани Исроил) Раббилари билан
              учрашмоққа иймон келтирсалар».<sup>2</sup>
            </p>
          </div>

          <div className="main_text">
            <p>
              Шунда Оллоҳ (а.ж.) Мусо (а.с.) га Бани Исроил учун<sup>3</sup> мана бу
              сўзларни айтади:
            </p>

            <p>
              «Мен ал-Қайюмман, сизларни Мисрдан, қуллик уйидан олиб чиққан
              Парвардигорингизман. Мендан бошқа худоларга сиғинманг. На осмондаги,
              на ердаги ва на сувлардаги ҳеч бир нарсага қараб ўзларингиз учун бут
              ясаманг. Уларга сажда ё ибодат қилманг. Чунки Мен рашк Худосиман,
              Мени ёмон кўрганларнинг гуноҳи — учинчи ё тўртинчи авлодгача
              фарзандларингизга асар этади, лекин Мени севганлардан, амрларимга
              итоат этганлардан ҳеч қачон меҳримни аямайман.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble4'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble4')}
              >
                <p>
                  <sup>4</sup> “Менинг исмимни бежо тилга олманг”. Асл матнни
                  сўзма-сўз таржима қилсак: “Менинг исмимни бекорга ёки ёлғондан
                  кўтарма”, деган маънони беради. Оллоҳ таоло муқаддас бўлгани учун
                  Унинг исми ҳам муқаддас. Шу сабабдан биз Унинг исмини ҳамиша ҳурмат
                  билан тилга олишимиз лозим. “Енгил” (пуч) гаплар учун ёки ёлғон
                  гаплар учун Оллоҳнинг исмини ишлатманг. Ундан ўз манфаатингиз
                  йўлида фойдаланманг. Ҳатто «Худога шукур!» ни ҳам шукур қилмай
                  айтсангиз, гуноҳкор бўласиз.
                </p>
              </div>
            )}

            <p
              onClick={() => toggleBubble('bubble4')}
              className="cursor-pointer "
            >
              Менинг исмимни бежо тилга олманг.<sup>4</sup> Мен сизларнинг
              Раббингизман. Исмимни бежо ишлатган одам жазосиз қолмайди.
            </p>

            <p>Дам олиш кунининг қудсиятини сақланг.</p>
            <p>Ота-онангни ҳурмат қил, токи Мен сенга берадиган юртда умринг узоқ бўлсин.</p>
            <p>Қотиллик қилма.</p>
            <p>Никоҳга хиёнат қилма.</p>
            <p>Бировнинг мол-мулкига ноҳақ қўл узатма.</p>
            <p>Ёлғон шаҳодат берма.</p>
            <p>
              Бошқаларнинг уйига, хотинига, қулу чўрисига, ҳўкизи ва эшагига, хуллас
              ҳеч бир нарсасига кўз тикма».
            </p>
          </div>

          <div className="paragraph_heading">
            <p>БАНИ ИСРОИЛ ОллоҳГА МУҚАРРАБ БЎЛИШНИ ИСТАМАДИ</p>
          </div>

          <div className="main_text">
            {openBubbles['bubble5'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble5')}
              >
                <p>
                  <sup>5</sup> Қуръони карим ояти: «Биз уларга (дин) иши ҳақида
                  очиқ-ойдин баёнот бердик. Бас, улар ўзларига илм келганидан сўнг
                  ўзаро ҳасад-адоват қилиб ихтилофга тушдилар. Албатта, Раббинг улар
                  орасида қиёмат куни ихтилоф қилган нарсалари ҳақида ҳукм чиқарур»
                  (45:17).
                </p>
              </div>
            )}

            <p
              onClick={() => toggleBubble('bubble5')}
              className="cursor-pointer "
            >
              Халқ қаттиқ қўрқиб кетган эди. Момақалдироқ ва карнай овози, улкан
              чақмоқлар нури уларни ваҳимага солган эди. Расулуллоҳга: «Бизга
              ўзингиз гапиринг, нимаики десангиз қулоқ соламиз, фақат Худо
              гапирмасин, бўлмаса ўламиз», деб ялиндилар, чунки тоққа чиқишни,
              Оллоҳ билан робитага киришни хоҳламас эдилар.<sup>5</sup>
            </p>

            <p>
              «Қўрқманглар, — деди Мусо пайғамбар. — Нега қўрқасизлар? Бу бир
              синов, холос. Оллоҳ сизларни гуноҳдан қайтариш учун сизларга бу
              мўъжизаларни зоҳир қилди».
            </p>

            <p>
               Лекин одамлар яқинлашишни истамай, олисдан
              қараб турган эдилар.
            </p>

            <p>
              Кейин Худо Мусо (а.с.) ни тоққа чақириб: «Бор, одамларга айт, энди
              тоққа оёқ босмасинлар, — деди. — Ким кўраман деб чегарадан ўтса, ҳалок
              бўлади. Энди Мен орангиздан руҳонийлар тайин қиламан. Лекин улар ҳам
              Менга яқинлашишдан олдин ўзларини поклаши лозим. Бор, пастга тушиб,
              Ҳорунни олиб чиқ», деди.
            </p>

            <p className="vitalic">
              Шу билан Бани Исроил Оллоҳ таоло билан учрашишни, У билан робитада
              яшашни истамади. Шу сабабдан Худо уларга яна бир аҳдни, шариат аҳдини
              қонун-қоидалари билан бирга ато этди.
            </p>
          </div>
        </main>
      </div>
    </div>
  );
}