'use client';

 

export default function ZargarDmitriyBilanBolganJanjal() {
  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>Заргар Дмитрий билан бўлган жанжал</p>
      </div>

      <div className="main_text">
        <p>
          Бу воқеалардан сўнг Толут (р.а.) Мақдуния ва Ахаия орқали Қуддусга
          боришга қарор қилди. «Ундан кейин Румга боришим керак!» дер эдилар у.
          Шу мақсадда ёрдамчилари Икром ва Эрастусни Мақдунияга юбориб, ўзлари
          яна бир неча кун Осиё вилоятида қолдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ўша пайтда Эфесда тариқатчиларга қарши катта бир ғулғула бошланди.
          Дмитрий деган бир заргар кумушдан Артемис маъбадини ясаб сотиш бўйича
          каттагина тижорат очган эди. Бир куни у қўл остидаги ҳунармандларни
          йиғиб деди:
        </p>
      </div>

      <div className="main_text">
        <p>
          «Бизнинг даромадимиз мана шу ишдан. Ана у Толут деган одам, қўлдан
          ясалган худолар худо эмас деб, бутун Осиё вилоятида халқни йўлдан
          уряпти. Ўзларингиз кўриб-эшитиб турибсиз. Гап фақат ишимиз касод
          бўлишида эмас. Буюк Артемиснинг маъбади ҳам эътибордан қолади, деб
          қўрқаман. Нафақат Осиё халқи, балки бутун дунё сиғинадиган маъбудамиз
          обрўсизланиши мумкин!»
        </p>
      </div>

      <div className="main_text">
        <p>
          Тўпланганлар буни эшитиб ғазабланиб: «Яшасин Эфес маъбудаси Артемис!»
          деб бақира бошладилар. Шаҳарда ғавғо бошланди. Оломон Толут (р.а.) нинг
          ҳамроҳларидан мақдуниялик Гоюс билан Аристархусни ушлаб, амфитеатрга
          судраб олиб келдилар. Толут (р.а.) оломон олдига чиқмоқчи эдилар,
          шогирдлари қўймади. Вилоят масъуллари ичида Толут (р.а.) нинг дўстлари
          бор эди. Улар ҳам: «Театрга кириб, жонингизни хатарга солманг, илтимос»,
          деб хабар юборишди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ичкарида шовқин-сурон авжига чиққан, ҳамма ҳар нарсани айтиб бақирар
          эди. Кўп одамлар нима учун келганини ҳам билмасди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бир пайт яҳудийлар Искандар деган бир кишини олдинга чиқаришди. У
          халқни тинчлантириш учун қўл кўтариб, нима бўлаётганини тушунтирмоқчи
          бўлди. Лекин халқ унинг яҳудийлигини билиб, яна ҳам баландроқ овозда:
          «Эфеснинг Артемисига шону шарафлар!» деб бақираверди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бақир-чақир тахминан икки соат давом этди. Икки соатлардан сўнг шаҳар
          ҳокими халқни тинчлантиришга эришиб деди:
        </p>
      </div>

      <div className="main_text">
        <p>
          «Эй Эфес халқи! Бизнинг шаҳримиз буюк Артемиснинг, сурати осмондан
          тушган маъбуданинг ҳофизи! Буни ҳеч ким инкор қилолмайди! Шундоғ экан,
          тинчланинглар. Ўйламай иш қилманг.
        </p>
      </div>

      <div className="main_text">
        <p>
          Мана бу одамларни ушлаб олиб келибсиз. Лекин улар ё маъбадни таламаган
          бўлса, ё худойимизни беҳурмат қилмаган бўлса. Агар Дмитрийнинг ё
          ҳунармандларнинг бирон шикояти бўлса, маҳкама эшиги очиқ, қозилар
          шикоятларини эшитишга тайёр. Даъволарини ўша ерда ҳал қилсин.
        </p>
      </div>

      <div className="main_text">
        <p>
          Агар бошқа нарсалар ҳақида шикоятингиз бўлса, марҳамат, шаҳар
          анжуманининг расмий йиғилишида ўртага ташланг, ҳал қиламиз. Бироқ бугун
          сабабсиз ғавғо кўтарганимиз учун Рум ҳукумати бизни исён қилишда
          айбламаса, деб қўрқаман. Ҳукумат олдида ўзимизни оқлаш учун ҳеч қандай
          далилимиз йўқ».
        </p>
      </div>

      <div className="main_text">
        <p>Шу гапларни айтиб, халқни уй-уйига тарқатди.</p>
      </div>

      <div className="paragraph_heading">
        <p>Юнонда</p>
      </div>

      <div className="main_text">
        <p>
          Шундан сўнг, Толут (р.а.) расулуллоҳнинг шогирдларини тўплаб, уларга
          далдаю насиҳатлар берди. Кейин хайрлашиб, Мақдунияга кетдилар. Йўл
          бўйи, шаҳарма-шаҳар, ўз насиҳатлари билан имонлиларга далда бериб,
          Юнонга етиб келдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Юнонда уч ой турдилар. Кейин кема билан Сурияга бормоқчи эди,
          яҳудийларнинг суиқасд тайёрлаётганини эшитиб, Мақдуния орқали қайтишга
          қарор қилди. Бериялик Пирус ўғли Супотрис, Салоникадан Аристархус билан
          Секундус, Дарбадан Гоюс; Осиё вилоятидан Тихикус билан Трўфимус ҳамда
          Икром у кишига ҳамроҳ бўламиз дейишди. Ва олдинроқ жўнаб, Троасда
          бизни кутиб туришди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Биз Қурбонлик байрамидан сўнг Филипидан кемага миниб, беш кун деганда
          Троасга етиб келдик ва у ерда етти кун бўлдик.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ҳафтанинг биринчи куни нон синдириш учун йиғилдик. Толут (р.а.) эртаси
          куни кетишни режа қилган эдилар, шунинг учун ярим кечагача биз билан
          суҳбат қилди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Биз ўтирган болохонада кўп чироғлар ёқилган, Ефтихус деган бир йигит
          дераза токчасида ўтирган эди. Толут (р.а.) нинг суҳбати чўзилиб кетиб,
          йигитни уйқу босиб учинчи қаватдан йиқилиб тушиб жон берди. Лекин
          Толут (р.а.) пастга тушиб, йигитнинг устига энгашиб, қучоғига олдилар-да:
          «Ташвишланманглар, у тирик», дедилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Кейин юқорига чиқиб биргаликда нон синдирдик. Тонг отгунча гаплашиб
          ўтирдик. Кун оқарганда йўлга чиқдилар. Ҳалиги йигитни эса биродарлар
          уйига соғ-саломат элтиб қўйдилар. Унинг тирилганидан ҳамма хурсанд эди.
        </p>
      </div>
    </main>
  );
}