'use client';

 
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function Qorintusda() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble10',
    'bubble11',
  ]);

  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>Қўринтусда</p>
      </div>

      <div className="main_text">
        <p>
          Толут (р.а.) кейин Қўринтусга бориб, у ерда пўнтуслик Акило деган
          яҳудий билан кўришди. (Хотинининг исми Прискило эди.) Улар бу ерга
          яқинда Италиядан келган, чунки Цезарь Клаудиус ҳамма яҳудийларни
          Румдан чиқариб юбориш ҳақида фармон берган эди. Толут (р.а.) улар
          билан бирга ишлай бошлади, чунки улар ҳам чодир тикиб сотиш билан
          шуғулланар эдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ҳар шанба куни Толут (р.а.) яҳудийлар тиловатхонасига бориб одамлар
          билан гаплашар, яҳудий ва юнонларни ишонтиришга ҳаракат қилар эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Силос билан Икром Македониядан келганларидан сўнг, Толут (р.а.) бутун
          вақтини яҳудийларга: «Ана шу Исо — сизлар кутаётган Масиҳ эди», деб
          ваъз қилиш учун бағишлади.
        </p>
      </div>

      <div className="main_text">
        <p>
          Лекин яҳудийлар қарши чиқиб, ҳақорат қилишга ўтдилар. Шунда Толут
          (р.а.) кийимидаги чангни қоқиб: «Қонларингиз ўз бўйнингизга, мен
          елкамдаги вазифадан озодман. Бундан буён Каломни ғайрияҳудийларга
          тарғиб қиламан», дедилар ва Юстус деган художўй ғайрияҳудийнинг уйига
          кўчиб ўтдилар. Унинг уйи тиловатхона олдида эди. Тиловатхона раҳбари
          Криспус ва унинг бутун хонадони ва яна бир нечта қўринтусликлар ғусл
          олиб, имонга кирдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бир куни тунда Мавлоно ҳазратлари Толут (р.а.) га кўриниш бериб
          дедилар: «Қўрқмасдан ваъз қилавер! Оғзинг ёпиқ турмасин! Мен сен
          билан биргаман, ҳеч ким сенга зарар етказмайди, бу шаҳарда менинг
          шогирдларим кўп».
        </p>
      </div>

      <div className="main_text">
        <p>
          Шу билан Толут (р.а.) бу ерда яна бир ярим йил қолиб, одамларга
          Худонинг каломидан таълим бердилар. Кейин — Галлио Ахаия вилояти
          ҳокими бўлган даврда — яҳудийлар бирлашиб Толут (р.а.) га қарши бош
          кўтардилар ва у кишини ҳукм қилиш учун ҳокимнинг олдига олиб бордилар.
          Толут (р.а.) ни: «Бу одам халқни қонунга хилоф равишда Худога
          сиғинишга ўргатяпти», деб айбладилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Толут (р.а.) эндигина ўзини ҳимоя қилиш учун гап бошлаган эдилар,
          Галлио яҳудийларга қараб дедилар:
        </p>
      </div>

      <div className="main_text">
        <p>
          «Тўхтанглар! Агар сизларнинг даъвонгиз қандайдир бир жиноят билан
          боғлиқ бўлса эди, гапларингизни эшитар эдим. Лекин жанжалингиз
          динингиздаги баъзи калима ва шахслар ҳақида экан, уни ўзларингиз ҳал
          қилинг. Мен бундай нарсаларга аралашишни хоҳламайман», деб уларни
          маҳкамадан чиқариб юборди. Кейин оломон тиловатхона бошлиғи Сустонисни
          ушлаб олиб, маҳкама олдида калтаклади. Лекин ҳоким бу ҳодисага эътибор
          бергани йўқ.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Эфесда жамоа пайдо бўлиши</p>
      </div>

      <div className="main_text">
        <p>
          Бу воқеадан сўнг Толут (р.а.) яна бир неча кун шаҳарда қолдилар. Кейин
          биродарлар билан хайрлашиб, Прискило билан Акилони ёнига олиб Сурияга
          борадиган кемага миндилар. (Сал олдинроқ, Канхария бандарида назр
          олиб, сочларини олдирган эдилар.)
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble10'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble10')}
          >
            <p>
              <sup>10</sup> Бу сафар Акило билан Прискило у кишидан айрилиб,
              сафарига ҳамроҳлик қилмаган.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble10')}>
          Эфес бандарига келгач у ердаги яҳудий тиловатхонасига бориб яҳудийлар
          билан суҳбатлашдилар. Шунда яҳудийлар у кишига шу ерда кўпроқ қолинг,
          деб илтимос қилишди. Лекин Толут (р.а.) кўнмай: «Худо хоҳласа кейин
          яна келаман», деб кемага миниб сафарини давом этдирдилар.
          <sup>10</sup>
        </p>
      </div>

      <div className="main_text">
        <p>
          Кема Қайсарияга етиб келгач, Толут (р.а.) Қуддусга бориб, у ердаги
          жамоа билан юз кўришдилар. Кейин Антокияга кетдилар. Бироз вақт у ерда
          бўлганларидан сўнг яна йўлга чиқдилар. Галотия ва Фарижия минтақаларини
          айланиб, шогирдлари билан учрашиб, уларга далда бердилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шу орада Аполлос деган бир яҳудий Искандариядан Эфесга келади. У
          Каломни яхши биладиган, гапга чечан, тариқат ҳақида билими бор, ҳарорат
          ва жасорат билан ваъз айтадиган, Исо алайҳис-салом ҳақида тўғри таълим
          берадиган одам эди. Лекин фақат Яҳё пайғамбарнинг ғуслидан хабардор
          эди. Эфесга келгач у, тиловатхонада шижоат билан ваъз қилишга бошлади.
          Прискило билан Акило унинг гапларини эшитиб, уни меҳмонга таклиф қилиб
          Худонинг йўли нима эканини унга яна ҳам тўлиқроқ қилиб тушунтирдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Кейин Аполлос Ахаияга сафарга отланди. Эфесдаги жамоат унинг бу
          фикрини қувватлаб, Ахаиядаги имонлиларга олиб бориши учун тавсиянома
          ҳам ёзиб бердилар. Унинг Ахаияга келгани, у ердаги биродарларга, иноят
          орқали имонга келган одамларга катта ёрдам бўлди. Чунки халқ олдида
          Каломдан далиллар келтириб, Исо алайҳис-саломнинг дарҳақиқат Масиҳ
          эканлигини исботлар, яҳудийларнинг ноҳақлигини фош қилар эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Аполлос Қўринтусда эканида, Толут (р.а.) вилоятлар орасидан ўтиб
          Эфесга келдилар. У ерда бир нечта имонлилар билан учрашдилар.
        </p>
      </div>

      <div className="main_text">
        <p>Кейин улардан: «Имон келтирганингизда Худонинг Руҳини олгансизларми?» деб сўрадилар.</p>
      </div>

      <div className="main_text">
        <p>«Йўқ, — дейишди улар. — Биз Руҳ ҳақида ҳеч нарса эшитмаганмиз».</p>
      </div>

      <div className="main_text">
        <p>«Ғусл олганингизда Руҳга чўммадингизми?»</p>
      </div>

      <div className="main_text">
        <p>«Йўқ, биз Яҳё пайғамбарнинг таълимоти бўйича ғусл олганмиз».</p>
      </div>

      <div className="main_text">
        <p>
          «Яҳёнинг ғусли гуноҳлардан тавба қилиш, Худога юз буриш учун берилган,
          — дедилар Толут (р.а.). — Яҳё пайғамбар, мендан кейин келаётган
          кишига, яъни ҳазрати Исога имон келтиринглар, деб айтганлар».
        </p>
      </div>

      <div className="main_text">
        <p>
          Улар бу гапдан сўнг расулуллоҳнинг номи билан ғусл олиб байъат
          қилдилар. Толут (р.а.) уларнинг устига қўл қўйган эдилар, Руҳ ул-қудс
          нузул қилиб, тилларда гапира бошладилар, пайғом айтдилар. Улар ҳаммаси
          бўлиб ўн икки киши эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Толут (р.а.) уч ой давомида ҳар шанба тиловатхонага бориб қўрқмай
          яҳудийлар билан баҳслашар, уларни Илоҳий Салтанатга ишонтиришга ҳаракат
          қилар эдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Баъзи кишилар пайғомни рад этиб, ҳамманинг олдида Тариқатни ёмонлагач,
          Толут (р.а.) тиловатхонага боришни тўхтатдилар. Имон келтирганларни
          алоҳида ажратиб, уларга ҳар куни Тиронус залида таълим бера бошладилар.
          Икки йил шу тарзда ўтди. Натижада Осиё вилоятининг бутун аҳолиси,
          яҳудию юнонлар расулуллоҳнинг пайғомидан хабардор бўлдилар.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Эфесда бўлган воқеалар</p>
      </div>

      <div className="main_text">
        <p>
          Оллоҳ таоло Толут (р.а.) орқали ғаройиб мўъжизалар қиларди. У кишининг
          баданига теккан рўмол ёки кўйлаклар ҳам, беморлар устига ташласа шифо
          берар, ичларидан нопок жинлар чиқиб кетар эди.
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble11'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble11')}
          >
            <p>
              <sup>11</sup> Бу табиблар ака-ука бўлиб, Искива деган руҳонийнинг
              ўғиллари эди.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble11')}>
          <span className="vitalic">Бир марта қизиқ воқеа юз берди:</span>{' '}
          жин чиқарадиган бир гуруҳ сайёр яҳудийлар ҳазрати Исони ўртага қўйиб:
          «Толут тарғиб қилаётган Исо номи билан амр қиламан, чиқ бу одамдан»,
          дедилар. <sup>11</sup>
        </p>
      </div>

      <div className="main_text">
        <p>
          Шунда жинга чалинган одам (тўғрироғи унинг ичидаги жин): «Исони
          танийман, Толутни ҳам биламан, сизлар кимсизлар?» деб сўради ва уларга
          ҳужум қилиб, шундоқ калтакладики, ҳаммалари қонга беланиб, уйдан
          яланғоч қочиб чиқдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бу хабар бутун Эфесга ёйилди. Эшитган яҳудий ва юнонлар қўрқиб,
          ҳазрати Исонинг исмини ҳурмат билан тилга ола бошладилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Имон келтирганлар қилган гуноҳларини эътироф этардилар, жоду билан
          шуғулланганлар қиймати эллик минг кумуш тангага тенг китобларини олиб
          келиб, ҳамманинг олдида оловга ёндиришди. Мавлононинг таълимоти ҳамма
          ёққа ёйилиб, кундан кунга таъсир кучи ошиб бораётган эди.
        </p>
      </div>
    </main>
  );
}