'use client';

import '../../../qisas-uzb/stories.css';

export default function SalonikaBeriyaAfina() {
  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>Салоникада</p>
      </div>

      <div className="main_text">
        <p>
          Кейин биз Амфипўлис ва Аполлония шаҳарларидан ўтиб, Салоникага келдик.
          У ерда яҳудий тиловатхонаси бор эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Толут (р.а.) ҳар доимги одати бўйича тиловатга бордилар ва уч шанба у
          ердагилар билан Калом бўйича баҳслашдилар. Масиҳнинг азоб чекиб ўлиши
          ва тирилиши ҳақида ёзилган башоратларни шарҳлаб, ҳазрати Исонинг
          ҳақиқатан ҳам Масиҳ эканини далиллар билан исботлар эдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Эшитганлардан кўпчилиги расулуллоҳга имон келтиришди. Улар ичида кўп
          ғайрияҳудий художўйлар ва нуфузли аёллар бор эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Буни кўрган яҳудий пешволари ҳасад қилиб, кўча ва бозордаги ёмон
          одамларни йиғиб ғавғо кўтаришди. Кейин Толут (р.а.) билан Силосни
          оломоннинг олдига олиб чиқиш учун Ёсуннинг уйига ёпирилдилар. Уларни
          топмай, Ёсун билан бир нечта биродарни шаҳар масъулларининг олдига
          судраб опкелиб, бақир-чақир бошладилар:
        </p>
      </div>

      <div className="main_text">
        <p>
          «Ҳамма ёқни остин-устин қилиб юрган бузғунчилар, энди бизнинг
          шаҳримизга ҳам келибди. Ёсун уларни уйига қабул қилибди. Уларнинг
          ҳаммаси хоин, Цезарнинг ўрнига Исо деган одамни подшоҳ деб
          айтишяпти».
        </p>
      </div>

      <div className="main_text">
        <p>
          Шаҳар аҳли ҳам, шаҳар масъуллари ҳам буни эшитиб ғулғулага тушдилар.
          Кейин кафолат олгач, Ёсун билан ёнидаги одамларни қўйиб юборишди.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Берияда</p>
      </div>

      <div className="main_text">
        <p>
          Биродарлар шу кечанинг ўзида Толут (р.а.) билан Силосни Берия шаҳрига
          жўнатишди. Берияга келгач яҳудий тиловатхонасига боришди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Берияликлар салоникаликларга ўхшаб мутаассиб эмас эди. Толут (р.а.)
          нинг гапларини иштиёқ билан эшитишар, кейин эшитганларини текшириш
          учун Каломдаги оятларни ўрганар эдилар. Натижада, улардан кўпи
          расулуллоҳга имон келтирди. (Бир гуруҳ нуфузли юнон хотинлар ва
          эркаклар ҳам имонга келдилар.)
        </p>
      </div>

      <div className="main_text">
        <p>
          Лекин салоникалик яҳудийлар Толут (р.а.) нинг Берияда ваъз
          қилаётганини эшитиб, Берияга келиб ғавғо кўтаришди. Биродарлар Толут
          (р.а.) ни дарҳол денгиз бўйига жўнатишди. (Силос билан Икром Берияда
          қолди.) Толут (р.а.) нинг ҳамроҳлари у кишини Афинагача кузатиб
          бордилар. Кейин Толут (р.а.) нинг: “Бориб, Силос билан Икромни тез бу
          ёққа жўнатинглар”, деган топшириғи билан орқага қайтдилар.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Афинада</p>
      </div>

      <div className="main_text">
        <p>
          Толут (р.а.) Афинада Силос билан Икромни кутар эканлар, шаҳарнинг
          бутларга тўлганини кўриб хафа бўлдилар. Кейин яҳудий ва имонли
          ғайрияҳудийлар билан гаплашиш учун тиловатхонага қатнай бошладилар.
          Ҳар куни одамлар билан шаҳар майдонида ҳам суҳбатлашар эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бир нечта эпикурчи ва стоик файласуфлар билан ҳам баҳс қилдилар.
          Расулуллоҳнинг Хушхабари ва тирилиши ҳақида гапирганларида,
          баъзилар: «Бу маҳмадона нима демоқчи ўзи?» деса, бошқалари: «У бизга
          хорижий худоларни тарғиб қиляпти», дер эдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Кейин Толут (р.а.) ни Ареопагусга — “Файласуфлар Кенгаши” деган жойга
          таклиф қилиб: «Сен қандай янги таълимот олиб келдинг? Қулоғимизга
          ғалати гаплар айтяпсан, маъносини тушунтир», дедилар. Афиналикларнинг
          ҳаммаси — Афинага келган чет элликлар ҳам — бор вақтларини янги
          ғоялар ҳақида гапириш ё тинглаш билан ўтказар эдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Эй афиналиклар, — деб гап бошлади Толут (р.а.) Кенгаш олдига чиқиб.
          — Сизлар динга жиддий ёндашар экансизлар. Кўчаларингизни айланиб
          қурбонгоҳларингизни кўрдим. Биттасида “Номаълум Худога” деб битилган
          ёзув бор экан. Мен ҳозир сизларга сизлар кимлигини билмай
          сиғинаётган ана шу Худо ҳақида гапирмоқчиман.
        </p>
      </div>

      <div className="main_text">
        <p>
          Дунёни ҳамда ундаги ҳар бир нарсани Оллоҳ яратган. Еру осмоннинг
          Эгаси У. Шу сабабдан ҳам у Зот инсон қўли билан ясалган маъбадларда
          яшамайди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Инсон қўли ул Зотнинг эҳтиёжларига хизмат қилолмайди, чунки У ҳеч
          нарсага муҳтож эмас! Унинг Ўзи ҳаммага ҳаёт ва нафас улашади, барча
          эҳтиёжларни қондиради.
        </p>
      </div>

      <div className="main_text">
        <p>
          У бир одамдан ҳамма миллатларни яратди ва бутун дунёга таратди.
          Уларга замону маконни белгилади. У олий Зот бу ишларни одамлар Мени
          изласин, топсин, деб қилган эди. Дарҳақиқат, Оллоҳ ҳеч биримиздан
          узоқ эмас. Чунки биз У орқали яшаяпмиз, ҳаракат қиляпмиз,
          мавжудмиз. Шоирларингиздан бири айтганидек: «Биз аслида Унинг
          наслимиз».
        </p>
      </div>

      <div className="main_text">
        <p>
          Шундоқ экан, биз Худони тилла, кумуш ё тошдан ясалган бутларга
          ўхшатмаслигимиз керак. Ўтмишда У одамзотнинг жаҳолат туфайли қилган
          ишларига тоқат қилган, бежазо қолдирган. Лекин энди ҳамма жойда,
          ҳамма одамларни тавба қилишга амр этмоқда. Чунки адолат билан
          дунёни ҳукм қиладиган куни аниқ. Ўша куни инсоният Оллоҳ тайин этган
          инсон орқали ҳукм қилинади. Бунинг исботи эса у инсоннинг ўлимдан
          тирилганидир».
        </p>
      </div>

      <div className="main_text">
        <p>
          Ўлимдан тирилиш ҳақидаги гапни эшитиб, баъзилари масхара қилиб
          кулдилар. Баъзилари эса: «Яна шу ҳақда фикрларингизни эшитсак яхши
          бўлар эди», деди. Кейин Толут (р.а.) Кенгашни тарк этдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бир неча одам у кишига эргашиб, расулуллоҳга имон келтирди. (Улар
          орасида Кенгаш аъзоси бўлган Диюнисиюс ҳамда Доморис деган бир аёл
          ҳам бор эди.)
        </p>
      </div>
    </main>
  );
}