'use client';

import '../../../qisas-uzb/stories.css';
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function FilippidaBolganVoqealar() {
  const { openBubbles, toggleBubble } = useSpeechBubbles(['bubble9']);

  return (
    <main className="stories relative">
      <div className="main_text">
        {openBubbles['bubble9'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble9')}
          >
            <p>
              <sup>9</sup> Рум империясининг Осиё вилояти, ҳозирги Туркиянинг
              ғарби.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble9')}>
          Руҳ уларга Худонинг каломини Осиёда<sup>9</sup> тарғиб қилишни манъ
          этгани учун, Толут (р.а.) билан Силос Фарижия ва Ғалотия
          вилоятларидан ўтиб Мисиёга келдилар ва Батниё вилоятига ўтмоқчи
          бўлдилар. Лекин расулуллоҳнинг Руҳи уларга рухсат бермади. Шунинг
          учун Мисиёдан ўтиб, Троас шаҳрига бордик.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шу куни тунда Толут (р.а.) рўё кўрдилар. Рўёда македониялик бир одам:
          «Бу ерга келиб, бизга ёрдам беринг!» деб илтижо қилар эди. Шунда биз:
          «Демак бориб македонияликларга xушхабар айтишимиз керак экан», деб
          хулоса қилдик ва дарров сафарга чиқдик.
        </p>
      </div>

      <div className="main_text">
        <p>
          Троасдан бир қайиққа миниб, тўғри Сомутарокига бордик. Эртаси
          Ниёпўлисга келдик. У ердан эса Рум қўл остидаги, Македониянинг муҳим
          шаҳарларидан бири бўлмиш Филиппига етиб бордик.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Филиппида бўлган воқеалар</p>
      </div>

      <div className="main_text">
        <p>
          Шанба куни шаҳар ташқарисига, дарё бўйига бордик. Одамлар дуо учун
          ўша ерда йиғилади, деб эшитган эдик. Йиғилган аёллар билан
          суҳбатлашдик.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бизни тинглаётганлар орасида Лидия деган художўй бир аёл бор эди. У
          Тиётро шаҳридан бўлиб, арғувон матолар билан савдо қилар экан.
          Гапларимизни эшитиб, унинг қалби очилди ва Толутнинг гапларини қабул
          қилди: бутун оиласи билан ғусл олиб, имон келтирдилар. Кейин: «Агар
          мени имонли деб ҳисобласангиз, уйимга келасиз, бир неча кун меҳмон
          бўласиз», деб бизни кўндирди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бир куни дуо қиладиган жойга кетаётган эдик, ичига жин кирган,
          жиннинг кучи билан фолчилик қилиб хўжайинларига кўп даромад
          келтираётган бир чўри қизни учратдик. У нуқул орқамиздан юриб, баланд
          овозда: «Бу одамлар Оллоҳ таолонинг хизматкорлари, сизларга нажот
          йўлини кўрсатиш учун келган», деб бақираверди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ҳар куни шу нарса такрорланавергандан кейин, Толут (р.а.) безор
          бўлиб, унинг ичидаги жинга: «Пирим номи билан буюраман, бу қизнинг
          ичидан чиқ!» дедилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шу заҳоти жин қизни тарк этди, ва қиз бошқа фолчилик қилолмайдиган
          бўлиб қолди. Даромад йўқолганини кўрган хўжайинлари Толут (р.а.)
          билан Силосни шаҳар майдонига, маҳкамага судраб олиб келиб: «Манави
          яҳудийлар одамларимизни бузяпти, Рум қонунларига хилоф нарсаларни
          таълим беряпти», деб бақира бошладилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ҳадемай оломон тўпланди. Маҳкама маъмурлари Толут (р.а.) билан
          Силосни ечинтириб, калтаклашга буйруқ беришди. Обдон қамчилаб,
          зиндонга олиб келишди ва зиндонбонга: «Буларни яхшилаб қўриқла», деб
          тайинладилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Зиндонбон уларни зиндоннинг ички бўлимига олиб кириб, оёқларини
          кундалаб қўйди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Тун яримлаб қолган эди. Толут (р.а.) билан Силос дуо қилиб, Оллоҳга
          ҳамду сано қўшиқлари айтар эдилар. Бошқа маҳбуслар қулоқ солиб
          ўтирган эди. Бирдан қаттиқ зилзила бўлиб, зиндоннинг пойдеворларини
          силкитди. Зиндоннинг ҳамма эшиклари ланг очилиб, маҳбусларнинг
          қўл-оёқларидаги кишанлар узилиб ерга тушди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Зиндонбон уйғониб, зиндон эшиклари очиқ эканини кўрди. Маҳбуслар
          қочиб кетибди, деб ваҳимага тушди, ва қиличини чиқариб ўзини
          ўлдирмоқчи бўлди.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Тўхта, тўхта, — деб бақирдилар Толут (р.а.) — Жонингга жабр қилма,
          биз ҳаммамиз шу ердамиз».
        </p>
      </div>

      <div className="main_text">
        <p>
          Зиндонбон қўрққанидан дир-дир титрар эди. Чироқ тилатиб, югуриб
          ичкарига кирди, Толут (р.а.) билан Силоснинг оёқлари тагида тиз
          чўкди. Кейин уларни ташқарига олиб чиқиб: «Жаноблар, нажот топиш учун
          нима қилишим керак?» деб сўради.
        </p>
      </div>

      <div className="main_text">
        <p>
          Улар: «Расулуллоҳга имон келтир, шунда ўзинг ҳам, хонаводанг ҳам
          нажот топасан», дейишди ва унга ҳамда унинг бутун аҳли байтига
          Раббимиз хушхабарини тушунтирдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Зиндонбон уларнинг яраларини ювди. Кейин бутун оиласи билан ғусл
          олиб, расулуллоҳга байъат қилдилар. Сўнг Толут (р.а.) билан Силосни
          уйига олиб кириб, олдларига дастурхон ёзди. Имон келтирганидан ўзи
          ҳам, оиласи ҳам жуда хурсанд эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Кундуз куни маҳкама маъмурлари миршаблар жўнатиб зиндонбонга: «У
          одамларни озод қил, кетаверишсин», деб хабар беришди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Зиндонбон келиб: «Маъмурият сизларни озод қилишга фармон берибди,
          кетаман десангиз ихтиёрингиз», деди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Аммо Толут (р.а.) бунга жавобан: «Биз Рум фуқаросимиз. Бизни сўроғу
          ҳукмсиз халқ олдида калтаклашди, зиндонга ташлашди, энди яширинча
          чиқиб кетинглар, дейдими? -- деб жавоб бердилар. -- Йўқ, ҳеч қаёққа
          кетмаймиз! Маҳкамадагилар ўз оёғи билан келиб, узр сўраб бизни
          чиқарсин!»
        </p>
      </div>

      <div className="main_text">
        <p>
          Миршаблар бориб бу гапни маъмуриятга етказишди. Уларнинг Рум фуқароси
          эканини эшитган маъмурлар қўрқиб кетдилар. Келиб, кечиримлар сўраб,
          ҳурмату эҳтиром билан уларни зиндондан чиқаришди ва шаҳардан
          кетишларини илтимос қилишди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Толут (р.а.) билан Силос кетишдан олдин Лидиянинг уйига бориб, у ерда
          биродарлар билан кўришиб, яна бир бор уларнинг руҳини кўтариб, шаҳарни
          тарк этдилар.
        </p>
      </div>
    </main>
  );
}