'use client';

 
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function TeachingsIsa() {
  const { openBubbles, toggleBubble } = useSpeechBubbles(['bubble1']);

  return (
    <main className="stories relative">
         <div className="main_text">
        <p>
          <span className="vitalic"> Атоуллоҳ (р.а.) ривоят қиладики: </span>
          «Ҳазрати Исо (а.с.) бу гапларнинг ҳаммасини масал тариқасида баён
          этганлар. Халққа таълим беришда ҳам доим масал билан гапирганлар. Шу
          тариқа китобда ёзилган мана бу башорат амалга ошди: «Мен халққа масал
          билан сўзлайман, дунё яратилгандан бери яширин ётган ҳикматларни ошкор
          этаман».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>1-боб: Ҳазрати Исо (а.с.) нинг тутинган отаси Юсуфнинг насабномаси</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            {' '}
            Ҳазрати Исо (а.с.) нинг саҳобаси бўлмиш Атоуллоҳ (р.а.) ривоят
            қилади:{' '}
          </span>
          «Ҳазрати Иброҳимнинг ҳамда ҳазрати Довуд (алайҳис-салом) нинг авлоди
          орқали дунёга келган Исо (алайҳис-салом) нинг насабномаси будир:
        </p>
      </div>

      <div className="main_text">
        <p>
          Иброҳим (а.с.) дан Исҳоқ (а.с.), Исҳоқ (а.с.) дан Яъқуб (а.с.), Яъқуб
          (а.с.) дан эса Яҳудо ва унинг ака-укалари дунёга келган эдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Яҳудо ва Тамарадан Парас билан Зараҳ туғилди. Парасдан Ҳасрўн,
          Ҳасрўндан эса Арам, Арамдан Амминадаб, Амминадабдан Наҳшўн, Наҳшўндан
          эса Салмўн туғилди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Салмўн ва Раҳобанинг авлодларидан Бўаз дунёга келди. Бўаз ва Рутдан
          Обид, Обиддан эса Ишай туғилди. Ишайдан подшоҳ Довуд дунёга келди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ҳазрати Довуд (а.с.) билан Уриёнинг бевасидан Сулаймон (а.с.) туғилди.
          Ҳазрати Сулаймондан Раҳабаъм, Раҳабаъмдан Абиё, Абиёдан эса Осо
          туғилди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Осодан Йўшафат, Йўшафатдан Йўрам, Йўрамнинг уруғидан кейинчалик Уззиё
          дунёга келди. Уззиёдан Йўтам, Йўтамдан Аҳаз, Аҳаздан эса Ҳизқиё
          туғилди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ҳизқиёдан Манаше, Манашедан Амўн, Амўндан эса Йўшиё туғилди. Бобил
          сургуни вақтида Йўшиёнинг ўғлидан Йўаким билан унинг укалари,
          Йўакимдан эса Шаалтиэл дунёга келди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шаалтиэлнинг ўғлидан Зарубобил, Зарубобилдан Абиҳуд, Абиҳуддан Элёқим,
          Элёқимдан эса Азўр туғилди. Азўрдан Садўқ, Садўқдан Ахим, Ахимдан эса
          Элиҳуд туғилди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Элиҳуддан Илъазар, Илъазардан Маттан, Маттандан эса Яъқуб туғилди.
          Яъқубдан Биби Марям билан турмуш қурган Юсуф туғилди. Биби Марямдан эса
          ал-Масиҳ деб аталган Исо (а.с.) дунёга келдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Мана, ҳазрати Иброҳимдан Довуд (а.с.) гача ўтган насллардан ўн
          тўрттаси, Довуд (а.с.) дан Бобил сургунигача ўтган авлодлардан ўн
          тўртта ва Бобил сургунидан то ҳазрати Масиҳгача бўлган насллардан ўн
          тўрттаси мана шулардир».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>2-боб: Уруғ сепувчи ҳақида масал</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            {' '}
            Исо (а.с.) нинг халққа насиҳат қилиб айтган масалларидан бири уруғ
            сепувчи ҳақида эди. Атоуллоҳ (р.а.) ривоят қилади:{' '}
          </span>
          «Деҳқон уруғ сепиш учун далага чиқибди. Уруғ сепаётганида, уруғлардан
          бир қисми йўл ёқасига тушибди ва оёқ ости бўлибди. Кейин қушлар келиб,
          уларни чўқиб кетибди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Баъзи уруғлар эса тупроғи оз тошлоқ ерга тушибди. Тупроғи кам бўлгани
          учун, тез кўкариб чиқибди, лекин қуёш қиздирган чоғда, илдизлари
          саёзлигидан, нам етишмаганидан куйиб, қуриб қолибди.
        </p>
      </div>

      <div className="main_text">
        <p>Баъзи уруғлар тиканлар орасига тушибди. Тиканлар ўсиб, уларни бўғиб қўйибди.</p>
      </div>

      <div className="main_text">
        <p>
          Баъзи уруғлар эса яхши ерга тушибди ва ўттиз ва олтмиш ва юз баравар
          ҳосил берибди. Кимнинг эшитар қулоғи бўлса, эшитсин!»
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Масалнинг шарҳи</p>
      </div>

      <div className="main_text">
        <p>
          Кейинроқ, ҳазрати Исо (а.с.) ёлғиз қолганларида, ўн икки шогирди келиб
          у кишидан масалнинг шарҳини сўрайдилар.{' '}
          <span className="vitalic">Атоуллоҳ (р.а.) устознинг гапларини ривоят қилади: </span>
        </p>
      </div>

      <div className="main_text">
        <p>
          «Уруғ — Оллоҳнинг сўзлари. Кимки Илоҳий Салтанат ҳақида китобдан
          эшитса-ю уқмаса, шайтон келиб, у имон келтирмасин, нажот топмасин, деб
          унинг юрагига сепилган сўзларни ўғирлаб кетади: бу — ўша йўл ёқасига
          тушган уруғларга ишора.
        </p>
      </div>

      <div className="main_text">
        <p>
          Тошлоқ ер эса, каломни эшитиб, дарров хурсанд бўлиб қабул қилган
          кишилар. Лекин уруғ илдиз отолмагани учун, қаршилик ё қийинчиликка дуч
          келса, улар тезда Ҳақ йўлни тарк этади. Бу — ўша тошлоқ ерга тушган
          уруғлар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Яна бир гуруҳ одамлар Оллоҳнинг сўзини тинглайдилар. Лекин тирикчилик
          ташвиши ҳамда мол-дунёнинг алдоқчи жозибаси зўр келиб ҳар томондан
          каломни сиқиб, бўғиб қўяди. Натижада улар тиканак ер каби, ҳосил
          бермайдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Яхши ер эса, каломни эшитиб, тушуниб, яхши ва ҳалол юракда сақлайдиган
          одамлар. Улар сабр-тоқат билан баъзан ўттиз, баъзан олтмиш ва баъзан юз
          баравар ҳосил берадилар!»
        </p>
      </div>

      <div className="paragraph_heading">
        <p>3-боб: “Сиз келиши керак бўлган Масиҳсиз!”</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            {' '}
            Сафвон (р.а.) Исо (а.с.) ни Аҳд вориси деб тан олганлар. Атоуллоҳ
            (р.а.) бизга ривоят қилишича, Исо (а.с.) ҳам буни тасдиқлаганлар:{' '}
          </span>
        </p>
      </div>

      <div className="main_text">
        <p>
          «Филип Цезарияси деган жойга яқинлашганимизда, Исо (а.с.) бизга савол
          бердилар: «Айтинглар-чи, одамлар мени ким деб ўйлайди?»
        </p>
      </div>

      <div className="main_text">
        <p>
          «Баъзилар сизни Яҳё пайғамбар деб, баъзилар Илёс деб ўйлайди, – деб
          жавоб бердик биз. – Кимлардир сизни Ирмиё ё бошқа бир қадимий пайғамбар
          тирилибди, деб айтмоқда».
        </p>
      </div>

      <div className="main_text">
        <p>«Сизлар-чи? Сизлар мени ким деб ўйлайсизлар?» дедилар Исо (а.с.).</p>
      </div>

      <div className="main_text">
        <p>
          Шунда биродаримиз Сафвон: «Сиз ўша келиши ваъда қилинган Ворис ал-Аҳд,
          Оллоҳ тайин этган Халиф-Масиҳсиз!» деб жавоб берди.
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble1'] && (
          <div className="speech-bubble" onClick={() => toggleBubble('bubble1')}>
            <p>
              <sup>1</sup> Маъноси “тош”. Сафвоннинг асл исми Шимъун бўлган.
              Исо (а.с.) нинг ўлимидан кейин Сафвон (р.а.) нинг жамоатдаги
              мавқеи жуда юқори бўлган.{' '}
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble1')}>
          Устоз дедилар: «Сен саодатлисан, эй Юнус ўғли Самиъ! Чунки бу ҳақиқат
          сенга одамлардан эмас, балки Худодан келди. Бу тош устида мен руҳоний
          жамоат барпо қиламан. Ўлим дарвозалари ҳам уни мағлуб қила олмайди.
          Сен Сафвон<sup>1</sup> деб аталасан. Мен сенга Хилофат калитларини
          бераман. Бу дунёда ниманидир боғласанг руҳий дунёда ҳам боғланади,
          ниманидир ечсанг, руҳий дунёда ҳам ечилади», дедилар.
        </p>
      </div>

      <div className="main_text">
        <p>Кейин бизга: «Менинг ал-Масиҳ эканлигимни ҳеч кимга айтманглар», деб қаттиқ тайинладилар».</p>
      </div>

      <div className="paragraph_heading">
        <p>4-боб: Янги билан эски бир-бирига мос эмас</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic"> Нурлуқ (р.а.) ривоят қилади: </span>
          «Бир куни Тақво гуруҳининг раҳбарлари Исо (а.с.) дан сўрадилар:
        </p>
      </div>

      <div className="main_text">
        <p>
          «Яҳё пайғамбарнинг шогирдлари ҳам, бизнинг шогирдларимиз ҳам тез-тез
          рўза тутишади, дуо қилишади. Сизнинг шогирдларингиз эса еб-ичиб
          юришибди. Нега?»
        </p>
      </div>

      <div className="main_text">
        <p>
          Шунда Оллоҳнинг расули уларга бундоғ деб жавоб бердилар: «Тўйда
          ўтирган куёв жўраларга рўза тутдириб бўладими? То куёв билан бирга
          эканлар рўза тута олмайдилар. Лекин куёвни улардан жудо қиладиган вақт
          келади, ана ўшанда улар рўза тутади».
        </p>
      </div>

      <div className="main_text">
        <p>
          Кейин мана бу масални айтдилар: «Ҳеч ким янги кийимдан матоҳ кесиб олиб
          эски кийимга ямоқ солмайди! Чунки биринчидан янги кийим расво бўлади,
          иккинчидан янги ямоқ эски кийимга мос тушмайди».
        </p>
      </div>
    </main>
  );
}