'use client';

import '../../../qisas-uzb/stories.css';
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function TeachingsSeven() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble14',
    'bubble15',
    'bubble16',
  ]);

  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>40-боб: Қуддуснинг вайрон бўлиши ҳақидаги башорат</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Атоуллоҳ (р.а.) Ражул (р.а.) нинг тилидан ривоят қилади:{' '}
          </span>
          «Байтуллоҳдан чиқар эканмиз, Байтуллоҳнинг тошлари ва ундаги вақф
          қилинган қимматбаҳо нарсалар ҳақида гап очдик. Шунда устозимиз
          дедилар: «Бу гўзал иморат бутунлай вайрон бўлади: тош устида тош
          қолмайди».
        </p>
      </div>

      <div className="main_text">
        <p>
          Зайтун тоғига келиб, тоғда — Байтуллоҳ рўпарасида ўтирганларида,
          Сафвон, Яъқуб, Яҳё ва мен расулуллоҳнинг олдларига бориб: «Устоз, бу
          нарса қачон юз беради? Сизнинг қайтишингизни, вақтнинг тугал бўлганини
          кўрсатадиган аломатлар нима?» деб сўрадик.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Эҳтиёт бўлинглар, — деб жавоб бердилар Оллоҳнинг Расули. — Ҳеч ким
          сизларни алдамасин. Чунки кўплар менинг номим билан келиб, “Мен
          Масиҳман”, “Вақт келди”, деб одамларни йўлдан уради. Уларга эргашманг.
          У ер-бу ерларда урушлар бошланганини эшитасиз, лекин ваҳимага тушманг,
          бу — ҳали охири келди дегани эмас. Халқ халққа қарши, давлат давлатга
          қарши бош кўтаради. Бир неча жойда очарчиликлар, офатлар ва қаттиқ
          зилзилалар бўлади. Буларнинг ҳаммаси бамисоли тўлғоқнинг бошланишидур».
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble14'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble14')}
          >
            <p>
              <sup>14</sup> Миррих (р.а.) нинг мусаннафида “Сизлар эмас,
              Оллоҳнинг Руҳи гапиради”, деб ёзилган.
            </p>
          </div>
        )}

        <p onClick={() => toggleBubble('bubble14')}>
          <span className="vitalic">
            Нурлуқ (р.а.) да зикр қилинишича, расулуллоҳ яна бундай деб айтган
            эканлар:{' '}
          </span>
          «Ўшанда даҳшатли ҳодисалар рўй беради, самодан буюк аломатлар зоҳир
          бўлади. Лекин аввал сизларни тутиб қийнайдилар. Тиловатхоналарда
          тергов қилишади, зиндонларга ташлашади. Мен туфайли подшоҳлар ва
          ҳокимлар олдига олиб боришади. Шунда мен ҳақимда шаҳодат берасизлар.
          Ўша пайтда ўзимизни қандай ҳимоя қиламиз, деб олдиндан тайёргарлик
          кўрманг. Чунки мен сизларга
          <sup>14</sup> ҳикматли сўзлар бераман, ҳеч ким гапингизга қарши
          туролмайди. Ҳа, қийин пайтлар келиши аниқ. Ҳатто ота-она,
          қариндош-уруғ ва дўстларингиз ҳам сизларга қарши чиқиб, сизларни
          рақиблар қўлига топширишади. Баъзиларингизни қийнайдилар,
          баъзиларингизни ўлимга маҳкум қилишади. Ака укасининг, ота боласининг,
          фарзандлар ота-онасининг ўлимига зомин бўлади».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>41-боб: Кафру Ноҳумда бир жинзаданинг шифо топгани</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Нурлуқ (р.а.) саҳобалардан эшитиб ривоят қилади:{' '}
          </span>
          «Исо (а.с.) Кафру Ноҳум шаҳрига келиб шанба кунлари халққа таълим бера
          бошладилар. Одамлар у кишини ҳайрон бўлиб тинглар, чунки гапларида
          қандайдир бир қудрат, қандайдир бир салоҳият бор эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бир куни ичига жин кирган бир одам тиловатхонага келди ва Оллоҳнинг
          расулини кўриб баланд овоз билан: «Эй носиралик Исо! Бизни ўз ҳолимизга
          қўй, биз билан нима ишинг бор? Бизни ўлдириш учун келдингми? Кимлигингни
          биламан, сен Оллоҳнинг муқаддасисан», деб бақира бошлади.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Жим бўл! — дедилар устоз. — Унинг ичидан чиқ!» Шунда жин ҳалиги
          одамни ерга йиқитиб, лекин бирон шикаст етказмай, ичидан чиқиб кетди.
          Одамлар ҳаяжонга тушиб бир-бирларига: «Во ажабо, гапларидаги қудратни
          қаранг! Оллоҳ бу кишига ҳокимият ато этибди! Бир оғиз гап билан
          жинларни ҳайдаб чиқаряпти-я!» дер эдилар. Шу билан Исо (а.с.) ҳақидаги
          хабар тезда ҳамма ёққа овоза бўлди».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>42-боб: «Юракларингизни ёғ босмасин!»</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Нурлуқ (р.а.) нинг мусаннафида Исо (а.с.) нинг ўз шогирдларини
            огоҳлантириб айтган мана бу сўзлари ҳам бор:{' '}
          </span>
          Ўша кунлари Исо (а.с.) ҳар куни Байтуллоҳда дарс берар, бутун халқ у
          кишининг таълимотини эшитиш учун саҳардан маъбадда тўпланар эди».
          (Кечалари эса расулуллоҳ Зайтун тоғига борар эдилар.)
        </p>
      </div>

      <div className="paragraph_heading">
        <p>43-боб: «Илоҳий Салтанат сизларники!»</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Расулуллоҳнинг Жалила вилоятида, тоғ ёнбағрида қилган ваъзидан.
            Атоуллоҳ (р.а.) ривоят қилади:{' '}
          </span>
          «Эй руҳан эзилганлар, сизлар ҳам саодатлисиз, чунки Салтанат эшиги
          сизларга ҳам очиқ! Эй аза чекаётганлар, саодатлисиз, чунки
          Парвардигорим сизлар билан бирга, сизларни қўллайди! Ҳоксор бўлганлар,
          саодатлисиз. Чунки ваъда қилинган ер сизларга мерос бўлур. Тўғриликка
          очу-чанқоқлар саодатли, чунки улар “тўяди”. Раҳмдил ва кечирувчан
          бўлганлар саодатли, чунки раҳм-шафқат топадилар. Пок ниятли одамлар
          саодатли, чунки улар Оллоҳнинг хоҳиш-иродасини англайдилар. Тинчлик
          хизматкорлари саодатли, чунки Оллоҳ уларни фарзандларим деб атайди.
          Тўғрилик учун қувғин бўлганлар саодатли, чунки Осмон Салтанати
          уларники. Мен туфайли ҳақорат ва қувғинга дучор бўлсангиз, одамлар сиз
          ҳақингизда ёмон гаплар айтса, саодатлисиз! Бундай пайтда хурсанд
          бўлинг! Ҳа, суюнинг, чунки ўтган пайғамбарлар ҳам шундай қувғин
          бўлганлар. Сиз ҳам улар каби арши-аълода катта мукофотга эга бўласиз!»
        </p>
      </div>

      <div className="paragraph_heading">
        <p>44-боб: “Сиз ернинг тузисиз, дунёнинг нурисиз”</p>
      </div>

      <div className="main_text">
        {openBubbles['bubble15'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble15')}
          >
            <p>
              <sup>15</sup> Туз таомга маза киритади, гўштни бузилишдан
              сақлайди. Бирор жойингиз йирингласа, туз қўйсангиз, шишини олади.
            </p>
          </div>
        )}

        <p onClick={() => toggleBubble('bubble15')}>
          <span className="vitalic">
            Атоуллоҳ (р.а.) нинг ривоят қилишича Исо (а.с.) шогирдларига бундай
            деб айтган эканлар:{' '}
          </span>
          «Сизлар ернинг тузисизлар.
          <sup>15</sup> Лекин агар тузингиз ўз шўрини йўқотса, уни қандай яна шўр
          қилиш мумкин? Бундай туз ташлаб юборишдан ёки оёқ ости бўлишдан бошқа
          нарсага ярамайди.
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble16'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble16')}
          >
            <p>
              <sup>16</sup> У замонларда ҳозиргидек электр чироқлари бўлмаган.
              Шунинг учун тепа жойда қурилган уйлардан милтиллаган ёруғлик ҳам
              кечаси йўлда кетаётганларнинг диққатини жалб этган, туннинг
              зулматидан, қўрқувидан таскин берган.
            </p>
          </div>
        )}

        <p onClick={() => toggleBubble('bubble16')}>
          Сизлар — дунёнинг нурисизлар. Тоғ устига қурилган шаҳар
          <sup>16</sup> кўздан яширин қолмайди. Чироқни ҳам ёққандан сўнг, ҳеч ким
          устини идиш билан ёпиб қўймайди. Аксинча, уйдагиларнинг ҳаммасига нур
          берсин, деб баландроқ бир жойга қўядилар. Сизнинг нурингиз ҳам элу
          халқ олдида шундай порласинки, одамлар яхши ишларингизни кўриб,
          Раббингизни мақтасин».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>45-боб: Таврот ва пайғамбарлар</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Тоғ ёнбағридаги ваъз. Атоуллоҳ (р.а.) Исо (а.с.) дан ривоят қилиб
            айтади:{' '}
          </span>
          «Мени Таврот ёки пайғамбар оятларини бекор қилиш учун келган, деб
          ўйламанглар. Мен уларни бекор қилиш учун эмас, амалга ошириш учун
          келдим. Сизларга айтиб қўяй: то еру осмон мавжуд экан ва айтилган
          ҳамма нарса амалга ошмас экан, Тавротдан битта ҳарф ҳам, нуқта ҳам
          ўчмайди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ким бу амрларнинг ҳатто энг кичигини бузса ва бошқаларга шундоғ
          қилишни ўргатса, Осмон Салтанатида ҳаммадан паст бўлғай. Ким бу
          амрларни бажарса ва бошқаларга ҳам шундоғ қилишни ўргатса, Осмон
          Шоҳлигида номи улуғ бўлғай.
        </p>
      </div>

      <div className="main_text">
        <p>
          Сизларга айтаманки: агар солиҳлигингиз тақводорлар ва уламолар
          солиҳлигидан аъло бўлмаса, ҳеч қачон Оллоҳнинг Салтанатига кира
          олмайсизлар».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>46-боб: Ғазабланиш борасида</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Тоғ ёнбағридаги ваъз. Атоуллоҳ (р.а.) расулуллоҳдан ривоят қилади:{' '}
          </span>
          «Қадимда, қотиллик қилма, ким қотиллик қилса, ҳукмга сазовор, деб
          айтилганини эшитгансизлар. Мен эса сизларга айтаман: ким биродарига
          қарши ғазабланса, ҳукмга лойиқ. Ким биродарини қовоқ калла деб сўкса,
          олий маҳкамага жавобгар бўлади. Ким биродарига кофир деса, дўзах
          оловига лойиқ. Шундай экан, ибодатга юз тутсанг-у, биродаринг сендан
          хафа экани ёдингга тушса, ибодатингни тўхтат. Олдин бориб, биродаринг
          билан яраш. Ундан кейин келиб, Оллоҳга ибодатингни тақдим этасан.
        </p>
      </div>

      <div className="main_text">
        <p>
          Дунёда ҳам агар биров сенга даво қилиб маҳкамага судраса, йўлда тез у
          билан келишишга ҳаракат қиласан. Бўлмаса у сени қозига, қози миршабга,
          миршаб эса зиндонга ташлаши мумкин. Кейин то охирги чақасини
          тўламагунча, у ердан зинҳор чиқа олмайсан».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>47-боб: Зино ҳақида</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Тоғ ёнбағридаги ваъз. Атоуллоҳ (р.а.) нинг ривояти: </span>
          «Зино қилма!» деб айтилганини эшитгансизлар. Лекин мен сизларга
          айтаман: ким аёлга шаҳват учун қараса, аллақачон юрагида у билан зино
          қилган бўлади. Агар ўнг кўзинг сени йўлдан оздирмоқчи бўлса, уни ўйиб
          ташла. Чунки тўрт мучалинг бут бўлиб дўзахга тушгандан кўра, бир
          кўзингдан айрилганинг сен учун яхшироқ. Агар ўнг қўлинг сени йўлдан
          оздирмоқчи бўлса, уни кесиб ташла, чунки бутун баданинг билан дўзахга
          тушгандан кўра, бир қўлингни йўқотганинг сен учун яхшироқ».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>48-боб: Талоқ ҳақида</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Атоуллоҳ (р.а.) Исо (а.с.) нинг мана бу сўзларини ривоят қилади:{' '}
          </span>
          «Яна айтилган: “Ким хотинини талоқ қилса, талоқ хати ёзиб берсин”.
          Лекин мен сизларга айтаман: ким бевафолик айбидан бошқа сабаб билан
          хотинини талоқ қилса, хотинининг зино қилишига сабабчи бўлади. Ажралган
          хотинга уйланган ҳам Оллоҳнинг наздида зино қилади».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>49-боб: Қасам ичманглар</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Атоуллоҳ (р.а.) ҳазрати расулуллоҳдан ривоят қилади:{' '}
          </span>
          «Қадимгиларга, ёлғондан қасам ичма. Оллоҳ олдида қасам ичсанг,
          қасамингни албатта бажар, деб айтилганини ҳам эшитгансизлар. Мен
          сизларга айтаман: умуман қасам ичманг — на осмон ҳаққи, чунки у
          Оллоҳнинг тахти; на ер ҳаққи, чунки у Оллоҳнинг пойандози; на Қуддус
          ҳаққи, чунки у Буюк Подшоҳнинг шаҳри.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бошинг ҳаққи ҳам қасам ичма, чунки биронта сочингни оқ ё қора қилишга
          қодир эмассан. “Ҳа“ дейдиган жойда “ҳа”, денглар, “йўқ” дейдиган жойда
          “йўқ”. Ундан ортиғи шайтондандир».
        </p>
      </div>
    </main>
  );
}