'use client';

 
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function TeachingsTwo() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble2',
    'bubble3',
  ]);

  return (
    <main className="stories relative">

      <div className="paragraph_heading">
        <p>5-боб: “Бутун дунёни қўлга олсангиз-у...”</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic"> Атоуллоҳ (р.а.) дан: </span>
          «Расулуллоҳ Қуддусга бориши кераклигини, у ерда дин пешволари,
          оқсоқоллар ва фақиҳлар қўлида азоб чекиб ўлишини ва учинчи куни
          тирилишини бизга айтдилар.
        </p>
      </div>

      <div className="main_text">
        <p>Сафвон эса у кишини четга тортиб: «Худо сақласин, ҳазратим, бунақа деманг!» деб сарзаниш қилди.</p>
      </div>

      <div className="main_text">
        <p>Устозимиз бурилиб Сафвонга: «Йўлимни тўсма, шайтон! Сен Оллоҳнинг ишини эмас, одамларнинг ишини ўйлаяпсан!» деб қаттиқ танбеҳ бердилар.</p>
      </div>

      <div className="main_text">
        <p>Кейин бизга дедилар: «Ким менинг ортимдан юришни истаса, ўзидан кечсин. Ўз хочини елкасига кўтариб, ҳар куни ортимдан эргашсин. Чунки ким жонини сақламоқчи бўлса уни йўқотади. Ким мен учун, бушро учун жонини йўқотса уни сақлаб қолади.</p>
      </div>

      <div className="main_text">
        <p>Агар бутун дунёни қўлга киритсангиз-у, жонингиздан маҳрум бўлсангиз, сизга нима фойдаси бор? Ахир инсон ўз жони эвазига қандай тўлов бериши мумкин?</p>
      </div>

      <div className="main_text">
        {openBubbles['bubble2'] && (
          <div className="speech-bubble" onClick={() => toggleBubble('bubble2')}>
            <p>
              <sup>2</sup>{' '}
              <span className="vitalic">
                Миррих (р.а.) нинг мусаннафида ёзилишича Исо (а.с.) бундай деб
                айтган эканлар:{' '}
              </span>{' '}
              <span className="">
                «Бу бузуқ гуноҳкор насл ичида ким мендан ё менинг сўзларимдан
                ор қилса, мен ҳам ерга қайтиб келганимда ундан ор қиламан».
              </span>
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble2')}>
          Инсон Ўғли Оллоҳ берган шукуҳу азаматда, нурли фаришталар қуршовида
          ерга қайтиб келади ва ҳар бир инсонга қилган ишларига қараб ажр беради.
          <sup>2</sup> Сизларга айтаманки, орангизда то Оллоҳнинг Салтанати қудрат
          билан келганини кўрмагунча ўлмайдиганлар бор».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>6-боб: “Қандай қилиб ўзингизни оқлайсиз?”</p>
      </div>

      <div className="main_text">
        <p><span className="vitalic"> Нурлуқ (р.а.) ривоят қилади: </span>«Бир куни фиқҳ олимларидан бири Исо (а.с.) ни синаш учун: «Устоз, абадий ҳаётга ворис бўлиш учун нима қилишим керак?» деб савол берди.</p>
      </div>

      <div className="main_text">
        <p>«Амрларда нима дейилган? Нима деб тиловат қиласизлар?» дедилар Оллоҳнинг расули.</p>
      </div>

      <div className="main_text">
        <p>«Парвардигорингни бутун дилинг билан, бутун жонинг билан, бутун куч-қудратинг билан, бутун ақлинг билан сев. Яқинингни ўзингни севгандек сев», деб жавоб берди у. </p>
        <p>
          «Жавобингиз тўғри. Амал қилинг — абадий ҳаётга ворис бўласиз!» дедилар расулуллоҳ».
        </p>
      </div>

      <div className="main_text">
        <p>Лекин фақиҳ ўзини оқламоқчи бўлиб: «Менинг яқиним ким?» деб сўради.</p>
      </div>

      <div className="main_text">
        <p>Исо (а.с.) унинг бу саволига масал билан жавоб бердилар: «Бир одам Қуддусдан Ариҳога кетаётиб қароқчилар қўлига тушибди. Қароқчилар унинг кийимларини ечиб олиб, уриб-уриб чалажон қилиб ташлаб кетибди.</p>
      </div>

      <div className="main_text">
        <p>Тасодифан ўша йўлдан бир руҳоний келаётган экан. Ётган одамни кўриб у йўлнинг нариги четидан ўтиб кетибди. Бироздан сўнг руҳоний ортидан бир имом ҳам келибди. Ҳалиги жойга келганда чалажон одамни кўриб, у ҳам унинг ёнидан ўтиб кетаверибди.</p>
      </div>

      <div className="main_text">
        <p>Йўлда бир сомирий ҳам сафар қилаётган экан. Ётган одамнинг олдига келиб уни кўрибди-да, ич-ичидан унга ачинибди. Ёнига ўтириб, яраларини шароб билан ювиб, мой суртиб боғлабди, кейин ўзи миниб келган уловга миндириб, меҳмонхонага олиб борибди. Меҳмонхонадан жой олиб, эрталабгача бечорага ғамхўрлик қилибди. Эртасига йўлга чиқар экан, меҳмонхона эгасига икки динор бериб: “Унга яхшилаб қаранг. Агар бундан ортиқ харажат қилсангиз, қайтишда тўлайман”, дебди.</p>
      </div>

      <div className="main_text">
        <p>Нима деб ўйлайсиз, бу уч одамдан қайси бири жабр кўрган кишига яқинлик қилди?»</p>
        <p>Фақиҳ: «Унга раҳм қилган одам», деб жавоб берди. </p>
        <p>
          «Сиз ҳам шундай қилинг», дедилар расулуллоҳ».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>7-боб: Расулуллоҳнинг нурли қиёфага кирганлари</p>
      </div>

      <div className="main_text">
        <p><span className="vitalic"> Нурлуқ (р.а.) Яъқуб (р.а.) дан эшитиб ривоят қилади: «Яъқуб (р.а.) деди: </span>«Устозимиз мени, Сафвонни ва Яҳёни ўзлари билан бирга олиб ибодат қилиш учун тоққа чиқдилар. Ибодат пайти юзлари қуёшдек ярқиради, кийимлари ҳам оппоқ рангга кириб нурланди. Бир пайт, ҳазрати Мусо ва Илёс пайғамбарлар улуғ бир кўринишда пайдо бўлиб, устозимиз билан суҳбат қилдилар. Гап у кишининг Қуддусда қиладиган вазифаси ҳақида эди.</p>
      </div>

      <div className="main_text">
        <p>Улар келган пайтда мен ва шерикларим ухлаб қолган эдик. Уйғониб кўз очсак, Исо (а.с.) шукуҳли бир қиёфадалар, олдларида яна икки киши бор.</p>
      </div>

      <div className="main_text">
        <p>Суҳбат ниҳоясига етиб, Мусо пайғамбар билан Илёс пайғамбар кетмоқчи бўлган пайтда, Сафвон устозимизга дедилар: «Ҳазратим, бу ерга келганимиз қандоғ яхши бўлди. Ижозат берсангиз учта чайла қурамиз. Биттаси сизга, биттаси ҳазрати Мусога, биттаси Илёсга...». У ўзининг нима деяётганини англамас эди.</p>
      </div>

      <div className="main_text">
        <p>Сафвоннинг гапи тугамай туриб нурли бир булут устимизга тушди. Биз қўрқиб кетдик. Булутдан эса: “Бу — Мен суйган, Мен сайлаган Халифа! Унга қулоқ солинглар!” деган товуш келди».</p>
      </div>

      <div className="main_text">
        <p><span className="vitalic"> Атоуллоҳ (р.а.) нинг мусаннафида ёзилишича: </span>«Уч шогирд қўрқиб ердан бош кўтаролмай қолади. Кейин Исо (а.с.) уларнинг олдига келиб, елкаларига қўл текизиб: «Туринглар, қўрқманглар!» дейдилар. Бошларини кўтариб қарасалар, ён-атрофда у кишидан бошқа ҳеч ким йўқ экан».</p>
      </div>

      <div className="paragraph_heading">
        <p>8-боб: Оллоҳнинг ор-номуси ҳақида</p>
      </div>

      <div className="main_text">
        <p><span className="vitalic"> Нурлуқ (р.а.) ривоят қилишича Исо (а.с.) шогирдларига дуо қилиш ҳақида таълим берганларидан сўнг, мана бу масални айтиб берган эканлар: </span>«Айтайлик, сиз ярим кечаси қўшнингиз эшигини тақиллатиб: “Дўстим, икки нон қарз бериб тур, бир ошнамиз узоқдан келиб қолди, олдига қўйишга ҳеч нарсам йўқ”, десангиз, у сизга: “Мени безовта қилма, эшигим қулф, болаларим ухлаб ётибди, мен ҳозир сенга ҳеч нарса беролмайман”, деб айтадими? Ҳеч қачон! Ҳатто агар дўстингиз бўлгани учун бермаса ҳам, ор-номуси бўлгани учун ўрнидан туриб, нимаики керак бўлса сизга беради».</p>
      </div>

      <div className="paragraph_heading">
        <p>9-боб: “Бу ҳақда ҳеч кимга айтманглар”</p>
      </div>

      <div className="main_text">
        {openBubbles['bubble3'] && (
          <div className="speech-bubble" onClick={() => toggleBubble('bubble3')}>
            <p>
              <sup>3</sup> Миррих (р.а.) нинг мусаннафида ёзилишича: «Улар
              шундан кейин ҳеч кимга бу ҳақда ҳеч нарса демадилар. Аммо
              расулуллоҳнинг ўлимдан тирилиш ҳақидаги гапларини тушунмаган
              эдилар».
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble3')}>
          <span className="vitalic"> Атоуллоҳ (р.а.) ривоят қилади: </span>
          «Тоғдан тушаётганларида Исо (а.с.) шогирдларига: «То Инсон Ўғли ўлиб
          тирилмагунча кўрганларингизни ҳеч кимга айтманглар!» деб буюрадилар.
          <sup>3</sup>
        </p>
      </div>

      <div className="main_text">
        <p>Шогирдлари шунда: «Устоз, нега ўлиб-тирилиш ҳақида гапиряпсиз? Фақиҳлар аввал Илёс пайғамбар келиши керак, деб айтишади-ку!» деб сўрадилар.</p>
      </div>

      <div className="main_text">
        <p>У киши: «Ҳа, аввал Илёс келиб ҳамма нарсани тартибга солиши керак, — дедилар. — Лекин сизларга айтсам, Илёс аллақачон келган, одамлар уни танимай, у билан билганларини қилдилар. Энди Инсон Ўғли ҳам муқаррар уларнинг қўлида азоб чекади».</p>
      </div>

      <div className="main_text">
        <p>Шунда шогирдлар расулуллоҳнинг Яҳё пайғамбар ҳақида гапираётганини англадилар».</p>
      </div>

      <div className="paragraph_heading">
        <p>10-боб: Осмон Салтанати нимага ўхшайди ...</p>
      </div>

      <div className="main_text">
        <p><span className="vitalic"> Миррих (р.а.) саҳобалардан, улар эса Исо (а.с.) нинг тилидан ривоят қилади: </span>«Илоҳий Салтанатни ерга уруғ сепган одамга ҳам ўхшатиш мумкин. Кеч кирса ётади, тонг отса туради, лекин уруғнинг қандай униб, қандай ўсаётганини билмайди. Ер ўзи аввал гиёҳни, кейин бошоқни, кейин эса донни етиштириб беради. Ҳосил пишгач, деҳқон келиб, дарров ўришни бошлайди».</p>
      </div>
    </main>
  );
}