'use client';

 
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function TeachingsThree() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble4',
    'bubble5',
  ]);

  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>11-боб: Вафоти ҳақида шогирдларини огоҳлантириши</p>
      </div>

      <div className="main_text">
        {openBubbles['bubble4'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble4')}
          >
            <p>
              <sup>4</sup> Атоуллоҳ (р.а.) нинг ривоят қилишича, шогирдлар
              ўшанда у кишининг “мени ўлдиришади” деган гапидан қаттиқ хафа
              бўлган эканлар.
            </p>
          </div>
        )}

        <p onClick={() => toggleBubble('bubble4')}>
          <span className="vitalic">
            Миррих (р.а.) Сафвон (р.а.) дан ривоят қилиб айтади:{' '}
          </span>
          «Кейин Жалила вилоятидан ўтдик. Расулуллоҳ, шогирдларим билан бирга
          бўлай, уларга таълим берай деб, ўзларининг қаерда эканини халққа
          билдиргиси келмаётган эди. Сўнг бизга: «Инсон Ўғли таслим қилинади,
          ўлдирилади, кейин учинчи куни қайта тирилади», дедилар. Аммо биз бу
          гапларни яхши тушунмадик, тушунтириб беринг, деб айтишга эса
          қўрқдик».
          <sup>4</sup>
        </p>
      </div>

      <div className="paragraph_heading">
        <p>12-боб: Хардал уруғи ва хамиртуруш масали</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Миррих (р.а.) ривоят қилади: «Исо (а.с.) дедилар:{' '}
          </span>
          «Илоҳий Салтанатни далага экилган хардал уруғига ҳам ўхшатиш мумкин.
          Бу уруғ уруғлар ичида энг кичкинаси бўлса ҳам, ўсиб чиққандан кейин
          ҳамма ўтлардан баланд бўлиб, охири бир дарахтга айланадики, ҳатто
          қушлар келиб, шохларига ин қуради».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>13-боб: Пайғамбарларни қатл қилувчи шаҳар!</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Нурлуқ (р.а.) нинг ривояти: </span>
          «Бир куни бир нечта тақводорлар келиб расулуллоҳга: «Бу ердан кетинг,
          Ҳирод сизни ўлдирмоқчи», деб хабар беришди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Исо (а.с.) эса: «Бориб у тулкига айтинглар, менинг ишим ҳали тугагани
          йўқ, яна неча кун жинларни ҳайдайман, одамларни даволайман, — деб
          жавоб бердилар. — Хизматимни давом эттиравераман, чунки
          пайғамбарларнинг Қуддусдан бошқа жойда қатл қилиниши мумкин эмас.
        </p>
      </div>

      <div className="main_text">
        <p>
          Эҳ Қуддус, Қуддус! Пайғамбарларнинг қотили, расулларни тошбўрон
          қилғучи шаҳар! Неча бор мен жўжаларини қанотига оладиган қуш каби
          сенинг фарзандларингни тўпламоқчи бўлдим, лекин сен истамадинг! Энди
          Оллоҳ сизлардан юз ўгиради, уйларингиз ҳувиллаб қолади! То сизлар:
          “Оллоҳ номидан келаётган муборакдур!” дейдиган кун келмагунча энди
          мени бошқа кўрмайсизлар».
        </p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Нурлуқ (р.а.) Сафвон (р.а.) дан ривоят қилади:{' '}
          </span>
          «Бир куни расулуллоҳга ҳоким Пилатнинг жалилаликларни қатл қилгани
          ҳақида хабар келди. Пилат уларни қурбонлик келтираётган пайтда
          ўлдирган, қонлари сўйилган ҳайвонларнинг қонига аралашиб кетган эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Устозимиз буни эшитиб дедилар: «Сиз уларни бошқаларга қараганда
          кўпроқ гуноҳкор эди, деб ўйлайсизларми? Йўқ, ундай эмас. Лекин тавба
          қилмасангиз, сизлар ҳам ҳалок бўласизлар. Силом минораси қулаганда
          ўлган ўн саккиз одам-чи? Улар Қуддусдаги бошқа одамларга қараганда
          кўпроқ гуноҳкор эдими? Йўқ. Лекин тавба қилмасангиз, сизлар ҳам улар
          каби ҳалок бўласиз».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>14-боб: Қийин кунлар келиши ҳақида</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Нурлуқ (р.а.) ривоят қилади: </span>
          «Бир куни тақводорлар Исо (а.с.) дан: «Халифат асри қачон келади?»
          деб сўрадилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Расулуллоҳ уларга: «Оллоҳнинг Халифати кўзга кўринадиган бўлиб
          келмайди. Ҳеч ким уни у ерда ё бу ерда, деб айта олмайди. Оллоҳнинг
          Халифати ичингиздадур», деб жавоб бердилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Кейин шогирдларига: «Вақти келади, Инсон Ўғлининг бир кунини кўришни
          истайсиз, лекин кўролмайсиз. Одамлар сизга, “у ана у ерда” ё “у мана
          бу ерда” деб айтганда орқаларидан борманг. Чақмоқ чақса осмоннинг бир
          буржидан иккинчи буржигача ёримайдими? Инсон Ўғли келганда ҳам шундай
          бўлади. Лекин аввал у кўп азоб чекиши ва бу авлод тарафидан рад
          этилиши лозим.
        </p>
      </div>

      <div className="main_text">
        <p>
          Инсон Ўғлининг вақти Нуҳ пайғамбарникига ўхшайди: то Нуҳ кемага
          мингунча одамлар едилар, ичдилар, уйландилар ва эрга тегдилар. Кейин
          тўфон келиб ҳаммани нобуд қилди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Лут вақтида ҳам шундай бўлди: халқ ер эди-ичар эди, сотар ва харид
          қилар эди, экин экарди, уй соларди. Лут Садўмни тарк этиши билан
          осмондан олов ва олтингугурт тушиб ҳаммани нобуд қилди. Инсон Ўғли
          зоҳир бўладиган кунда ҳам шундай бўлади. Ўша куни ҳовлида ўтирганлар
          нарсамни олай деб уйига кирмасин, даладагилар мол-мулким деб қайтиб
          келмасин. Лутнинг хотинини эсланглар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ким жонини сақлашга интилса уни йўқотади, ким жонини йўқотса уни
          сақлаб қолади. Сизларга айтаманки, ўша кеча бир ўринда ётган
          иккитанинг бири олинади, бири қолади. Тегирмон айлантираётган икки
          хотиннинг ҳам бири олинади, бири қолади». У кишидан сўрадилар:
          «Қаерда, ҳазрат?» Исо (а.с.) жавоб бердилар: «Қаерда мурда ётса,
          калхатлар ўша ерда тўпланади».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>15-боб: Шанба ҳақида баҳс</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Атоуллоҳ (р.а.), ҳазрати Исо (а.с.) нинг шогирди, ривоят қилади:{' '}
          </span>
          «Шанба кунларининг бирида биз ҳаммамиз, расулуллоҳ билан биргаликда,
          буғдойзор ёнидан ўтаётган эдик. Оч қолганимиздан буғдой бошоқларини
          кафимизда уқалаб едик. Шунда тақводорлар буни кўриб, устозимизга:
          «Қарамайсизми, шогирдларингиз шанба куни маън этилган ишни қиляпти!»
          дейишди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Расулуллоҳ бунга жавобан дедилар: «Довуд пайғамбарнинг қиссасини
          ўқимаганмисизлар? Оч қолган пайтда у киши Байтуллоҳга кириб, назр
          этилган нонлардан еган, ҳамроҳларига ҳам берган. Ҳолбуки, бу нонларни
          фақат руҳонийлар ейиши мумкин эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Китобда яна ёзилганки, маъбад қоидасига биноан, у ерда хизмат қилувчи
          руҳонийлар шанба куни дам олмасалар ҳам, айбдор бўлмайдилар. Бугун эса
          маъбаддан улуғроғи шу ерда! “Мен қурбонлик эмас, раҳм-шафқат
          қилишингизни истайман!” деган оятни тушунганингизда беайб одамларни
          айбламас эдингиз. Шанба инсон учун берилган, инсон шанба учун эмас.
          Инсон Ўғли эса шанба устидан ҳам ҳоким».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>16-боб: Талоқ қилиш мумкинми?</p>
      </div>

      <div className="main_text">
          {openBubbles['bubble5'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble5')}
          >
            <p>
              <sup>5</sup> Абдуллоҳ ибн Умар (розияллоҳу анҳу) дан ривоят қилинади: «Расулуллоҳ (соллаллоҳу алайҳи васаллам): “Ҳалол ишлар ичида Аллоҳга энг ёқимсизи — талоқдир”, дедилар.» 
              <br />
              Арабча  матни:
              «أَبْغَضُ الْحَلَالِ إِلَى اللَّهِ الطَّلاَقُ»
            </p>
          </div>
        )}
        <p  className='cursor-pointer' onClick={() => toggleBubble('bubble5')}>
          <span className="vitalic">
            Пайғамбар (с.а.в.) нинг бир ҳадисларида: «Талоқ рухсат берилган
            амалларнинг ичида энг ёмонидур», деб айтилган гап бор.<sup>5</sup> Атоуллоҳ
            (р.а.) ривоят қилади:{' '}
          </span>
          «Тақводорлар кейин синаш учун мана бу саволни бердилар: «Айтинг-чи,
          эр хотинини ҳар қандай сабаб билан талоқ қилишга ҳаққи борми?»
        </p>
      </div>

      <div className="main_text">
        <p>
          Расулуллоҳ уларга жавобан дедилар: «Ўқимагансизларми, Оллоҳ инсонни
          бошида эркак ва аёл қилиб яратди ва: “Шу сабабдан эр ота-онасини
          қолдириб, хотини билан бирлашади ва иккови бир танага айланади”,
          деди. Демак улар энди икки эмас, бир танадир. Оллоҳ қўшганини инсон
          ажратмасин».
        </p>
      </div>

      <div className="main_text">
        <p>
          Тақводорлар эса: «Унда нима учун Мусо пайғамбар: “Талоқ қилганда
          талоқ хати бериб жўнатинглар”, деб амр қилган?» деб савол беришди.
        </p>
      </div>

      <div className="main_text">
      

        <p >
          «Тошюрак бўлганингиз учун, — деб жавоб бердилар Исо ибну Марям. —
          Тошбағирлигингиз учун Мусо сизларга ажрашишга рухсат берган. Лекин
          бошида бундай эмас эди. Сизларга айтаманки, ким бевафоликдан бошқа
          сабаб билан хотинини талоқ қилса
          ва бошқага уйланса, ўзи зино қилган бўлади».
        </p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Миррих (р.а.) дан. Сафвон (р.а.) ривоят қилади:{' '}
          </span>
          «Уйга келганларида шогирдлари яна бу ҳақда сўрадилар. Исо (а.с.)
          уларга: «Кимки хотинидан ажралиб бошқага уйланса, хотинига қарши зино
          қилган бўлади. Хотин ҳам эрини ташлаб бошқага тегса зино қилади», деб
          тушунтирдилар».
        </p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Атоуллоҳ (р.а.) нинг ривояти: </span>
          «Биз буни эшитиб: «Уйланиш шунақа бўлса, уйланмаган афзал экан-да»,
          дедик. У киши эса: «Бу сўзни фақат насиб қилган одамларгина қабул қила
          олади, ҳамма эмас, — дедилар. — Чунки баъзилар бор, онадан эрлиги заиф
          бўлиб туғилади. Баъзилар бор, одамлар томонидан ахта қилинади. Яна
          баъзилар борки, Оллоҳга хизмат қилиш йўлида уйланишдан воз кечадилар.
          Бу гапни фақат кучи етган одам қабул қилсин», дедилар».
        </p>
      </div>
    </main>
  );
}