'use client';

import '../../../qisas-uzb/stories.css';
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function TeachingsNine() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble21',
    'bubble22',
    'bubble23',
    'bubble24',
    'bubble25',
  ]);

  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>60-боб: “Ташвиш қилманглар!”</p>
      </div>

      <div className="main_text">
        {openBubbles['bubble21'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble21')}
          >
            <p>
              <sup>21</sup> Оллоҳнинг расули бизга бу билан, умрдек муҳим
              нарсани ато этган Худо, энди арзимас таомни бизга бермайдими?
              Бадан ҳам кийимдан анча муҳим-ку, демоқчилар.
            </p>
          </div>
        )}

        <p onClick={() => toggleBubble('bubble21')}>
          <span className="vitalic">
            Атоуллоҳ (р.а.) ҳазрати Исо (а.с.) нинг тилидан ривоят қилади:{' '}
          </span>
          «Шунинг учун сизларга айтаман: нима еймиз, деб тирикчилик учун, нима
          киямиз, деб, баданингиз учун ташвишланманглар. Умрни ато этган Оллоҳ,
          ризқингизни ҳам етказмайдими? Бадан ато этган бўлса, кийимини ҳам
          бермайдими?
          <sup>21</sup>
        </p>
      </div>

      <div className="main_text">
        <p>
          Ана, осмондаги қушларга қаранг. Улар на экади, на ўради, на
          анборлари бор. Шунга қарамай, Эгамиз уларнинг ризқини беряпти.
          Сизлар ахир, қушлардан анча қадрлироқ эмасмисиз?
        </p>
      </div>

      <div className="main_text">
        <p>
          Ким ташвиш билан умрини ақалли бир соатга узайтира олар экан? Нима
          учун кийим деб ташвишланасиз? Даладаги гулларга қаранг. Улар на
          меҳнат қилади, на чарх йигиради. Шундоғ бўлса ҳам Оллоҳ уларни
          қанчалик ясантириб қўйибди! Сизларга айтсам, ҳатто ҳазрати Сулаймон
          ҳам ўзининг шон-шавкат чўққисида улардек кийинган эмас. Бугун бор,
          эртага йўқ бўладиган ўтларни Оллоҳ шунчалик кийинтирган бўлса,
          сизларни улардан кам кўрадими, эй имони сустлар?!
        </p>
      </div>

      <div className="main_text">
        <p>
          Шундай экан, нима еймиз ё нима киямиз, деб ташвишланиб юрманг. Худони
          билмайдиган одамлар доим мана шу нарсаларнинг ғамида юради. Ахир,
          сизнинг барча муҳтожлигингиз самодаги Парвардигоримизга аён-ку!
        </p>
      </div>

      <div className="main_text">
        <p>
          Сизлар биринчи навбатда Илоҳий Салтанат пайидан бўлинг, Оллоҳ айтган
          солиҳлик йўлидан юринг. Шунда зарур бўлган бу нарсаларнинг ҳаммаси
          сизга қўшиб берилади. Ҳа, эртанги кун учун бугун ташвиш чекманг.
          Эртанинг ташвишини эртага қўйинг. Ҳар куннинг дарди ўзига етарли».
        </p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Нурлуқ (р.а.) нинг ривоят қилишича, ўшандан кейин{' '}
          </span>
          шайтон ўн икки саҳобадан бири бўлмиш Яҳузо Исқарютийнинг қалбига йўл
          топади: «У руҳонийлар ва Байтуллоҳ жандармлари билан учрашиб, Исо
          (а.с.) ни ҳибсга олиш ҳақида тил бириктирди. Улар хурсанд бўлиб ўттиз
          кумуш танга ваъда қилдилар. Шундан сўнг Яҳузо устозини тутиб бериш
          учун қулай фурсат излай бошлади. Чунки дин пешволари Исо (а.с.) ни
          халқ олдида ҳибсга олишдан қўрқар эдилар».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>61-боб: Бошқалардан айб изламанг</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Атоуллоҳ (р.а.) ривоят қилади: </span>
          «Бошқаларга ҳукм кўзи билан қараманг, шунда сиз ҳам ҳукмга дучор
          бўлмайсиз. Чунки бошқаларга қайси кўз билан қарасангиз, сизга ҳам
          шундоғ кўз билан қаралади. Бошқаларга қандоғ ўлчов ишлатсангиз,
          сизга ҳам шундоғ ўлчов ишлатилади.
        </p>
      </div>

      <div className="main_text">
        <p>
          Нега биродаринг кўзидаги зирапчани кўрасану ўз кўзингдаги ходани
          сезмайсан? Қанақасига сен: “Эй биродар, кел, кўзингдаги зирапчани
          чиқариб бераман!” дейсан?! Ахир ўз кўзингда хода турибди-ку!
        </p>
      </div>

      <div className="main_text">
        <p>
          Эй иккиюзламачи! Олдин ўз кўзингдан ходани чиқариб ол, шунда
          биродаринг кўзидаги зирапчани олиш учун кўзинг очилади».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>62-боб: «Муқаддас нарсаларни итларга берманг!»</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Атоуллоҳ (р.а.) дан: </span>
          «Марваридларингизни тўнғизлар олдига ташламанг! Оёқости қилиб
          тепкилаб ташламасин. Муқаддас бўлган нарсани итларга берманг. Тағин
          сизларга ташланиб, тилка-пора қилмасин!»
        </p>
      </div>

      <div className="paragraph_heading">
        <p>63-боб: Сўранг, изланг, тақиллатинг</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Атоуллоҳ (р.а.) дан: </span>
          «Сўранглар, берилади! Изланглар, топасизлар. Тақиллатинглар, эшик
          очилади. Чунки сўраган ҳар бир одам олади, излаган топади,
          тақиллатганга эшик очилади.
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble22'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble22')}
          >
            <p>
              <sup>22</sup> *ИЛОН: балиқ гўшти ҳалол, илон гўшти эса ҳаром
              бўлиб, одамлар ундан ҳазар қилишган.
            </p>
          </div>
        )}

        <p onClick={() => toggleBubble('bubble22')}>
          Агар биронтангизнинг ўғли нон сўраса, тош берасизми? Ё балиқ ейман
          деса, илон берасизми?
          <sup>22</sup> Сизлар ёмон бўлсангиз ҳам, болаларингизга яхши
          нарсаларни ҳадя қиласиз. Самодаги Парвардигоримиз ҳам, сўраганларга
          яхши нарсаларни албатта беради».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>64-боб: Олтин қоида</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Атоуллоҳ (р.а.) Исо ибн Марямдан ривоят қилади: </span>
          «Бошқалар сизга нима қилишини хоҳласангиз, сиз ҳам уларга шундоғ
          қилинг. Чунки бутун Таврот ва пайғамбар оятлари ана шу ҳақда».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>65-боб: Солиҳлик йўли тор</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Атоуллоҳ (р.а.) дан: </span>
          «Тор эшикдан чиқинглар! Чунки ҳалокатга олиб борадиган эшик ва йўл
          кенг. Кўпчилик ана шу йўлни танлайди. Ҳаётга олиб борадиган эшик ва
          йўл тор! Бу йўлни топадиганлар оз».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>66-боб: Дарахтнинг қандайлигини мевасидан биласиз</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Атоуллоҳ (р.а.) ҳазрати Исо (а.с.) дан ривоят қилади: </span>
          «Сохта пайғамбарлардан эҳтиёт бўлинг. Улар қўй терисига ёпиниб
          олдингизга келаётган йиртқич бўрилардир. Уларни берадиган меваларидан
          билиб оласиз. Янтоқ узум, ё чақиртикан анжир берадими? Яхши мевани
          доим яхши дарахтдан оласиз. Ёмон дарахт эса ёмон мева беради. Яхши
          дарахт ёмон мева беролмайди, ёмон дарахт ҳам яхши мева беролмайди.
          Яхши мева бермайдиган ҳар бир дарахтни кесиб, оловга ташлайдилар.
          Сохта пайғамбарларни ҳам берадиган меваларидан билиб оласиз».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>67-боб: Ҳаёт пойдевори нима?</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Атоуллоҳ (р.а.) нинг ривояти: </span>
          «Мени “Ҳазратим, ҳазратим!” деб айтгани билан ҳамма ҳам Илоҳий
          Салтанатдан жой ололмайди. Само Салтанатига фақат самодаги
          Парвардигоримиз хоҳишини бажарувчи кишилар киради.
        </p>
      </div>

      <div className="main_text">
        <p>
          Охиратда кўплар менга: “Ҳазратим, ҳазратим! Биз сиз орқали
          пайғамбарлик қилмадикми? Сиз орқали жинларни ҳайдамадикми? Сиз орқали
          кўп мўъжизалар кўрсатмадикми?” деб айтадилар. Ўшанда мен уларга:
          “Кўзимдан йўқолинг, эй бадкорлар! Сизлар ҳеч қачон мен билан бирга
          бўлган эмассизлар!” деб айтаман.
        </p>
      </div>

      <div className="main_text">
        <p>
          Менинг гапларимни эшитиб, уларга амал қилган одам ўз уйини мустаҳкам
          бир пойдевор устига қурган доно кабидир: ёмғир ёғиб, селлар оқиб,
          қаттиқ шамол кўтарилиб, уйни йиқитмоқчи бўлибди. Лекин пойдевори
          тошдан бўлгани учун уй қуламабди. Менинг гапларимни эшитиб, уларга
          амал қилмаган одам эса ўз уйини қум устига кўтарган бефаросат одамдек:
          ёмғир ёғиб, селлар оқиб, қаттиқ шамол турган экан, уйи қулаб тушибди.
          Йиқилиб, ер билан яксон бўлибди».
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble23'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble23')}
          >
            <p>
              <sup>23</sup> Аччиқ бўлса дарахт, уни кўчирсанг, Жаннатга
              элтсангу, яхшилаб эксанг, Кавсар суви билан суғорсанг уни, Ўғит
              учун асал солсанг ҳар куни, Оқибат меваси пишгани замон, Ўшал
              аччиқ мева бўлар бегумон. (Фирдавсий.)
            </p>
          </div>
        )}

        <p onClick={() => toggleBubble('bubble23')}>
          <span className="vitalic">Атоуллоҳ (р.а.) айтадиларки: </span>
          «Жаноби расулуллоҳ ўз гапларини тугатганида тинглаётганлар ҳайрон
          бўлиб қолган эдилар. Чунки гапларида қандайдир бир қудрат, қандайдир
          бир ҳокимият борга ўхшар, мударрислар гапидан кескин фарқ қилар эди».
          <sup>23</sup>
        </p>
      </div>

      <div className="paragraph_heading">
        <p>68-боб: Бойларга берилган огоҳлантириш</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Нурлуқ (р.а.) ривоят қилишича, Исо (а.с.) ўз замонасининг бойларини
            мана бу сўзлар билан огоҳлантирганлар:{' '}
          </span>
          «Ҳолингизга вой, эй бойлар, чунки сизларнинг хурсандчилигингиз фақат
          бу дунёга маҳдуд. Эй тўқлар, ҳолингизга вой, чунки очлик даврингиз
          келади. Эй кулаётганлар, ҳолингизга вой, чунки мотам тутиб йиғлайсизлар.
          Ҳамма сизларни таъриф-у таҳсин қилса, ҳолингизга вой! Чунки уларнинг
          оталари ҳам сохта пайғамбарларни шундоғ қилганлар».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>69-боб: Инсонни нима нажис қилади?</p>
      </div>

      <div className="main_text">
        {openBubbles['bubble24'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble24')}
          >
            <p>
              <sup>24</sup> Миррих (р.а.) нинг мусаннафида таомдан олдин таҳорат
              олиш ҳақида изоҳ берилган. У ерда ёзилишича, яҳудийларнинг
              аксарияти — айниқса тақводорлар гуруҳи, ота-боболар урфига кўра
              қўлларига таҳорат олмаса таом емас, бундан ташқари идиш-товоқлар
              учун ҳам махсус таҳорат қоидалари мавжуд бўлган.
            </p>
          </div>
        )}

        <p onClick={() => toggleBubble('bubble24')}>
          <span className="vitalic">Атоуллоҳ (р.а.) ривоят қилади: </span>
          «Бир куни Қуддусдан келган тақводорлар ва фақиҳлар устозимиздан:
          «Нега сизнинг шогирдларингиз ота-боболар тутган йўлга риоя
          қилишмайди? Таом ейишдан олдин қўлларига таҳорат тортмайди?» деб
          сўрадилар.
          <sup>24</sup>
        </p>
      </div>

      <div className="main_text">
        <p>
          «Сизлар эса тутган йўлимиз шу деб Оллоҳнинг амрига итоат қилмаяпсиз!
          — деб жавоб бердилар у киши. — Оллоҳ “Ота-онангни эъзозла!” деб амр
          қилган. “Ким отасини ё онасини ҳақорат қилса ўлимга маҳкум” деган оят
          ҳам бор. Сизлар-чи? Сизлар: “Кимки ота-онасига сизларга берадиган
          улушимни Оллоҳ йўлига бағишладим, деса, ота-онасини эъзозлаши шарт
          эмас”, дейсизлар. Шу билан, урф-одатимиз деб, Оллоҳнинг сўзини йўққа
          чиқаряпсизлар. Эй иккиюзламачилар! Ишаъё пайғамбар: “Бу халқ Мени
          фақат тилда ҳурмат қилади, қалблари Мендан узоқда. Қилаётган
          ибодатлари беҳуда, чунки Менинг амрларим ўрнига, инсоний
          қонун-қоидаларни таълим бермоқда”, деб сизлар ҳақингизда башорат
          қилган эди», дедилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Кейин халқни чақириб: «Яхшилаб тушуниб олинглар. Оғизга кираётган
          нарса эмас, оғиздан чиқаётган нарса одамни нажис қилади», дедилар.
          Бироздан сўнг бир неча шогирди келиб: «Устоз, тақводорлар гапингизни
          ҳақорат деб қабул қиляпти», дедилар. Оллоҳнинг расули эса:
          «Парвардигорим экмаган ҳар қандай ниҳол суғуриб ташланади. Кўр кўрни
          етакласа, иккаласи ҳам чоҳга қуламайдими? Бу кўр раҳнамоларни ўз
          ҳолларига қўйинг», дедилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шунда Сафвон: «Ҳалиги масални бизга тушунтириб беринг-чи», деб
          илтимос қилди.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>70-боб: Юракдан чиққан нарсалар инсонни нажис қилади</p>
      </div>

      <div className="main_text">
        {openBubbles['bubble25'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble25')}
          >
            <p>
              <sup>25</sup> Миррих (р.а.) нинг мусаннафида қўшимча қилиб,
              бойлик ҳирси, ҳийла, ишратпарастлик, ёмон кўз, такаббурлик ва
              аҳмоқчилик каби сифатлар ҳам зикр қилинган.
            </p>
          </div>
        )}

        <p onClick={() => toggleBubble('bubble25')}>
          «Ҳали ҳам тушунмадингизми, — дедилар расулуллоҳ. — Оғизга кирадиган
          нарсалар қоринга тушиб, кейин танадан чиқиб кетади. Оғиздан чиқадиган
          нарсалар эса юракдан чиқади. Инсонни ана шу нарсалар нажис қилади.
          Чунки ҳамма ёмон нарсалар: ёмон ўйлар,
          <sup>25</sup> қотиллик, зино, бузуқликлар, ўғирлик, ёлғон гувоҳлик
          бериш, куфр, ҳақорат юракдан чиқади. Одамни мана шу нарсалар нажис
          қилади. Таҳорат тортмай таом ейиш одамни нажис қилмайди».
        </p>
      </div>
    </main>
  );
}