'use client';

import '../../../qisas-uzb/stories.css';
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function TeachingsFive() {

  return (
    <main className="stories relative">
      <div className='paragraph_heading'><p>24-боб: “Ким сенга ҳуқуқ берди?”</p></div>
      <div className='main_text'>
      <p><span className='vitalic'> Атоуллоҳ (р.а.) ривоят қилади: </span> «Исо (а.с.) Байтуллоҳда таълим бераётганида, бош руҳонийлар ва халқ пешволари у кишининг олдига келиб: «Айт-чи, бу ишларни қилишга ким сенга ҳуқуқ берди?» деб сўрадилар.</p>
      </div>
      <div className='main_text'>
      <p>Шунда расулуллоҳ: «Мен ҳам сизларга бир савол берай, жавоб берсангиз ким ҳуқуқ берганини айтаман, — дедилар. — Яҳёнинг таълимотига ким ҳуқуқ берган эди, Оллоҳми ёки башар?»</p>
      </div>
      <div className='main_text'>
      <p>Улар бир четга чиқиб ўзаро: «Агар Оллоҳ десак, нега унга эътиқод қилмадингиз, дейди. Агар башар десак,  халқ бизни тошбўрон қилади, чунки  ҳамма Яҳёни пайғамбар деб ҳисоблайди!» деб маслаҳат қилишди. Кейин келиб: «Билмаймиз», дедилар. «Мен ҳам бу ишларга ким ҳуқуқ берганини сизларга айтмайман», деб жавоб бердилар Исо (а.с.)».</p>
      </div>
      <div className='paragraph_heading'><p>25-боб: Устозимиз келишига қандай тайёргарлик кўрамиз?</p></div>
      <div className='main_text'>
      <p><span className='vitalic'> Атоуллоҳ (р.а.) Исо (а.с.) дан эшитиб ривоят қилади: </span> «Расулуллоҳ дедилар: «Инсон Ўғли албатта қайтиб келади.  Ўшанда Илоҳий Салтанатни куёв кутиб олиш учун чиққан ўнта қизга ўхшатиш мумкин. Улардан бештаси ақлли, бештаси бефаросат экан.</p>
      </div>
      <div className='main_text'>
      <p>Бефаросат қизлар чироқларини олибди-ю, ўзлари билан бирга қўшимча ёғ олмабди. Ақлли қизлар эса ўзлари билан бирга идишларга ёғ ҳам олишибди. Куёв кечикиб, ҳамма ухлаб қолибди.</p>
      </div>
      <div className='main_text'>
      <p>Бир вақт, тун яримда: «Куёв келяпти, кутиб олинглар», деган овоз янграбди. Қизлар туриб, чироқларини тайёрлашибди. Бефаросат қизлар қараса, чироқлардаги ёғ тугаб, ўчай-ўчай деб турган экан. Ақлли қизлардан ёғ сўрашса, улар: «Биздаги ёғ, ҳам бизга, ҳам сизга етмайди. Яхшиси бориб, ёғфурушдан ёғ сотиб олинг», деб жавоб беришибди. Лекин улар ёғ олишга кетишлари билан куёв етиб келибди. Тайёр турган қизларнинг ҳаммаси куёв билан бирга тўйхонага кириб, орқаларидан эшик ёпилибди.</p>
      </div>
      <div className='main_text'>
      <p>Бир оздан сўнг ёғ излашга кетган бешта қиз қайтиб келиб дарвозани тақиллатиб: “Очинглар, дарвозани очинглар, биз келдик!” дебди. Куёв эса: «Йўқ, сизлар бизга бегонасиз», деб дарвозани очмабди. Шунга ўхшаб, ҳушёр бўлиб туринглар, чунки сизлар ҳам менинг қачон қайтиб келишимни, қайси кунда ва қайси соатда келишимни билмайсизлар!»</p>
      </div>

      <div className='paragraph_heading'><p>26-боб: Бўйсуниш сўзда эмас, амалда бўлсин</p></div>

      <div className='main_text'>
        <p><span className='vitalic'> Атоуллоҳ (р.а.) ривоят қилишича, Исо (а.с.) Бани Исроил пешволарига бундоқ деб савол берадилар: </span> «Мана бу гапга нима дейсизлар, бир одамнинг икки ўғли бор экан. Бир куни у бир ўғлига: «Ўғлим, бугун бориб узумзорда ишла», дебди. У эса: «Йўқ, бормайман», дебди. Лекин кейин, айтган гапига пушаймон бўлиб, узумзорга кетибди.</p>
      </div>
      <div className='main_text'>
      <p>Отаси иккинчи ўғлига ҳам: «Бугун узумзорда қиладиган иш бор, бормайсанми?» дебди. Ўғли: «Хўп бўлади, ҳазрат», дебди-ю бормабди. Нима деб ўйлайсизлар, бу икки ўғилдан қайси бири отасининг хоҳишини бажарди?»</p>
      </div>
      <div className='main_text'>
      <p>«Биринчиси», деб жавоб беришди улар.</p>
      </div>
      <div className='main_text'>
      <p>«Сизларга айтаманки, солиқчи ва фоҳишалар сизлардан олдин Оллоҳнинг Салтанатидан жой олмоқда, — дедилар расулуллоҳ. — Яҳё пайғамбар солиҳлик йўлини тарғиб қилганда сизлар эмас, фоҳишаю солиқчилар унга ишонди. Сизлар шундан кейин ҳам тавба қилмадингиз, имон келтирмадингиз».</p>
      </div>

      <div className='paragraph_heading'><p>27-боб: Бойлик ва вафо</p></div>

      <div className='main_text'>
      <p><span className='vitalic'> Нурлуқ (р.а.) саҳобалардан эшитиб ривоят қиладики, расулуллоҳ бундоғ деган эканлар: </span> «Сизларга айтаманки, дўст топиш йўлида чиркин пулни сарфланглар, токи пул тугагач, мангу уйларга қабул қилинасиз. Кичик нарсада ишончли бўлган одам катта нарсада ҳам ишончли бўлади. Озгина нарсада ҳалол бўлмаган одам катта нарсада ҳам ҳалол бўлмайди. Шундай экан, агар чиркин пулни ишлатишда ишончли бўлмасангиз, ҳақиқий бойликни ким сизга ишониб топширади?! Бошқаларга тегишли бўлган нарсада содиқ бўлмасангиз, сизга тегишли нарсани ким сизга беради?»</p>
      </div>

      <div className='main_text'>
        <p>Пулни яхши кўрадиган тақводорлар бу гапларни эшитиб, расулуллоҳнинг устидан кулдилар. Шунда у киши уларга: «Сизлар ўзингизни одамлар олдида тақволи қилиб кўрсатасизлар, лекин қалбингизда нима борлигини Оллоҳ билади, — дедилар. — Чунки одамлар улуғ деб билган нарса Оллоҳнинг олдида жирканч».</p>
      </div>

      <div className='paragraph_heading'><p>28-боб: Ижарачи боғбонлар масали</p></div>

      <div className='main_text'>
      <p><span className='vitalic'> Нурлуқ (р.а.) да ёзилишича, Исо (а.с.) Исроил пешволарига мана бу масални ҳам айтган эканлар: </span>  «Бир одам узумзор яратибди. Кейин уни боғбонларга шерикликка бериб, ўзи узоқ муддатга бошқа бир юртга бориб жойлашибди.</p>
      </div>
      <div className='main_text'>
      <p>Ҳосил пайти келгач, у бир хизматкорини, улушимизни олиб кел, деб боғбонларнинг олдига юборибди. Боғбонлар эса уни калтаклаб, ҳеч нарса бермай қуруқ қўл билан орқага қайтаришибди. Шундан сўнг боғ эгаси бошқа бир хизматкорини юборибди. Боғбонлар уни ҳам уриб, шарманда қилиб, ҳеч нарса бермай жўнатишибди. Боғ эгаси учинчи хизматкорини юборибди. Улар уни ҳам уриб, ярадор қилибди.</p>
      </div>
      <div className='main_text'>
      <p>«Энди нима қилсам экан?» дебди узумзор эгаси. Кейин: «Суюкли ўғлимни юборай, боғбонлар ундан уялар», деб яхши кўрган ўғлини уларнинг олдига юборибди. Боғбонлар эса хўжайиннинг ўғлини кўриб, ўзаро маслаҳатлашиб: “Ана, ворис келяпти. Ўлдирсак, мерос ўзимизга қолади”, деб йигитни ташқарига олиб чиқиб ўлдиришибди».</p>
      </div>
      <div className='main_text'>
      <p>Шу гаплардан сўнг Исо (а.с.): «Хўш, энди боғ эгаси бу боғбонларни нима қилади? — деб сўрадилар. — У келиб боғбонларни йўқ қилади, узумзорни эса бошқаларга беради».</p>
      </div>
      <div className='main_text'>
      <p>Буни эшитиб халқ: «Худо сақласин, Худо сақласин!» деб ёқа ушлади. «Унда, — дедилар у киши уларнинг юзига тикилиб. — Қурувчилар керак эмас деб қайтарган тош бино пойдеворининг энг муҳим еридан жой олди, деган оятнинг маъноси нима? Ким бу тошга қоқинса, қаттиқ жароҳат ейди. Тош кимнинг устига тушса, мажақлаб ташлайди».</p>
      </div>
      <div className='main_text'>
      <p><span className='vitalic'> Атоуллоҳ (р.а.) ривоят қилади: </span> «Расулуллоҳ кейин: «Шу сабабдан сизларга айтаманки, Оллоҳ таоло Ўз салтанатини сизлардан олиб, мева берадиган бошқа қавмларга ато этади», дедилар. Бош руҳонийлар ва тақводорлар ўзлари ҳақида айтилган бу масалларни эшитиб, Исо (а.с.) ни ҳибсга олмоқчи бўлдилар, лекин қўрқдилар. Чунки халқ у кишини пайғамбар деб ҳисоблар эди».</p>
      </div>
      <div className='paragraph_heading'><p>29-боб: Раббимиз саховатига таянинг</p></div>
      <div className='main_text'>
      <p><span className='vitalic'>  Нурлуқ (р.а.) ривоят қилади: </span> «Бир бойнинг бир ишбошқарувчиси бор экан. Бир куни бойнинг қулоғига, сизнинг иш бошқарувчингиз мол-мулкингизни бежо харжлаб юрибди, деган гап етиб келибди. Кейин у ишбошқарувчисини чақириб: «Сен ҳақингда фалон-фалон гаплар эшитдим, ҳисоб-китобингни топшир, энди менда ишламайсан», дебди.</p>
      </div>
      <div className='main_text'>
      <p>Ишбошқарувчиси ташқари чиқиб: “Энди нима қилсам экан? — деб ўйланар эмиш. — Эрта-индин хўжайин мени ишдан ҳайдайди. Кетмон чопишга кучим етмайди, тиланчилик қилишга уяламан. Ҳа, бундай қиламан! Шунда ишсиз қолган пайтимда одамлар мени яхши қабуллайди”, дебди-да хўжайинидан қарзи бор одамларнинг ҳаммасини бирма-бир олдига чақиртирибди.</p>
      </div>
      <div className='main_text'>
      <p>Биринчисидан: «Хўжайинимдан қанча қарзинг бор?» деб сўрабди. «Юз кува мой», дебди у. «Тилхатингни ол. Тез ўтириб эллик кува деб ёз!» дебди ишбошқарувчи. Иккинчисидан: «Сен қанча қарзсан?» деб сўрабди. «Ўттиз арава буғдой». «Тилхатингни ол-да, йигирма арава деб ёз», дебди унга ҳам.  Бошқа одамларга ҳам шундоғ дебди.</p>
      </div>
      <div className='main_text'>
      <p>Хўжайини эса кейин бу фосиқ иш бошқарувчини ақлли иш қилдинг, деб мақтабди. Ҳақиқатдан ҳам бу дунёнинг фарзандлари ўз одамлари билан иш қилганда Нур фарзандларига нисбатан ақллироқ йўл тутадилар».</p>
      </div>
    </main>
  )      
}