'use client';

import '../../../qisas-uzb/stories.css';
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function TeachingsEight() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble17',
    'bubble18',
    'bubble19',
    'bubble20',
  ]);

  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>50-боб: Ўч олиш ҳақида</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Атоуллоҳ (р.а.) Оллоҳнинг расулидан мана бу гапларни ҳам ривоят
            қиладилар:{' '}
          </span>
          «Кўзга кўз, тишга тиш», деб айтилганини ҳам эшитгансизлар. Мен эса
          сизларга айтаман: ёмонликка ёмонлик билан жавоб берма. Агар биров
          ўнг чаккангга урса, иккинчисини ҳам унга тут; биров сен билан
          даволашиб, кўйлагингни олмоқчи бўлса, тўнингни ҳам қўшиб бер. Ким
          сени бир чақирим йўл юришга мажбур қилса, у билан икки чақирим юр.
          Сўраганга бер, қарз олмоқчи бўлгандан юз ўгирма».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>51-боб: «Душманларингизни севинг»</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Ҳазрати Исо (а.с.) нинг таълимотларидан бири рақибларимизга нисбатан
            қандай муносабатда бўлиш кераклиги ҳақида. Атоуллоҳ (р.а.) ривоят
            қилади:{' '}
          </span>
          «Яқинингга меҳр қўй, душманингдан нафратлан, деб айтилганини ҳам
          эшитгансизлар. Лекин мен сизларга айтаман: душманларингизга ҳам
          меҳрли бўлинг, сизларга зулм ўтказганларни дуо қилинг. Шунда
          самодаги Парвардигоримизга муносиб банда бўласизлар. Чунки У Ўз
          қуёшини яхшилар устига ҳам, ёмонлар устига ҳам порлатади, ёмғирини
          яхшиларнинг ҳам, ёмонларнинг ҳам даласига ёғдиради.
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble17'] && (
          <div
            className="speech-bubble -mt-10"
            onClick={() => toggleBubble('bubble17')}
          >
            <p>
              <sup>17</sup> Халқ ўша даврда солиқчиларни ёмон кўрган. Чунки улар
              ўз миллатини талар, қариндош-уруғларининг пулини олиб, бутпараст
              римликлар билан бўлишар эди.
            </p>
          </div>
        )}

        <p onClick={() => toggleBubble('bubble17')}>
          Агар фақат ўзингизни севганларнигина севсангиз, нима учун Оллоҳдан
          мукофот оламан деб ўйлайсиз? Солиқчилар
          <sup>17</sup> ҳам шундай қилмайдими?
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble18'] && (
          <div
            className="speech-bubble mt-10"
            onClick={() => toggleBubble('bubble18')}
          >
            <p>
              <sup>18</sup> Саломлашиш ўз ичига кенг маъно олади. Салом берар
              эканмиз, биз одамларга Оллоҳдан барака, тинчлик ва меҳр-оқибат
              тилаймиз.
            </p>
          </div>
        )}

        <p onClick={() => toggleBubble('bubble18')}>
          Агар фақат ўз биродарларингиз билан саломлашсангиз, бошқалардан ортиқ
          иш қилдим, деб ўйлайсизми? Худони билмайдиганлар ҳам шундай
          қилмайдими?
          <sup>18</sup> Бинобарин, осмондаги Парвардигоримиз каби сизлар ҳам
          меҳр-муҳаббатда комил бўлинглар».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>52-боб: Ўлим соати бўсағада ...</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Атоуллоҳ (р.а.) ривоят қилади: </span>
          «Қурбонлик байрами яқин эди. Устозимиз бизга: «Икки кундан сўнг
          байрам. Инсон Ўғлини ўша куни хочга михлаш учун ҳибсга олишади», деб
          айтдилар. Дарҳақиқат ўша пайт, халқ пешволари олийруҳоний Қаёфанинг
          саройида йиғилиб, расулуллоҳни ҳибсга олиш ва ўлдиришни
          режалаштираётган эди. «Фақат байрам пайтида эмас, — дейишди улар. —
          Бўлмаса, халқ қўзғолон кўтариши мумкин».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>53-боб: Иккиюзламачи бўлманг</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Атоуллоҳ (р.а.) расулуллоҳдан ривоят қилади: </span>
          «Савоб ишларингизни одамларга кўрсатиш учун қилманг,
          Парвардигоримиздан мукофот ололмайсиз. Масалан, муҳтожга нимадир
          берсанг, кейин риёкорларга ўхшаб ҳаммага жар солма. Улар одамлардан
          мақтов олиш учун кўча-кўйда, тиловатхоналарда бундай қиладилар.
          Сизларга айтаманки: уларга ана шу мақтовдан бошқа мукофот берилмайди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Сен эса, яхшилик қилсанг ўнг қўлинг қилган ишни чап қўлинг билмасин.
          Қилган яхшилигинг яширин қолсин. Яширин нарсаларни кўрувчи
          Парвардигоримиз Ўзи сенга мукофот тайин этади».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>54-боб: Дуо қилиш ҳақида</p>
      </div>

      <div className="main_text">
        {openBubbles['bubble19'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble19')}
          >
            <p>
              <sup>19</sup> Расулуллоҳ бу билан, Оллоҳ энди уларга мукофот
              бермайди, деб айтмоқдалар.
            </p>
          </div>
        )}

        <p onClick={() => toggleBubble('bubble19')}>
          <span className="vitalic">Атоуллоҳ (р.а.) ривоят қилади: </span>
          «Дуо қилишда ҳам иккиюзламачиларга ўхшаманг. Улар тиловатхоналарда ва
          кўча бурчакларида ўзларини халққа кўрсатиш учун дуо ўқишни яхши
          кўрадилар. Сизларга айтаманки, улар ўз мукофотини шу ерда — одамлардан
          оладилар.
          <sup>19</sup>
        </p>
      </div>

      <div className="main_text">
        <p>
          Сен эса, дуо қилмоқчи бўлсанг, уйингга кир. Эшигингни ёпиб, хилватда
          Парвардигоримизнинг Ўзига гапир. Шунда, яширин нарсаларни кўрувчи
          Парвардигоримиз сени тақдирлайди. Дуо қилганда, бутпарастларга ўхшаб
          пуч гапларни қайта-қайта такрорлама. Улар, кўп гапирсак Худо
          дуоларимизни эшитади, деб ўйлайдилар. Уларга ўхшаманг, ахир
          Парвардигоримиз нимага муҳтож эканимизни сўрашимиздан олдин билади!»
        </p>
      </div>

      <div className="paragraph_heading">
        <p>55-боб: Дуо намунаси</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Исо (а.с.) кейин шогирдларига дуо қилиш ҳақида бундоқ дейдилар.
            Атоуллоҳ (р.а.) нинг ривояти:{' '}
          </span>
          «Сизлар мана бу тахлитда дуо қилинглар: «Ё самодаги Парвардигоримиз,
          Сенинг муқаддас исминг ҳамиша улуғлансин! Салтанатинг ҳамма жойда
          барпо бўлсин! Арши аълодаги каби ерда ҳам Сенинг ироданг бажарилсин!
          Кундалик ризқимизни бер. Гуноҳларимиздан ўт. Биз ҳам бизга гуноҳ
          қилганларни кечиряпмиз. Васвасалардан ва шайтондан Ўзинг бизни асра!»
        </p>
      </div>

      <div className="main_text">
        <p>
          «Ҳа, — дедилар кейин Расулуллоҳ. — Агар сиз сизга ёмонлик қилганларни
          кечирсангиз, Парвардигорим ҳам сизни кечиради. Агар кечирмасангиз,
          Парвардигорим ҳам сизни кечирмайди».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>56-боб: Рўза ҳақида</p>
      </div>

      <div className="main_text">
        <p>«Рўза тутганингизда мунофиқларга ўхшаб қовоқ солиб юрманг. Улар  рўзадорлигини одамларга  кўрсатиш учун юзини хунук кўринишга солади. Сизларга  айтаманки, улар ўз мукофотларини олиб бўлдилар.

        Сен рўза тутганингда,  юзингни юв, бошингга мой сурт. Рўза тутаётганингни одамлар эмас, балки ғойибдаги Валинеъматинг кўрсин. Яширин нарсаларни кўрувчи Оллоҳ сени тақдирлайди.”
        </p>
      </div>

      <div className="paragraph_heading">
        <p>57-боб: Хазинанинг асли осмонда</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">Атоуллоҳ (р.а.) расулуллоҳдан ривоят қилади: </span>
          «Ер юзида куя ейдиган, занг босадиган, ўғри уриб кетадиган хазиналар
          йиғиб юрманг. Яхшиси у дунё учун хазина тўпланг. Чунки у ерда
          хазинангизни куя ҳам емайди, занг ҳам босмайди, ўғри ҳам олмайди.
          Хазинангиз қаерда бўлса, кўнглингиз ҳам ўша ерда бўлади».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>58-боб: «Кўз баданнинг чироғи»</p>
      </div>

      <div className="main_text">
        {openBubbles['bubble20'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble20')}
          >
            <p>
              <sup>20</sup> Атоуллоҳ (р.а.) нинг мусаннафида: «Агар ичингдаги
              “ёруғ” деб ўйлаган нарсанг қоронғилик бўлиб чиқса, демак сен
              қанчалик даҳшатли зулмат қўйнига ботган экансан!» деган сўзлар
              ҳам бор.
            </p>
          </div>
        )}

        <p onClick={() => toggleBubble('bubble20')}>
          <span className="vitalic">
            Нурлуқ (р.а.) саҳобалардан ҳазрати Исо ибн Марям айтган мана бу
            гапларни ривоят қилган:{' '}
          </span>
          «Кўз баданнинг чироғи. Агар кўзинг тиниқ бўлса, тўқ бўлса, бутун
          вужудинг ёруғ бўлади. Агар кўзинг оч бўлса, ёмон бўлса, бутун
          вужудинг ҳам зулматга ботади. Шу сабабдан ичингдаги нур зулмат
          эмаслигига таважжуҳ қил. <sup>20</sup> Агар бутун вужудинг равшан бўлиб,
          бирон жойида зулмат бўлмаса, сен ўзидан нур сочадиган бир машъал каби
          бўласан».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>59-боб: «Ҳам пулга ва ҳам Оллоҳга қулчилик қила олмайсиз»</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Атоуллоҳ (р.а.) ривоят қилишича, Исо (а.с.) яна бундоғ деб айтган
            эканлар:{' '}
          </span>
          «Ҳеч ким икки хўжайинга қул бўлолмайди. У ё бирини ёмон кўриб,
          иккинчисини севади; ё бирига ихлос қўйиб, бошқасига паст назар билан
          қарайди. Сизлар ҳам бир вақтнинг ўзида ҳам Оллоҳга ва ҳам Бойликка
          хизмат қила олмайсизлар».
        </p>
      </div>
    </main>
  );
}