'use client';

 
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function TeachingsTen() {

  return (
    <main className="stories">  
      <div className='paragraph_heading'><p>71-боб: Ўн икки шогирднинг хизматга чиқиши</p></div>
      <div className='main_text'>
      <p>Кейин  Исо (а.с.) ўн икки шогирдига жинларни ҳайдаш, касалларга шифо бериш қудратини бериб, Илоҳий Салтанатни овоза этишлари учун  иккита-иккитадан қилиб хизматга жўнатадилар. <span className='vitalic'> Атоуллоҳ (р.а.) нинг ривоят қилишича Исо (а.с.) уларга бундай деб насиҳат қилган эканлар: </span> «Ғайри яҳудийларнинг қишлоғига, сомирийларнинг шаҳарларига кирманглар. Мен сизларни ҳозир Исроилнинг адашган қўйлари олдига юборяпман. Қаерга борсангиз, “Оллоҳнинг Салтанати келди”, деб эълон қилинглар. Касалларга шифо беринг, ўликларни тирилтиринг, моховларни покланг, жинларни ҳайданг. Текинга олдингиз, текинга беринг. Сафар учун ўзларингиз билан на пул, на халта, на ортиқча кийим, ҳеч нарса олманглар. Чунки ишчи ўзининг нон-насибасига ҳақдор.</p>
      </div>
      <div className='main_text'>
      <p>Қайси шаҳар ё қишлоққа кирсангиз, ўша ердан ўзингизга муносиб бир одам топиб, то кетгунча уникида туринг. Уйдан-уйга кўчиб юрманг. Уйга кирар экансиз, ўша уйга салом тиланг.</p>
      </div>
      <div className='main_text'>
      <p>Агар сизларни қабул қилишмаса, у уй ё шаҳардан чиқаётганингизда оёқларингиздаги чангни қоқиб чиқинг. Сизларга айтаманки, Ҳукм Кунида Садўмнинг ҳоли бу шаҳар аҳлининг ҳолидан енгилроқ бўлади. Мана, мен сизларни худди қўйларни бўрилар орасига юборгандек юборяпман. Илондай зийрак, каптардай беозор бўлинглар».</p>
      </div>
      <div className='paragraph_heading'><p>72-боб: “Охиригача чидаган нажот топади”</p></div>
      <div className='main_text'>
      <p><span className='vitalic'> Атоуллоҳ (р.а.) нинг ривоят қилишича, Исо (а.с.) ўз шогирдларини оғир кунлар келиши ҳақида огоҳлантириб бундай деган эканлар: </span> «Одамлардан эҳтиёт бўлинг. Улар сизларни маҳкамаларга топширади, тиловатхоналарда калтаклайди. Менга шогирд бўлганингиз учун ҳокимлар ва подшоҳлар олдига олиб боришади. Кейин улар олдида ҳамда уларнинг одамлари олдида мен учун гувоҳ бўласизлар.</p>
      </div>
      <div className='main_text'>
      <p>Сизларни ушлаб маҳкамага олиб борганларида, нима деймиз, нимани гапирамиз, деб ташвиш қилманглар. Чунки ўша соатда керак гаплар сизларга берилади. Чунки гапирадиган сиз эмас, балки Парвардигорингиз Руҳи сизнинг тилингиздан гапиради. Ака укасини, ота фарзандини ўлимга топширади. Фарзандлар ота-онасига қарши чиқиб, уларнинг ўлимига сабаб бўлади. Менга шогирд бўлганингиз учун ҳамма сизлардан нафратланади. Лекин охиригача чидаган нажот топур.</p>
      </div>
      <div className='main_text'>
      <p>Бирон жойда сизларга озор беришса, бошқа жойга қочинг. Сизларга айтаманки, Исроилнинг барча шаҳарларини айланиб чиққунингизча Инсон Ўғли ерга қайтиб келади».</p>
      </div>
      <div className='paragraph_heading'><p>73-боб: “Қўрқманглар!”</p></div>
      <div className='main_text'>
      <p><span className='vitalic'> Атоуллоҳ (р.а.) Исо (а.с.) тилидан ривоят қилади: </span> «Шогирд устозидан, қул хўжайинидан улуғ бўлмайди. Шогирд устозидек, қул хўжайинидек бўлса бас. Агар улар уй эгасини шайтондан деб айтган бўлса, уй аҳлини нималар деб айтмайди? Шундай экан, улардан қўрқманг. Чунки менинг таълимотим яширин қолмайди, Оллоҳнинг хоҳиши бу.</p>
      </div>
      <div className='main_text'>
      <p>Мен сизларга хилватда айтган гапларни сиз халққа кўчада гапиринг. Қулоғингизга шивирлаганимни томлар устидан эълон қилинг. Ана у танни ўлдириб, жонни ўлдиролмайдиганлардан қўрқманг. Танни ҳам, жонни ҳам дўзахда ҳалок қиладигандан қўрқинг. Ахир, икки чумчуқ бир чақага сотилмайдими? Ҳатто ўлаётган чумчуқ ҳам Раббимиз эътиборидан четда эмас. Сизларнинг қадрингиз гала-гала чумчуқлардан юқори эмасми! Шундай экан, қўрқманглар. Оллоҳ ҳатто бошингиздаги сочлар сонини ҳам билади.</p>
      </div>
      <div className='main_text'>
      <p>Ким инсонлар олдида мени тан олса, мен уни арши-аълода, Оллоҳим олдида тан оламан. Ким инсонлар олдида мени рад этса, мен ҳам арши-аълода Оллоҳим олдида уни рад этаман».</p>
      </div>
      <div className='paragraph_heading'><p>74-боб: “Жонини аяган жонидан айрилади”</p></div>
      <div className='main_text'>
      <p><span className='vitalic'> Атоуллоҳ (р.а.): </span> «Мени ерга тинчлик олиб келди, деб ўйламанглар. Мен ерга қилич олиб келдим, тинчлик эмас. Чунки мен сабабли ўғил билан ота, қиз билан она, келин билан қайнона орасида ихтилоф чиқади. Чунки инсоннинг душманлари ўз хонадон аҳлидир.</p>
      </div>
      <div className='main_text'>
      <p>Отасини ё онасини мендан кўпроқ севган менга лойиқ эмас. Ўғлини ё қизини мендан кўпроқ севган менга лойиқ эмас. Кимки ўз хочини кўтариб менга эргашмаса, менга лойиқ эмас. Жонини аяган, жонидан айрилади. Мен учун жонини ато қилган, уни сақлаб қолади».</p>
      </div>
      <div className='paragraph_heading'><p>75-боб: Йўл аҳлини эъзозланг</p></div>
      <div className='main_text'>
      <p><span className='vitalic'> Атоуллоҳ (р.а.) нинг ривояти: </span> «Сизларни қабул қилган мени қабул қилган, мени қабул қилган эса мени юборганни қабул қилган бўлади. Ким бир пайғамбарни пайғамбар бўлгани учун қабулласа, пайғамбар мукофотини олади. Ким бир яхшини яхши бўлгани учун қабул қилса, яхшилар оладиган мукофотга эга бўлади. Кимки бу кичиклардан бирига менинг шогирдим бўлгани учун бир пиёла сув берса ҳам, мен сизларга айтаманки, албатта ажрига-мукофотига сазовор бўлади».</p>
      </div>
      <div className='paragraph_heading'><p>76-боб: “Иккиюзламачи диндорларга ўхшаманглар”</p></div>
      <div className='main_text'>
      <p><span className='vitalic'> Атоуллоҳ (р.а.) ривоят қилади: </span> «Фақиҳлар билан тақводорлар Китобнинг таъбирчиларидир, — дер эдилар Исо (а.с.). — Шундай экан, уларнинг айтганини қилинг, лекин қилганини қилманг. Чунки улар айтган сўзларига ўзлари риоя қилмайдилар. Одамлар устига оғир юкларни ортишади, лекин кўтариш учун бармоқларини ҳам теккизишмайди. Нимаики қилишса одамларга кўрсатиш учун қиладилар. Пешаналарига ва қўлларига осган дуо қутиларининг катталигига қаранг. Зиёфатларда тўрда, тиловатхоналарда энг яхши жойда ўтиришни, кўча-кўйда алик олишни, ҳамма уларни “устоз, устоз” деб мазаммат қилишини яхши кўрадилар.</p>
      </div>
      <div className='main_text'>
      <p>Сизлар эса “устоз” деб аталишга рози бўлманг. Чунки биргина устозингиз бор, сизлар эса бир-бирингизга биродар ва баробарсиз. Ерда ҳеч кимни “валинеъмат” деб атаманг, чунки биргина валинеъматингиз бор, У ҳам бўлса осмонда. “Раҳнамо” деб аталишга ҳам рози бўлманг, чунки биргина раҳнамонгиз бор, у ҳам бўлса Масиҳдир. Орангизда энг улуғингиз ҳаммангизга хизматкор бўлсин. Ким ўзини юқори олса, пасайтирилади. Ким ўзини паст олса, улуғланади».</p>
      </div>
      <div className='main_text'>
      <p><span className='vitalic'> Нурлуқ (р.а.) нинг мусаннафидан: </span> «Бу олимлардан эҳтиёт бўлинг, — дедилар расулуллоҳ шогирдларига таълим бераётиб. Бутун халқ эшитиб турган эди. — Улар узун-узун чопонлар кийиб, кўча ва бозорларда юришни, халқ саломига алик олишни, ибодат уйларида энг яхши жойларда, зиёфатларда тўрларда ўтиришни яхши кўрадилар. Бир томондан бевалар уйини таласа, иккинчи томондан ўзларини кўрсатиш учун узундан-узоқ дуолар ўқишади. Уларнинг жазоси жуда қаттиқ бўлғуси», дедилар».</p>
      </div>
    </main>
  )      
}