'use client';


import { useSpeechBubbles } from '@/app/hooks/useSpeechBubbles';

export default function MiraclesPartTwo() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble7',
    'bubble8',
    'bubble9',
    'bubble10',
    'bubble11',
    'bubble12',
    'bubble13',
  ]);

  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>5-боб: Шол одамнинг шифо топгани. «Қайси бирини айтиш осонроқ?»</p>
      </div>

      <div className="main_text">
        <p className="cursor-pointer" onClick={() => toggleBubble('bubble7')}>
          Бир куни Исо (а.с.) шогирдлари билан Кафру Ноҳумга ташриф буюрадилар.
          У кишининг келганини эшитиб, жуда кўп одам йиғилади.{' '}
          <span className="vitalic">
            У ерда содир бўлган мўъжиза ҳақида Нурлуқ, Миррих ҳамда Атоуллоҳ
            (р.а.) лар ўз мусаннафларида баён қилганлар. Сафвон (р.а.) дейдилар:{' '}
          </span>
          «Одамлар ичида Қуддусдан, Жалиладан ва Яҳузия ерларидан келган
          тақводорлар<sup>7</sup> ва фақиҳлар ҳам бор эди. Бир вақт бир неча
          одам, бир шолни тўшакка солиб олиб келдилар. (Оллоҳнинг шифо бериш
          салоҳияти Исо (а.с.) билан бирга эга эди.)
        </p>
         {openBubbles['bubble7'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble7')}
          >
            <p>
              <sup>7</sup> Тақво фирқасига тегишли бўлган диндорлар.
            </p>
          </div>
        )}
      </div>

      <div className="main_text">
       

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble8')}>
          Улар шолни ичкарига олиб кирмоқчи эдилар, лекин одам кўплигидан бунинг
          уддасидан чиқолмадилар.<sup>8</sup> Кейин томга чиқиб, томни очиб,
          тешигидан шолни пастга, Исо (а.с.) нинг олдларига туширдилар. У киши
          уларнинг имонини кўриб: «Эй инсон, гуноҳларинг кечирилди», дедилар.
        </p>
         {openBubbles['bubble8'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble8')}
          >
            <p>
              <sup>8</sup> Миррих (р.а.) нинг ривоятида ёзилишича, Исо (а.с.)
              таълим бераётган уй олдида одам тўлган, эшигига яқинлашиш имкони
              йўқ эди.
            </p>
          </div>
        )}
      </div>

      <div className="main_text">
        
      <p>
          Шунда у ерда ўтирган баъзи тақводор ва фақиҳлар: «Ие! У нима деяпти?
          Куфрлик қиляпти-ку! Оллоҳдан бошқа ким гуноҳларни кечира олади?» деган
          ўйларни хаёлдан ўтказдилар. 
          </p>
          
      </div>
            <div className="main_text">
              
      <p className="cursor-pointer" onClick={() => toggleBubble('bubble9')}>
          Ҳазрати Масиҳ (а.с.) уларнинг фикрини
          билиб: «Нега бундай деб ўйлаяпсизлар? Нима дейиш осонроқ: гуноҳларинг
          кечирилди, дейишми ё тур, ўрнингдан туриб уйингга кет, дейишми?»
          дедилар. Кейин: «Инсон Ўғлига гуноҳларни кечириш салоҳияти<sup>9</sup>{' '}
          берилганини билиб қўйинглар», дедилар-да шол кишига: «Сенга айтаман:
          тур, тўшагингни ол-да уйингга кет», деб амр қилдилар. 
        </p>
        {openBubbles['bubble9'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble9')}
          >
            <p>
              <sup>9</sup>{' '}
              <span className="">Қуръони каримда: </span>
              <span className="boldItalic">
                «Улар шафоатга молик бўлмаслар. Магар ким Раҳмон ҳузурида аҳду
                паймон олган бўлса (молик бўлур)»
              </span>{' '}
              <span className="">
                деган сўзлар бор (Марям сураси, 19:87). Исо (а.с.) халифа
                мақомида бўлганлари учун Оллоҳнинг изни билан гуноҳларни кечира
                олар эдилар. «Ер юзида» деган ибора ҳам бекорга келмаган. Баъзи
                олимлар фикрича, у кишининг шафоат хизмати ўша пайтдаёқ
                бошланган эди.
              </span>
            </p>
          </div>
        )}
        <p>
          Шол шу заҳоти
          ўрнидан туриб юриб кетди! Тўшагини олиб, Оллоҳга ҳамду сано айтиб,
          уйига равона бўлди. Ҳаммани даҳшат қоплаган эди. Яратганни улуғлаб:
          «Во ажабо, бугун ғаройиб бир воқеанинг шоҳиди бўлдик!» дер эдилар».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>6-боб: Дам олиш кунида шифо бериш мумкинми?</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Нурлуқ, Миррих ҳамда Атоуллоҳ (р.а.) ларнинг мусаннафларида зикр
            қилинишича Исо (а.с.) шанба куни қўли ногирон бир кишига шифо
            берадилар. Атоуллоҳ раҳматуллоҳи алайҳ ривоят қилади:{' '}
          </span>
          «Устоз кейин тиловатхонага кирдилар. У ерда қўли қуриб қолган бир одам
          бор эди. Тақводорлар Исо (а.с.) ни айблаш мақсадида: «Нима дейсиз,
          шанба куни шифо бериш ҳаромми-ҳаром эмасми?» деб сўрадилар.
        </p>
      </div>

      <div className="main_text">
        <p className="cursor-pointer" onClick={() => toggleBubble('bubble10')}>
          Шунда у киши улардан сўрадилар: «Қўйингиз шанба куни чуқурга тушиб
          қолса нима қиласизлар? Қайси бирингиз уни чиқариб олмайди?! Инсон
          қадри қўйникидан анча юқори эмасми?! Шанба куни яхшилик қилиш
          Оллоҳнинг амрларига хилоф эмас!»<sup>10</sup> Кейин ногирон кишига:
          «Қўлингизни чўзинг!» дедилар. У қўлини чўзган эди, қўли шифо топди.
        </p>
        {openBubbles['bubble10'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble10')}
          >
            <p>
              <sup>10</sup> Миррих (р.а.) нинг мусаннафида ёзилишича, :5 Исо
              (а.с.) ўшанда ҳаммага ғазаб билан бир-бир боқиб, уларнинг
              тошбағирликларидан қалблари эзилиб, ҳалиги ногирон кишига шифо
              берган эканлар.
            </p>
          </div>
        )}
      </div>

      <div className="main_text">
       
        <p className="cursor-pointer" onClick={() => toggleBubble('bubble11')}>
          Тақводорлар буни кўриб, нафратланиб ташқарига чиқиб кетдилар ва
          расулуллоҳни ўлдириш ҳақида маслаҳат қилдилар».<sup>11</sup>
        </p>
         {openBubbles['bubble11'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble11')}
          >
            <p>
              <sup>11</sup> Миррих (р.а.) нинг мусаннафида «ҳирудийлар билан
              бирга» деб айтилган.
            </p>
          </div>
        )}

      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Нурлуқ (р.а.) нинг мусаннафида қуйидаги қўшимча маълумотлар бор:{' '}
          </span>
          «Исо (а.с.) уларнинг ниятини билиб турган эдилар. Ногирон кишига:
          «Келинг, ўртага чиқинг», дедилар. Кейин тақводорлардан: «Қани
          айтинглар-чи, дам олиш куни нима қилиш ҳаром: яхшилик қилишми ёки
          ёмонлик? — деб сўрадилар. — Инсонни қутқаришми ё ҳалок қилишми?» Ҳамма
          жим турган эди».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>7-боб: Юзбошининг ғуломи шифо топади</p>
      </div>

      <div className="main_text">


        <p className="cursor-pointer" onClick={() => toggleBubble('bubble12')}>
          <span className="vitalic">
            Атоуллоҳ<sup>12</sup> (р.а.) нинг мусаннафида саҳобалар овоза қилган
            мана бу воқеа қуйидагича қайд этилган:{' '}
          </span>
          «Исо (а.с.) Кафру Ноҳумга кирар эканлар, бир юзбоши у кишидан:
          «Ҳазратим, менинг бир ғуломим бор, оёқ-қўли ишламай тўшакка ётиб
          қолди. Қаттиқ азобда», деб ёрдам сўради. 
          </p>

                  {openBubbles['bubble12'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble12')}
          >
            <p>
              <sup>12</sup>{' '}
              <span className="vitalic">
                Атоуллоҳ (раҳматуллоҳи алайҳ) ҳазрати Исо (а.с.) га имон
                келтиришдан олдин солиқчи бўлиб ишлаган. Исо (а.с.) бир куни
                унинг солиқ қутиси олдида ўтирганини кўриб: «Менга эргаш», деб
                даъват қиладилар. Шундан сўнг у киши Мавлонога шогирд тушган ва
                кейинроқ ўн икки саҳоба қаторидан жой олган.
              </span>
            </p>
          </div>
        )}
        
        <p>    
          «Майли, бориб шифо берай»,
          дедилар расулуллоҳ. 
        </p>
        <p>
          Лекин юзбоши: «Ҳазратим, уйимга келишингизга мен
          лойиқ эмасман. Шу ерда туриб, бир оғиз гап айтсангиз кифоя, ғуломим
          шифо топади. Мен ўзим ҳам буйруққа тобе одамман. Қўл остимда ҳам
          аскарларим бор. Қайси бирига кет десам, кетади, кел десам, келади.
          Хизматкорларимга буни қил десам, қилади», деб жавоб қилди. 
        </p>
        <p>
          Ҳазрати Исо (а.с.) буни эшитиб, ҳайрон бўлдилар ва орқаларидан келаётган жамоатга
          қараб: «Мен сизларга айтсам, имони бунчалик кучли одамни мен Бани
          Исроилда кўрганим йўқ», дедилар.
        </p>
      </div>

      <div className="main_text">
        <p className="cursor-pointer" onClick={() => toggleBubble('bubble13')}>
          Кейин эса: «Оллоҳнинг Даргоҳида шарқу ғарбдан кўп одамлар тўпланиб,
          Иброҳим, Исҳоқ ва Яъқуб пайғамбарлар билан бир дастурхон устига
          ўлтирадилар, Китоб меросхўрлари<sup>13</sup> эса ташқарига, йиғи-сиғи
          ва тиш ғижирлайдиган жойга ҳайдалади», дедилар ва юзбошига:
          «Бораверинг, эътиқод қилганингиздек ғуломингиз шифо топди!» деб
          марҳамат қилдилар. Ғулом ўша онда шифо топди».
        </p>
               {openBubbles['bubble13'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble13')}
          >
            <p>
              <sup>13</sup>{' '}
              <span className="boldItalic">
                «Бас, улардан сўнг, ортларидан китобни мерос олган бир
                ўринбосарлар келдики, улар мана бу тубаннинг ўткинчи
              </span>{' '}
              <span className="vitalic">(матоҳи)</span>{' '}
              <span className="boldItalic">
                ни оларлар ва «бизни кечиради», дерлар. Агар ўшанга ўхшаш
                ўткинчи нарса келса, яна олаверадилар. Улардан Оллоҳга нисбатан
                фақат ҳақдан бошқа нарса айтмасликка Китобнинг аҳду паймони
                олинган эмасмиди?! Улар у
              </span>
              <span className="vitalic"> (китоб) </span>
              <span className="boldItalic">даги нарсаларни ўрганганлар-ку?! Охират ҳовлиси тақво қилганлар учун яхшидир. Ақл ишлатмайсизларми?!» </span>
              <span className="vitalic"> (Аъроф, 169) </span>
            </p>
          </div>
        )}
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Нурлуқ (р.а.) нинг мусаннафида ёзилишича румий юзбоши жаноби
            пайғамбарнинг олдларига боришдан ҳаё қилиб, яҳудий оқсоқолларини
            ўртага солган. Ибронийлар учун бу хил тафсилотлар муҳим бўлмагани
            сабабли Атоуллоҳ (р.а.) уларни ўз ривоятида ёритган эмас. Нурлуқ
            (р.а.) нинг мусаннафида воқеа қуйидагича баён этилган:{' '}
          </span>
          </p>
          <p>
            
          «Кафру Ноҳумда бир румий юзбошининг у учун жуда азиз бўлган бир ғуломи
          бор эди. Бир куни ўша ғулом қаттиқ касал бўлиб, ўлар ҳолатга тушди.{' '}
          <span className="vitalic">(Юзбоши камтар одам эди.) </span> Ҳазрати
          Исо (а.с.) нинг овозасини эшитгач{' '}
          <span className="vitalic">(ўзи бориб айтишга тортиниб) </span> бир
          неча яҳудий оқсоқоллар орқали устоздан келиб ғуломига шифо беришини
          илтимос қилди. 
        </p>
        <p>Оқсоқоллар келиб Исо (а.с.) га: «У бизнинг халқимизни
          яхши кўради, биз учун тиловатхона ҳам қуриб берган, яхшилик қилсангиз
          арзийдиган одам», дедилар ва ҳаммалари юзбошининг уйига қараб йўлга
          тушдилар.{' '}
          <span className="vitalic">
            (Мазҳабий қонунга кўра яҳудийлар румийларнинг уйига бормас эди.)
          </span>
          </p>
      </div>

      <div className="main_text">
        <p>
          Уйга яқинлашганларида, юзбошининг дўстлари уларга пешвоз чиқиб: «Бизни
          юзбоши юборди. У сизга, ҳазратим, заҳмат чекиб уйимга келиб ўтирманг,
          ташрифингизга мен лойиқ эмасман, бир оғиз гап айтсангиз бўлди, ғуломим
          тузалиб кетади. Чунки ўзим ҳам ҳокимият остидаги одамман. Қўл остимда
          ҳам нечта сарбозу ғуломларим бор. Қайси бирига кел, десам келади, кет,
          десам кетади, мана буни қил, десам қилади, деб айтишимизни тайинлади»,
          дейишди. 
        </p>
        <p>
          Исо (а.с.) буни эшитиб ҳайрон бўлдилар ва орқаларидан
          келаётган жамоатга қараб: «Мен сизларга айтсам, имони бунчалик кучли
          одамни мен Бани Исроилда кўрганим йўқ», дедилар». Юзбоши юборган
          одамлар уйга келсалар, ғулом соғ-саломат эди».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>8-боб: Ноиндаги беванинг ўғли тирилади</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Исроил эли ичида овоза бўлган машҳур хабарлардан бири ноинлик
            йигитнинг тирилиши эди. Нурлуқ (р.а.) нинг мусаннафидан:{' '}
          </span>
          «Бир куни Исо (а.с.) шогирдлари билан Ноин шаҳрига қараб йўл олдилар.
          Катта бир оломон уларга ҳамроҳ эди. Шаҳарга кирар эканлар, каттагина
          бир жамоатнинг майит кўтариб шаҳардан чиқаётганини кўрдилар. Ўлик бир
          бева аёлнинг ёлғизгина ўғли эди. 
        </p>
        <p>
          Мавлоно Исо (а.с.) онаизорни кўриб,
          юраги ачишиб: «Йиғламанг!» дедилар ва бориб тобутга қўл теккиздилар.
          Тобуткашлар тўхтади. Оллоҳнинг расули ўликка қараб: «Эй йигит! Тур
          ўрнингдан!» деб амр қилдилар. Ўлик шу онда қаддини кўтариб ўтирди ва
          гапира бошлади. 
        </p>
        <p>«Мана ўғлингиз, онажон!» дедилар Исо (а.с.){' '}
          <span className="vitalic">табассум билан. </span> Ҳаммани қўрқув ва
          ҳаяжон босди. Одамлар: «Оллоҳ яна бизга назар солибди! Халқимизга улуғ
          бир пайғамбар юборибди!» деб ҳамду сано айтар эдилар. Ҳадемай, бўлган
          воқеанинг хабари бутун вилоятга ёйилди».
          </p>
      </div>

      <div className="paragraph_heading">
        <p>9-боб: Яҳё пайғамбарнинг элчилари</p>
      </div>

      <div className="main_text">
        <p>
          Яҳё пайғамбар ҳали ҳам ҳибсда эдилар.{' '}
          <span className="vitalic">
            Нурлуқ (р.а.) нинг мусаннафида ёзилишича, у киши ўз шогирдларини Исо
            (а.с.) нинг олдига юборадилар. Яҳё пайғамбарнинг шогирдлари қилган
            ривоят:{' '}
          </span>
          «Устозимиз рўй бераётган мўъжизаларни эшитиб бизга: «Бориб, келиши
          ваъда қилинган Халифа сизмисиз ё биз бошқасига кўз тутайликми, деб
          сўранглар», деб буюрдилар. Биз Исо (а.с.) нинг олдларига келиб: «Бизни
          Яҳё пайғамбар юборди. Келиши керак бўлган сизми ё биз бошқасини
          кутайликми?» деб сўрадик. Ўша куни у кишининг олдига шифо излаб келган
          одамлар жуда кўп эди. Мавлоно кўп касалларга шифо бердилар, кўпларнинг
          ичидан жинларни қувиб чиқардилар, кўрларнинг кўзини очдилар. Кейин
          бизга жавоб бериб айтдиларки: «Бориб, кўрган-эшитганларингизни Яҳёга
          етказинг: кўрлар кўрмоқда, шоллар юрмоқда, моховлар соғаймоқда.
          Карларнинг қулоғи эшитяпти, ўликлар тириляпти. Ҳа, Аҳд Вориси шу ерда,
          Халифат асри бошланди: Оллоҳнинг бушроси камтару мазлумларга эълон
          қилинмоқда. Мен ҳақимда шубҳага бормаганлар саодатлидир», дедилар».{' '}
          <span className="vitalic">(Ушбу хабар Миррих (р.а.) нинг мусаннафида ҳам бор.)</span>
        </p>
      </div>
    </main>
  );
}