'use client';


import { useSpeechBubbles } from '@/app/hooks/useSpeechBubbles';

export default function MiraclesPartThree() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble14',
    'bubble15',
    'bubble16',
    'bubble17',
    'bubble18',
    'bubble19',
    'bubble20',
  ]);

  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>10-боб: Исо (а.с.) нинг бўронни тўхтатиши</p>
      </div>

      <div className="main_text">
     

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble14')}>
          <span className="vitalic"> Миррих (р.а.) Сафвон (р.а.) дан ривоят қилади: </span>
          «Устозимиз бизга бир куни: «Юринглар, кўлнинг<sup>14</sup> нариги
          соҳилига ўтамиз», дедилар. Кеч кириб қолган эди. Кейин халқни ўша ерда
          қолдириб, қайиққа миндик. Ёнимизда бизга ҳамроҳ бўлган бошқа қaйиқлар
          ҳам бор эди. 
          </p>
          {openBubbles['bubble14'] && (
            <div
              className="speech-bubble"
              onClick={() => toggleBubble('bubble14')}
            >
              <p>
                <sup>14</sup> Жалила кўли.
              </p>
            </div>
          )}
          <p>
            
          Бир вақт кучли бўрон кўтарилди. Тўлқинлар келиб қайиқларга
          урилар, сувга тўлиб, чўкиб кетиш хавфи туғилган эди. Расулуллоҳ эса бу
          пайтда қайиқнинг орқа томонида ёстиққа бош қўйиб ухлаб ётган эдилар.
          Биз келиб: «Устоз! Устоз! Туринг, ҳалок бўламиз! Ё сизга барибирми?»
          деб у кишини уйғотдик. 
        </p>
        <p>Мавлоно ўринларидан туриб, шамолга: «Жим бўл!»
          деб амр қилган эдилар, шамол шу заҳоти тинди. Атрофга чуқур сукунат
          тушди. «Нега бунча қўрқоқсизлар? — дедилар Исо (а.с.). — Ҳалигача
          менга имонингиз йўқми?» 
          </p>
          <p>
            Мўъжизани кўриб ҳаммамизни ҳаяжон босган эди.
          «Бу киши ким экан, ҳатто шамолу сувни ҳам ўзига бўйсундиради?!» дер
          эдик бир-биримизга».{' '}
          <span className="vitalic">
            Ушбу хабар Нурлуқ (р.а.) ва Атоуллоҳ (р.а.) ларнинг мусаннафларида
            ҳам ривоят қилинган.
          </span>
          </p>
      </div>

      <div className="paragraph_heading">
        <p>11-боб: Чўчқаларнинг ичига жин киргани</p>
      </div>

      <div className="main_text">
   

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble15')}>
          <span className="vitalic">
            {' '}
            Миррих (р.а.) нинг мусаннафидан. Сафвон (р.а.) ривоят қиладилар:{' '}
          </span>
          «Жалила кўлининг нариги соҳилига, Жадария ерига етиб келиб, қирғоққа
          оёқ қўйишимиз билан жин чалган бир одам қаршимиздан чиқди.<sup>15</sup>{' '}
          </p>
               {openBubbles['bubble15'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble15')}
          >
            <p>
              <sup>15</sup> Нурлуқ (р.а.) нинг мусаннафида ёзилишича, у анчадан
              бери яланғоч юрар, шаҳардаги уйини ташлаб, гўрларда тунаб юрган
              эди.
            </p>
          </div>
        )}
        <p>
        Ҳеч ким уни боғлай олмас, бўйсундира олмас, неча марта кишанларни
          синдириб, занжирларни узиб кетган эди. Куну тун қабрларда, тоғларда
          бақириб юрар, тошлар билан ўзини уриб жароҳатларди. Расулуллоҳни
          кўриши билан узоқдан югуриб келиб, у кишининг олдига тиз чўкди.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Эй жин, чиқ бу одамдан!» деб амр этдилар Исо (а.с.). «Ё
          Ворисул-маликил-мулк, мендан нима истайсиз? — деб бақирди у. — Худо
          ҳаққи, мени қийнаманг!» «Отинг нима?» дедилар расулуллоҳ. «Лашкар,
          чунки биз кўпчиликмиз», деб жавоб берди у ва бизни бу юртдан ҳайдаманг,
          деб ялина бошлади.
        </p>
      </div>

      <div className="main_text">
        <p>
          Нарироқда, тепалик бағрида чўчқа подаси емиш еб юрган эди. Жинлар:
          «Рухсат беринг, ўша чўчқаларнинг ичига кирайлик», деб ёлвордилар.
          Рухсат олгач, ҳалиги одамни тарк этиб, чўчқаларнинг ичига кирдилар.
          Икки мингтача чўчқа тепаликдан пастга — кўлга қараб югурди ва ўзларини
          сувга ташлаб ғарқ бўлди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Чўчқабоқарлар буни кўриб қочдилар: ҳар бири ўзининг шаҳар-қишлоғига
          бориб, одамларга бу ҳақда хабар бердилар. Юз берган ҳодисани кўриш учун
          жадарияликлар устозимиз олдига йиғилдилар ва жин урган одамнинг
          ақл-ҳуши жойида эканини, устига кийим кийиб ором ўлтирганини кўриб
          ҳайрон бўлдилар. Гувоҳлар унинг қандай соғайганини баён қилишди.
          Ҳаммани ваҳима босган эди. Қўрқиб кетган Жадария аҳли расулуллоҳдан бу
          ердан кетинг, деб илтимос қилдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Қайиқларга минар эканмиз, жинлардан халос бўлган одам: «Мени ҳам
          ўзингиз билан олиб кетинг», деб илтимос қилди. Лекин устоз: «Йўқ,
          уйингга бор, Оллоҳнинг сенга қилган марҳаматини ёру дўстларингга айт»,
          деб ижоза бермадилар. Шундан сўнг у йигит, Исо (а.с.) қилган мўъжизани
          Ўнкент вилоятида одамларга айта бошлади. Эшитганларнинг ҳаммаси ҳайрон
          эди».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>12-боб: Қон кетиш касалига учраган аёл ҳамда Яъурнинг қизи тирилгани</p>
      </div>

      <div className="main_text">
    
        <p className="cursor-pointer" onClick={() => toggleBubble('bubble16')}>
          <span className="vitalic">
            {' '}
            Миррих (р.а.) нинг мусаннафидан. Сафвон (р.а.) ривоят қиладилар:{' '}
          </span>
          «Соҳилга келганимизда устозимиз атрофига кўп одам йиғилди. Бир вақт
          Яъур исмли бир киши келиб тиз чўкиб: «Ё ҳазратим, қизимга шифо беринг,
          ўлар ҳолда ётибди, жонига оро киринг», деб ялинди.<sup>16</sup> (У бир
          тиловатхонанинг раҳбари эди.) Исо (а.с.) унинг уйига қараб йўл олдилар.
          Катта оломон орқаларидан эргашди. Одамлар ҳар тарафдан у кишини қуршаб
          олган эдилар.
        </p>

            {openBubbles['bubble16'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble16')}
          >
            <p>
              <sup>16</sup>{' '}
              <span className="vitalic">
                Нурлуқ (р.а.) нинг мусаннафида ёзилишича, бу қиз Яъурнинг
                ёлғизгина фарзанди бўлган.
              </span>
            </p>
          </div>
        )}

      </div>

      <div className="main_text">
        <p>
          Йўлда, тиқилинчда, ўн икки йилдан бери қон кетиш дардига дучор бўлган
          бир аёл ҳам бизга эргашди. У даволаниш учун бор-йўғини сарф қилиб, кўп
          табибларга мурожаат этган, лекин ҳеч натижа бермаган, қайтага аҳволи
          бадтар оғирлашган эди. Устозимиз таърифини эшитиб, зора шифо олсам, деб
          умид билан келган эди. «Ҳеч бўлмаса кийимини ушласам ҳам соғайиб
          кетаман», деб орт тарафдан келиб, кийимларига қўл теккизади. Шу заҳоти
          қон кетиши тўхтаб, танасида дарддан фориғ бўлганини ҳис қилади.
        </p>
      </div>

      <div className="main_text">
  

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble17')}>
          «Ким менга қўл текизди?» деб сўрадилар Оллоҳнинг расули, танасидан
          барака таралганини ҳис қилиб. Шогирдлари: «Устоз, халқ ҳамма ёқдан сизни
          <sup>17</sup> ўраб олган-ку! Нега ким менга қўл текизди, деб
          сўраяпсиз?» дедилар.
        </p>
              {openBubbles['bubble17'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble17')}
          >
            <p>
              <sup>17</sup>{' '}
              <span className="vitalic">
                Нурлуқ (р.а.) да ёзилишича Исо (а.с.) ўшанда: «Йўқ, биров келиб
                менга қўл текизди, танамдан қувват чиққанини ҳис қилдим», деб
                айтган эканлар.
              </span>
            </p>
          </div>
        )}
      </div>

      <div className="main_text">
        

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble18')}>
          Расулуллоҳ атрофга одамларга қарай бошладилар. Шундан сўнг аёл қўрқув
          ва титроқ билан<sup>18</sup> у кишининг олдида тиз чўкди ва нима учун бу
          ишни қилганини, қандай шифо топганини айтди. «Онажон туринг, — дедилар
          Исо (а.с.). — Имонингиз сизга шифо берди. Бораверинг, Оллоҳнинг
          тинчлиги сизга ёр бўлсин!»
        </p>
        {openBubbles['bubble18'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble18')}
          >
            <p>
              <sup>18</sup> Яҳудийлар шариатига биноан, танасидан қон чиқаётган
              одам булғанган ҳисобланиб, ўзини бошқа одамлардан узоқроқ тутиши
              лозим эди.
            </p>
          </div>
        )}
      </div>

      <div className="paragraph_heading">
        <p>(давоми)</p>
      </div>

      <div className="main_text">
        <p>
          Исо (а.с.) ҳали гапириб турганларида Яъурнинг уйидан бир одам келиб:
          «Қизингиз жон берди, энди устозни овора қилмайлик», деди. Расулуллоҳ
          унинг гапини эътиборга олмай Яъурга: «Қўрқма, — дедилар. — Фақат
          ишон». Кейин ҳаммани ўша ерда қолдириб, ўзлари билан фақат мени,
          Яъқубни ва унинг укаси Яҳёни олиб, Яъурнинг уйига бордилар. Одамлар аза
          чекиб, йиғлаётган эди. «Йиғламанглар, — дедилар устоз. — Қиз ўлмаган,
          ухлаб ётибди». Одамлар бу гапга кулдилар. (Чунки қизнинг ўлгани
          ҳаммага маълум эди.)
        </p>
      </div>

      <div className="main_text">
       

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble19')}>
          Расулуллоҳ одамларни ташқарига чиқартириб, ўзлари билан бизни — учта
          шогирдини — ҳамда қизнинг ота-онасини олиб, қиз ётган хонага кирдилар.
          Қизнинг қўлидан ушлаб: «Талифа, қуми»,<sup>19</sup> дедилар. Ўн икки
          яшар қизалоқ ўрнидан туриб, юра бошлади. Ҳаммамиз ҳайратдан лол эдик.
          Кейин Исо (а.с.): «Қизчага у-бу нарса беринглар, қорни оч. Ҳеч кимга
          ҳеч нарса деманглар!» деб қаттиқ тайинладилар».{' '}
          <span className="vitalic">
            Бу хабар Атоуллоҳ ва Нурлуқ (р.а.) ларнинг мусаннафида ҳам келган.
          </span>
        </p>
         {openBubbles['bubble19'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble19')}
          >
            <p>
              <sup>19</sup> Маъноси “қизим, тур”.
            </p>
          </div>
        )}
      </div>

      <div className="paragraph_heading">
        <p>13-боб: Икки кўзи ожизнинг шифо топиши, соқовнинг тилга кириши</p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic">
            Ҳазрати Исо (а.с.) томонидан тайин қилинган саҳоба Атоуллоҳ (р.а.)
            ривоят қиладилар:{' '}
          </span>
          «Бир куни йўлда кетаётганимизда, кўзи кўр икки одам устозимиз орқасидан
          эргашди. Улар баланд овоз билан: «Ё Довуд тахтининг Вориси, бизга раҳм
          қилинг, шифо беринг », деб расулуллоҳ кирган уйнинг ичигача орқаларидан
          эргашиб кирдилар. «Мен бу ишни қила олишимга ишонасизларми?» деб
          сўрадилар устоз. «Ишонамиз, ҳазрат», дейишди улар. Шундан сўнг Оллоҳнинг
          расули уларнинг кўзига қўл қўйиб: «Ишончингизга яраша бўлсин»,
          дедилар. Шу заҳоти уларнинг кўзи очилди. Устоз уларга: «Бу ҳақда ҳеч
          кимга ҳеч нарса деманглар», деб қаттиқ тайинладилар. Улар эса бориб,
          бутун минтақага у киши ҳақида овоза қила бошладилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Кейин расулуллоҳнинг олдига жин чалиб гунг бўлган бир одамни олиб
          келишди. У киши жинни ҳайдаган эдилар, гунг тилга кирди. Халқ ҳайратдан
          лол қолиб: «Бундай воқеа юртимизда ҳеч қачон бўлган эмас», дер эди.
          Тақводорлар эса: «У бу ишни шайтонлар бошлиғининг кучи билан қиляпти»,
          деб айтдилар».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>14-боб: Беш минг одамга ёзилган дастурхон</p>
      </div>

      <div className="main_text">
       

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble20')}>
          <span className="vitalic">
            {' '}
            Миррих (р.а.) нинг мусаннафидан. Минглаб мўминлар ва ҳаворийлар шоҳид
            бўлган ушбу хабар Сафвон (р.а.) томонидан ривоят қилинган:{' '}
          </span>
          «Биз қайтиб келиб, нима ишлар қилганимизни, одамларга қандай таълим
          берганимизни расулуллоҳга баён этдик. У киши кейин: «Кетдик, хилват
          жойга бориб, дам оламиз», дедилар. (Келиб-кетаётган одамлар шунчалик
          кўп эдики, дам олишга ва ҳатто таом ейишга ҳам вақт йўқ эди.) Сўнгра
          қайиққа тушиб, Байт-Сайдо яқинидаги хилват бир соҳилга чиқдик. Одамлар
          эса кетганимизни кўриб,<sup>20</sup> елиб-югуриб, биздан олдин ҳалиги
          жойга етиб келишибди. 
          
          </p>
           {openBubbles['bubble20'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble20')}
          >
            <p>
              <sup>20</sup> Одамлар шифо излаб, ҳар хил шаҳар ва қишлоқлардан
              Исо (а.с.) нинг олдига келган эдилар.
            </p>
          </div>
        )}

        <p>          
          Соҳилга етганимизда катта бир оломон бизни
          қирғоқда кутиб турган эди. Уларни кўриб, расулуллоҳнинг юраги ачиди.
          Бечора халқ гўёки чўпонсиз қўйларга ўхшар эди. Устозимиз улар билан
          суҳбатлашиб, кўп нарсаларни тушунтирдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Кун оғгач, биз келиб: «Устоз, кеч бўляпти, бу ер овлоқ жой. Жамоага
          айтинг, ён-атрофдаги қишлоқларга бориб ейишга нарса сотиб олсин»,
          дедик. У киши эса: «Йўқ, ўзингиз уларга таом беринг», дедилар. «Бизда
          беш нон билан икки балиқдан бошқа ҳеч нарса йўқ. Ё бориб икки юз
          динорга нон сотиб олайликми?» дедик биз.
        </p>
      </div>

      <div className="main_text">
        <p>
          У ерда (аёллар ва болаларни ҳисобга олмасак) тахминан беш мингтача одам
          бор эди. Расулуллоҳ: «Мардумни эллик-элликдан қилиб майсага ўтқазинглар»,
          деб амр қилдилар. Кейин бешта нон билан икки балиқни олиб, осмонга
          қараб шукрона дуосини ўқидилар ва нону балиқларни ушатдилар. Кейин:
          “Халққа тарқатинглар”, деб бизга бера бошладилар. Ҳамма еб тўйди.
          Ортиб қолган бурдаларни йиғиб олганимизда ўн икки сават тўлган эди».
        </p>
      </div>

      <div className="main_text">
        <p>
          <span className="vitalic"> Ушбу воқеа Қуръони каримда ҳам зикр қилинган: </span>{' '}
          <span className="boldItalic">
            «Ҳаворийлар: «Эй Исо бинни Марям, Парвардигоринг бизга осмондан
            дастурхон нозил қилишга қодирми?» деган пайтларида (Исо
            алайҳис-салом уларга): «Агар мўмин бўлсангизлар, Оллоҳдан қўрқинг»,
            деб жавоб бердилар. Улар дедилар: «Биз (фақатгина) у дастурхондан
            ейишни ва кўнгилларимиз таскин топишини ҳамда сизнинг рост
            сўзлаганингизни аниқ билиб, у дастурхонга шоҳид бўлишни истаймиз».
            (Шунда) Исо бинни Марям: «Эй Тангрим, Парвардигор, бизга осмондан бир
            дастурхон нозил қилгинки, у аввалу охиримиз учун байрам ва Сенинг
            оят-мўъжизанг бўлиб қолгай. Бизни шу неъматдан баҳраманд қил. Ўзинг
            энг яхши ризқ бергувчидирсан», дедилар»
          </span>
          <span className="vitalic"> (Қуръон, Моида сураси, 112-114). </span>
          <span className="boldItalic"></span>
        </p>
      </div>
    </main>
  );
}