'use client';

 
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function David() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble1',
    'bubble2',
    'bubble3',
    'bubble4',
  ]);

  return (
    <main className="stories relative">
      <article className="flex gap-6 border px-4">
        <div className="sm:w-1/2">
          <p className='!text-green-600 sm:!text-gray-600  !text[14px] leading-[15.5px]'>
              «Батаҳқиқ, Биз баъзи пай­ғам­бар­ларни баъ­зи­ла­ри­дан афзал
            қилдик. Ва До­вуд­га За­бур­ни бер­дик»{' '}
            <span className=" ">(Ис­ро сураси 55).</span>
          </p>
        </div>

        <div className="-mt-2 hidden sm:block sm:w-1/2 rtl">
          <p   dir="rtl" 
                  lang="ar" 
                  className="font-amiri !text-[18px] !leading-[40px]">
          
            وَلَقَدْ فَضَّلْنَا بَعْضَ ٱلنَّبِيِّـۧنَ عَلَىٰ بَعْضٍۢ ۖ وَ
            ءَاتَيْنَا دَاوُۥدَ زَبُورًۭا
          </p>
        </div>
      </article>

      <div className="paragraph_heading">
        <p> «Байтлаҳмга бор!» </p>
      </div>

      <div className="main_text">
        <p>Оллоҳ таоло Толутдан норози эди. Бир куни У Сомуил пайғамбарга:</p>

        <p>
          «Қа­чон­гача Толут учун мотам тутасан? Мен уни под­шоҳ­ликдан рад
          этдим, – деди. – Шох­қадаҳингга ёғ қуйиб, Байтлаҳмга, Ийшаа­нинг уйига
          бор. Мен унинг ўғил­ла­ридан бирини подшоҳликка тан­ла­дим».
        </p>

        <p>«Қандай бораман? – дедилар Сомуил (а.с.). – Толут эшитса мени ўлдиради».</p>

        <p>
          «Ўзинг билан бир ғунажин ол, – деди Оллоҳ. – Сўраганларга қурбонлик
          қилиш учун келдим, дейсан. Кейин Ийшаани қурбонликка чақир, ўша ерда Мен
          сенга нима қилишни айтаман. Мен кўрсатган ўғлини подшоҳликка масҳ
          этасан».
        </p>

        <p>
          Шундан сўнг Сомуил пайғамбар Байт­лаҳм шаҳ­рига келдилар. Шаҳар
          оқсо­қол­ла­ри пеш­воз чиқиб хавотир билан:
        </p>

        <p>«Тинч­ликми? Бирон нарса бўлдими?» деб сў­ра­ди­лар.</p>

        <p>
          «Тинчлик, – деди пайғамбар , – Қур­бон­лик сўйиш учун келдим. Покланиб,
          мен билан бирга қурбонликка борасизлар». Ийшаа­га ҳам ўғилларинг билан
          бирга пок­ла­ниб, қурбонгоҳга кел, деб тайинладилар.
        </p>

        <p></p>
      </div>

      <div className="paragraph_heading">
        <p> «Инсон зоҳирига қарайди...» </p>
      </div>

      <div className="main_text">
        <p>
          Ийшаа ўғиллари билан келгач, Сомуил (а.с.) унинг тўнғич ўғли Алиёбни
          кўриб: “Худо мана шу йигитни танлабди-да”, деб ўй­ла­дилар.
        </p>

        <p>
          Бироқ Оллоҳдан: «Унинг ҳусни ва бўйига қарама, – деган хабар келди, –
          Мен танлаган у эмас. Инсон инсоннинг зоҳирига қарайди, Мен эса ботинига
          қарайман», деди.
        </p>

        <p>
          Кейин Ийшаа Абунадоб деган ўғлини Сомуил (а.с.) нинг олдига келтирди.
          «Бу ҳам Худо танлагани эмас», дедилар пайғамбар.
        </p>

        <p>Кейин Шаммоҳ деган ўғли келди. «Бу ҳам Худо танлагани эмас», дедилар ҳазрати Сомуил.</p>

        <p>
          Шундай қилиб, Ийшаа етти ўғлини Сомуил пайғамбарнинг олдидан ўтказди,
          еттиси ҳам Худо айтган одам эмас эди.
        </p>

        <p></p>
      </div>

      <div className="main_text">
        {openBubbles['bubble1'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble1')}
          >
            <p>
              <sup>1</sup> Ҳаким, “Мустадрок”, 2-жилд, 585-бет.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble1')}>
          «Ўғилларинг ҳаммаси шуми?»<sup>1</sup>
        </p>

        <p>«Кич­ки­на­миз ҳам бор, ҳозир даштда қўй боқяп­ти», деди Ийшаа.</p>

        <p>
          «Тез одам юбор, чақир, – деб буюрдилар пайғамбар, – То келмагунча
          ма­росимни бошламаймиз».
        </p>

        <p>
          Отаси одам юбориб, кенжа ўғлини чақир­тириб олиб кел­ди. Унинг исми
          Довуд бўлиб, хушқомат, юзи ва кўзлари чиройли бир йигит эди.
        </p>

        <p>
          Оллоҳ таоло Сомуил пайғамбарга: «Тур, уни подшоҳликка масҳ эт, Мен
          танлаган подшоҳ мана шу», деди.
        </p>

        <p>
          Сомуил пайғамбар зайтун қуйилган шохқадаҳни олиб, ака­ла­рининг олдида
          Довуднинг бошига зайтун мойи суркадилар. Ўша кундан бошлаб Оллоҳнинг
          қудрати ҳамиша унга ёр бўлди.
        </p>

        <p></p>
      </div>

      <div className="paragraph_heading">
        <p> Паҳлавон Жолут </p>
      </div>

      <div className="main_text">
        <p>
          Бир куни филистийлар жанг қилиш учун Яҳузияга келдилар. Сўхў билан
          Азика ўр­та­сидаги Эфес-Дамимда қароргоҳ қур­ди­лар.
        </p>

        <p>
          Толут ҳам Элоҳ дарасида лашкар тўплаб, жангга тайёргарлик кўра бошлади.
          Бир тепалик устида филистийлар, қар­ши­да­ги тепалик устида
          исроилликлар жой­лаш­ган, икки қўшинни ўртада дара аж­ра­тиб турган
          эди.
        </p>

        <p>Филистийлардан бўйи олти тирсагу бир қарич бўлган баҳайбат бир жатлик жангчи ўртага чиқди.</p>

        {openBubbles['bubble2'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble2')}
          >
            <p>
              <sup>2</sup> Салкам 60 килограм.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble2')}>
          Унинг исми Жолут бўлиб, бошига бронзадан дубулға кийган, устида беш
          минг мисқолли<sup>2</sup> бронза совут, оёқларида бронзадан зирҳ,
          орқасида эса бронза қилич осилган эди.
        </p>

        {openBubbles['bubble3'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble3')}
          >
            <p>
              <sup>3</sup> Тахминан 7 килограм.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble3')}>
          Қўлига учидаги темирининг ўзи олти юз мисқол<sup>3</sup> келадиган
          дастаси йўғон найза ушлаган, қалқонини эса олдидаги қуролбардори
          кўтариб олган эди.
        </p>

        <p>
          «Нега уруш қиламиз деб сафга чиқдинг­лар? – деб ҳайқирди Жолут. – Мен
          фи­лис­тий­ман! Сизлар-чи? Толутнинг малай­ла­ри­сиз! Орангизда мен
          билан олишади­ган мард бор­ми? Чиқсин майдонга! Агар мени ўл­дир­са биз
          сизларга қул бўламиз, мен ўл­дир­сам сизлар бизга қул бўласизлар.
          Бу­гун мен Исроил қўшинини шарманда қи­ла­ман! Оли­ша­ман деган мард
          бўлса бу ёққа чиқ­син!»
        </p>

        <p>
          Унинг гапларини эшитиб, Толут ҳам, Ис­ро­ил аскарлари ҳам ваҳимага
          тушдилар. Филистий қирқ кун мобайнида ҳар куни эрталаб ва кечқурун
          ўртага чиқиб, ўзини кўрсатар эди.
        </p>
      </div>

      <div className="paragraph_heading">
        <p> Ҳазрати Довуднинг Жолут билан жангга чиққани </p>
      </div>

      <div className="main_text">
        <p>
          Байтлаҳмлик Ийшаа анча ёшга бориб қолган эди. Унинг уч катта ўғли –
          Алиёб, Абунодоб ва Шаммоҳ Толут билан бирга урушга кетган,
          кенжаси-саккизинчи ўғли Довуд эса отасининг қўйларини боқаётган эди.
        </p>

        <p>
          Бир куни Ийшаа Довудга: «Акаларингдан хабар олиб кел, – дейди. – Мана
          бу қо­ву­рилган бир чора дон билан ўнта нонни ака­ларингга олиб бор.
          Мана бу ўнта пиш­лоқни мингбошига берасан. Ака­ла­ринг­га салом айт».
        </p>

        <p>
          Довуд (а.с.) эрталаб вақтли туриб, қўйлар­ни қоровулга топширдилар-да,
          отаси берган нарсаларни олиб, қароргоҳга кетдилар.
        </p>

        <p>
          Етиб келганларида Исроил қўшини жанг шиор­ла­рини ҳайқириб, сафга
          тўп­ла­на­ёт­ган эди. Даранинг бир тарафида Бани Исроил қўшини, иккинчи
          тарафида фи­лис­тийлар.
        </p>

        <p>
          Довуд олиб келган нар­са­ларини карвон қў­риқ­чисига бериб, саф­­даги
          акаларининг ол­дига югуриб бор­ди­лар. Ҳол-аҳвол сўра­шиб
          тур­ган­ла­ри­да филистий Жолут яна ўр­тага чиқиб, ҳар доимгидек Бани
          Ис­ро­ил­ни таҳқирлай бошлади.
        </p>

        <p></p>
      </div>

      <div className="main_text">
        {openBubbles['bubble4'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble4')}
          >
            <p>
              <sup>4</sup> Забур матнида «Жолут яқин­лаш­са, исроилликлар қўрқиб
              ор­қага тисарилар эди», деган маъно бор.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble4')}>
          Исроилликлар ваҳимада эди.<sup>4</sup> Бир-бир­ла­ри­га: «Ана у одамни
          кўряпсанми? Ким уни ўлдирса подшоҳ уни ўзига куёв қилиб, катта бойлик
          берар эмиш. Кейин уларнинг хо­на­до­ни ҳар қандай солиқдан озод бўлар
          экан!» дер эдилар.
        </p>

        <p></p>
      </div>

      <div className="main_text">
        <p>
          Довуд (а.с.) ёнидагилардан: «Бу фи­лис­тий­ни ўлдириб, Исроилни
          исноддан қут­қа­ра­­ди­ган одамга нима берилади? – деб сўра­дилар. –
          Ким экан бу кестирилмаган, тирик Худонинг лашкарини ҳақорат қи­ла­ди!»
        </p>

        <p>
          Шунда аскарлар у кишига фи­лис­тий­ни ўлдирган одамга нима
          муко­фат­лар бери­ли­шини айтдилар.
        </p>

        <p>
          Алиёб, укаси аскарлар билан гап­ла­ша­ёт­га­нини кўриб аччиғланиб деди:
          «Сенга бу ерда нима бор? Қўйларни ким­га ташлаб кел­динг? Шум ниятингни
          се­зиб турибман, сен бу ерга фақат уруш­ни томоша қилиш учун келгансан».
        </p>

        <p>
          «Нима қилдим? Сўрашга ҳам бўлмай­ди­ми?» дедилар Довуд (а.с.), кейин
          бошқа бир ас­кар­га ҳам ҳалиги саволни бердилар, у ҳам худди шундай
          жавоб берди.
        </p>

        <p>Ҳадемай Довуд (а.с.) нинг гаплари подшоҳнинг қу­ло­ғи­га ҳам етиб келди.</p>

        <p>«Ўша йигитни менинг олдимга олиб ке­линг­лар», деб буйруқ берди Толут.</p>
      </div>
    </main>
  );
}