'use client';


import { useSpeechBubbles } from '@/app/hooks/useSpeechBubbles';

export default function TimeOfJudges() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble1',
    'bubble2',
    'bubble3',
    'bubble4',
  ]);

  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p> Дувора алайҳас-салом қиссаси </p>
      </div>

      <div className="main_text">
        <p>
          Кунлардан бир кун Оллоҳ таоло Бани Исроилни, қилган ёмон ишлари учун
          Канъон шоҳи Ёбиннинг қўлига топширади.
        </p>

   

        <p
          className="cursor-pointer"
          onClick={() => toggleBubble('bubble1')}
        >
          Ёбиннинг лашкарбошиси Сисаро<sup>1</sup> тўққиз юзта жанг араваси
          билан ҳужум қилиб, Бани Исроилни мағлуб қилади ва йигирма йил
          мобайнида уларга зулм ўтказади. Қийналиб кетган халқ, ниҳоят, Оллоҳга
          оҳу нола қила бошлайди.
        </p>
     {openBubbles['bubble1'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble1')}
          >
            <p>
              <sup>1</sup> Сисаро Хароши-­Хаимда яшар эди.
            </p>
          </div>
        )}
        <p>
          Ўша пайтда Бани Исроилга Лапидонинг аёли Дувора ҳакамлик қилар эди. У
          Афройимда, Рама билан Байтил орасида ўсган хурмо тагида халқни қабул
          қилар, жанжалу баҳсларини ажрим этар эди.
        </p>
      </div>

      <div className="main_text">
    
        <p
          className="cursor-pointer"
          onClick={() => toggleBubble('bubble2')}
        >
          Бир куни у Бароқ<sup>2</sup> ибн Абуноамни чақириб деди: «Оллоҳ менга
          ваҳий берди<sup>3</sup>, сен Нафтоли билан Завулун йигитларидан ўн
          мингтасини олиб, Тавор тоғига борар экансан. Оллоҳ Сисарони жанговар
          араваларию лашкари билан бирга ўша ерга келтириб, сенинг қўлингга
          таслим қилар экан», деди.
        </p>
    {openBubbles['bubble2'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble2')}
          >
            <p>
              <sup>2</sup> Бароқ ибн Абуноам Нафтоли қабиласидан эди.
            </p>
            <p>
              <sup>3</sup> Ислом уламолари ичида аёллардан пайғамбар
              чиққан-­чиқмаганлиги ихтилофли масала. Масалан, имом Қуртубий Ҳаво
              онамизни, Иброҳимнинг (а.с.) аёллари Ҳожар Бибини ва Марям онамизни
              пайғамбар деб ҳисоблаган.
            </p>
            <p>
              Аёлларга ваҳий берилгани ҳақида Қуръони каримнинг Қасас сурасида
              оят бор (28:7).
            </p>
          </div>
        )}

      </div>

      <div className="main_text">
        <p>
          Бароқ эса: «Агар сен мен билан бирга борсанг бораман, бўлмаса йўқ», деб
          жавоб беради.
        </p>

        <p>
          «Яхши, – дедилар Дувора (а.с.). – Лекин айтиб қўяй, энди ғалабанинг
          шону шуҳрати сенга насиб этмайди. Оллоҳ Сисарони хотин кишининг қўлига
          таслим қилади», деди.
        </p>
      </div>

      <div className="main_text">

        <p
          className="cursor-pointer"
          onClick={() => toggleBubble('bubble4')}
        >
          Шундай қилиб Дувора (а.с.) Бароқ ибн Абуноам билан бирга Завулун ва
          Нафтолидан ўн минг йигитни қуроллантириб, Тавор тоғига бордилар.
          <sup>4</sup>
        </p>
        {openBubbles['bubble4'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble4')}
          >
            <p>
              <sup>4</sup> Ўша пайтда Кенит халқидан бўлмиш Хавор деган бир одам
              ўз уруғидан ажралиб, Кедеш яқинида, Зананимдаги эман дарахти олдида
              чодир урган эди.
            </p>
          </div>
        )}

        <p>
          Сисаро уларнинг Таворга келганини эшитиб, ўзининг тўққиз юз зирҳли жанг
          аравасини ҳамда Хароши-­Хаимдаги ҳамма одамларини олиб Кишон дарёсига
          келади.
        </p>

        <p>
          «Олға, – дедилар Дувора (а.с.) Бароққа. – Бугун Оллоҳ таоло
          душманларингни қўлингга таслим қилади, Оллоҳнинг Ўзи олдингда боради!»
        </p>

        <p>
          Бароқ ўн минг жангчиси билан тепадан пастга – канъонликларга қараб ҳужум
          қилди. Ўша пайт, Оллоҳнинг қудрати билан Сисаро ҳам, унинг отлиғу пиёда
          аскарлари ҳам саросимага тушиб қолдилар. Сисаро аравасини ташлаб, пиёда
          қочди. Лашкарлари ҳам орқага қараб қоча бошладилар. Бани Исроил уларни
          Хароши­-Хаимгача қувлаб, йўл-­йўлакай ҳаммаларини қиличдан ўтказдилар.
        </p>

        <p>
          Сисаро эса қочиб бориб, кенитлик Хавор яшайдиган жойга келди. (Хавор
          билан канъонликлар орасида тинчлик битими имзоланган эди.)
        </p>

        <p>
          Хаворнинг хотини Яйил Сисарога пешвоз чиқиб: «Ҳазратим, келинг, чодирга
          киринг, қўрқманг», деди. Чодирга киргач устини чойшаб билан ёпиб қўйди.
        </p>

        <p>«Менга озгина сув бер, – деди Сисаро. – Чанқадим».</p>

        <p>
          Аёл сут солинган мешнинг оғзини ечиб, унга сут ичирди-­да яна устини
          чойшаб билан ёпди.
        </p>

        <p>
          «Сен ташқарида ўтир, – деди Сисаро. – Агар биров келиб, ичкарида одам
          борми, деб сўраса, йўқ, де».
        </p>

        <p>
          Лашкарбоши қаттиқ чарчаган эди. Ҳадемай кўзларини уйқу босиб, ухлаб
          қолди. Яйил буни кўриб, қўлига болға билан чодирга қоқадиган қозиқ
          олди­да, Сисаронинг чаккасига қўйиб, зарб билан туширди. Қозиқ унинг
          бошини тешиб, ерга кириб кетди. Ётган жойида у дунёга равона бўлди.
        </p>

        <p>
          Бу пайтда Бароқ ибн Абуноам Сисаронинг кетидан қувиб излаб келаётган
          эди. Яйил чодирдан чиқиши билан Бароққа дуч келди.
        </p>

        <p>«Сисарони излаяпсизми? – деди унга. – Чодирга киринг, топасиз».</p>

        <p>
          Бароқ кириб қараса, Сисаро чодирнинг ичида чаккасига қозиқ қоқилганча
          ўлиб ётган эди.
        </p>

        <p>
          Шундай қилиб ўша куни Худо, Бани Исроилга подшоҳ Ёбиннинг лашкари
          устидан ғалаба ато этди.
        </p>
      </div>
    </main>
  );
}