'use client';

 

export default function Tolut() {
  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>Толут</p>
      </div>

      <div className="main_text">
        <p>
          Толут Мансурнинг тошбўрон бўлганини тўғри деб ҳисоблар эди. Ўша
          кундан бошлаб Қуддусдаги имонлилар жамоаси қувғинга учради.
          Саҳобалардан бошқа ҳамма Яҳузия ва Сомирага қочиб кетди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Толут имонлилар жамоатини йўқ қилишга қасд қилган эди. Уйма-уй юриб
          эркакми-аёлми демай расулуллоҳга имон келтирганларни судраб чиқиб,
          зиндонга ташлаётган эди.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Сомирадаги мўъжизалар</p>
      </div>

      <div className="main_text">
        <p>
          Қуддусдан қочиб кетган шогирдлар қаерга борсалар, Устозимиз ҳақидаги
          Хушхабарни одамларга етказар эдилар. Чавандоз (р.а.) ҳам Сомира
          шаҳрига бориб, у ердагиларга Устозимиз ҳақида гапирди, мўъжизалар
          кўрсатди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Мўъжизалар сабабли халқ у кишининг гапларига қулоқ солар эди. Жинлар
          кўп одамларнинг ичидан фарёд билан чиқаётган, кўп шол ва чўлоқлар
          шифо топаётган эдилар. Шаҳар шодликка тўлди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Сомирада жодугарлик қилиб, анчадан бери одамларни ҳайратга солиб
          юрган Исмоил деган бир одам бор эди. У ўзини улуғ одам деб ҳисоблар,
          каттаю кичик ҳамма, бу кишида илоҳий қудрат бор, деб уни ҳурмат
          қилар, унга Қодир деб от қўйган эдилар. Чавандоз (р.а.) Илоҳий
          Салтанат ҳақида ва Салтанат Подшоҳи — ҳазрати расулуллоҳ ҳақида
          гапирганларидан кейин, эркагу аёл кўп одам имон келтирди, ғусл олиб
          тавба қилди. Исмоилнинг ўзи ҳам ишониб ғусл олди ва Чавандоз қаерга
          борса, орқасидан юрадиган бўлди. Чавандоз қилаётган мўъжизаларни
          кўриб у ҳайрон эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Сомираликлар Худонинг Сўзини қабул қилибди, деб эшитгач Қуддусдаги
          саҳобалар Сафвон (р.а.) билан Яҳё (р.а.) ни Сомирага юбордилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Улар келиб, Руҳ ул-қудсни қабул қилинглар, деб сомиралик имонлилар
          учун дуо қилдилар. Чунки сомираликлар ҳали Руҳ ул-қудсни олмаган,
          фақат расулуллоҳга имон келтириб ғусл олган эдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Сафвон ва Яҳё (р.а.) уларга дуо бериши билан уларга Руҳ ул-қудс
          берилди. Исмоил буни кўриб, саҳобаларга қанчадир пул олиб келди-да:
          «Менга ҳам шундоқ қудрат беринглар, кимга дуо қилсам, Руҳ ул-қудсга
          эга бўлсин», деб илтимос қилди.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Пулинг бошингга етсин! — дедилар Сафвон (р.а.) унга. — Оллоҳнинг
          ҳадясини пулга сотиб оламан, деб ўйладингми? Сенинг бу ишда насибанг
          йўқ, чунки Худонинг олдида юрагинг тўғри эмас. Бу ёмонлигингдан тавба
          қил, Худога ёлвор. Балки Худо ёмон ниятингни кечирар. Кўриб турибман,
          юрагингни ҳасад ва гуноҳ эгаллаб олган!»
        </p>
      </div>

      <div className="main_text">
        <p>«Худо мени кечирсин, мен учун дуо қилинглар!», деди Исмоил.</p>
      </div>

      <div className="main_text">
        <p>
          Сафвон (р.а.) билан Яҳё (р.а.) Устозимиз ҳақида шаҳодат бериб,
          Каломни тарғиб қилиб, кейин Қуддусга қайтиб кетдилар. Йўл бўйи
          Сомиранинг кўп қишлоқларида тўхтаб, у ердагиларга ҳам Хушхабарни
          ваъз қилдилар.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Ҳабашистонликнинг ғусл олгани</p>
      </div>

      <div className="main_text">
        <p>
          Кейин Худонинг фариштаси Чавандоз (р.а.) га: «Тур, Қуддусдан Ғазага
          борадиган саҳро йўлига чиқ», деди. Чавандоз (р.а.) туриб айтилган
          манзилга қараб йўлга тушди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Йўлда у киши Ҳабашистон маликаси Кандокининг хазинадорини учратди. У
          Байтуллоҳни зиёрат қилиш учун Қуддусга келган, энди эса аравасига
          ўтириб, ватанига қайтаётган эди. Қўлида Ишаъё пайғамбарнинг китоби
          бор эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шунда Руҳ ул-қудс Чавандозга: «Тезроқ бўл, аравага етиб ол», деди.
          Чавандоз (р.а.) югуриб аравага олдига келди ва хазинадорнинг Ишаъё
          пайғамбар китобини ўқиётганини эшитиб: «Ўқиётганингиз ким ҳақида
          эканини биласизми?» деб сўради.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Биров ўргатмаса, қаердан биламан?» деди у. Кейин Чавандозга, аравага
          чиқ, ёнимга ўтир, деб илтимос қилди. У мана бу оятларни ўқиётган эди:
        </p>
      </div>

      <div className="main_text">
        <p className="vitalic">“Уни қўй каби бўғизлашга элтдилар.</p>
        <p className="vitalic">Ноҳақлик билан у кишини ҳақорат қилдилар.</p>
        <p className="vitalic">
          Қўзи юнг қирқувчилар олдида қандоғ жим турса,
        </p>
        <p className="vitalic">У ҳам эътирозга оғиз очмади...”.</p>
      </div>

      <div className="main_text">
        <p>
          Кейин Чавандоздан: «Пайғамбар бу гапларни ўзи ҳақида айтганми ё бошқа
          биров ҳақидами?» деб сўради.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шунда Чавандоз (р.а.) ўша оятлардан бошлаб, расулуллоҳнинг
          хушхабарини унга тушунтира бошлади.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бир вақт сув бор жойга етиб келдилар. Шунда хазинадор: «Қара, ана
          сув. Менинг ғусл олиб имон келтиришимга нима монеълик қилади?» деб
          сўради. Аравани тўхтатиб сувга кирдилар. Чавандоз (р.а.) уни имонга
          киргизди. Сувдан чиққанларида Оллоҳнинг Руҳи Чавандозни олиб кетди,
          кўздан ғойиб бўлди. Ҳабашистонлик хазинадор эса хурсанд бўлиб
          сафарини давом эттирди.
        </p>
      </div>

      <div className="main_text">
        <p>
          (Чавандоз (р.а.) бир вақт қарасалар, Ашдуд шаҳрига келиб қолибди. У
          ердан то Қайсарияга келгунча йўлма-йўл ҳамма шаҳарларда Хушхабарни
          тарғиб қилиб келди.)
        </p>
      </div>
    </main>
  );
}