'use client';

import '../../../qisas-uzb/stories.css';

export default function ImonlilarHayoti() {
  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>Имонлилар ҳаёти</p>
      </div>

      <div className="main_text">
        <p>
          Барча имонлилар бир тан-бир жон эдилар. Ҳеч ким ўз бойлигини фақат
          ўзига тегишли деб билмас, нимагаки эга бўлсалар ҳаммаси ўртада эди.
          Саҳобалар эса расулуллоҳнинг тирилганлиги ҳақида катта қудрат билан
          ваъз қилаётган эдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Оллоҳнинг баракаси барча имонлилар устида эди: ораларида муҳтожлар
          йўқ, чунки ери ё уйи бор одамлар уларни сотиб, пулини саҳобаларга
          берар, саҳобалар эса одамларнинг эҳтиёжига қараб тақсимлар эдилар.
          Лобий қабиласига мансуб қибрислик Юсуф деган бир одам ҳам (саҳобалар
          унга Барнобо, яъни, ташвиқотчи деб лақаб қўйган эдилар) ўз ерини
          сотиб, пулини саҳобалар қўлига топширади.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Худони алдаб бўлмайди</p>
      </div>

      <div className="main_text">
        <p>
          «Эй одамлар, ...шайтоннинг изларидан эргашманглар, чунки у сизларга
          аниқ душмандир» (Бақара, 168).
        </p>
      </div>

      <div className="main_text">
        <p>
          Ҳанон деган бир киши, хотини Сафира билан бир бўлак ерни сотиб,
          хотинининг розилиги билан пулнинг бир қисмини олиб қолиб, қолганини
          саҳобаларга олиб келди ва уларга ҳамма пул шу, деб айтди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шунда Сафвон (р.а.) : «Ҳанон, сен қандоқ қилиб шайтонга қалбингни
          бериб қўйдингки, пулни беркитиб, Руҳ ул-қудсга ёлғон гапирадиган
          бўлдинг?! — дедилар. — Ер сеники эди, ўз ихтиёринг билан сотдинг.
          Сотгандан кейин ҳам пул ўзингники эди, хоҳла бер, хоҳлама берма. Нима
          сени бундоқ қилишга мажбур қилди?! Сен бизга эмас, Худога ёлғон
          гапирдинг!»
        </p>
      </div>

      <div className="main_text">
        <p>
          Ҳанон бу сўзларни эшитиши билан ерга йиқилиб жон таслим қилди. Бу
          хабарни эшитганлар даҳшатга тушдилар. Йигитлар ўликни кафанга ўраб,
          олиб бориб мозорга қўйдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Тахминан уч соатдан сўнг, Ҳаноннинг хотини, нима бўлганидан бехабар,
          кириб келди. Сафвон (р.а.) ундан: «Ерни шунчага сотдингизларми?» деб
          сўрадилар.
        </p>
      </div>

      <div className="main_text">
        <p>«Ҳа, шунчага», деди хотин.</p>
      </div>

      <div className="main_text">
        <p>
          Сафвон (р.а.) : «Худонинг Руҳини синашга сизларнинг қандоқ ҳаддингиз
          сиғди? — дедилар. — Ҳозиргина эрингни дафн қилиб келишди, энди сени
          ҳам олиб кетишади».
        </p>
      </div>

      <div className="main_text">
        <p>
          Хотин шу онда ерга йиқилиб жон берди. Йигитлар ичкарига кирганда, у
          ўлиб ётган эди. Кейин уни ҳам олиб бориб, эрининг ёнига қўйдилар.
          Имонлилар жамоасини ва барча эшитганларни қаттиқ қўрқув босди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шу воқеадан сўнг, ҳеч ким саҳобаларга яқинлашишга журъат этолмай
          қолди. Халқ орасида уларнинг ҳурмати жуда баланд эди. Имон келтираётган
          эркак ва аёллар сони тобора кўпайиб борар, ҳаммалари мунтазам равишда
          Байтуллоҳнинг “Сулаймон Равоғи” деган жойида йиғилар эдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Саҳобалар халқ орасида кўп ажойиб ҳайратовар мўъжизалар қилар,
          масалан, Сафвон (р.а.) кўчадан ўтаётганларида, ҳеч бўлмаса сояси
          тушсин, деб касалларни тўшакда ётган ҳолида кўчага чиқариб қўяр
          эдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Қуддус атрофидаги қишлоқлардан ҳам кўп одамлар келаётган, саҳобалар
          қўли билан касаллардан ва жинлардан фориғ бўлаётган эди. Бу нарса
          олийруҳоний ва унинг садуқий дўстларининг ҳасадини қўзғади ва
          саҳобаларни ушлаб зиндонга ташладилар.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Фариштанинг зиндонни очгани</p>
      </div>

      <div className="main_text">
        <p>
          Ўша куни кечаси Оллоҳнинг фариштаси келиб зиндон эшикларини очди ва
          уларни зиндондан ташқарига чиқариб: «Байтуллоҳга боринглар ва бу ҳаёт
          хушхабарини одамларга айтинглар!» деди. Тонг отгач, саҳобалар
          Байтуллоҳга бориб одамларга таълим бера бошладилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бу пайтда олийруҳоний ҳам дин пешволари билан бирга Олий Кенгаш ташкил
          қилиб, ҳамма оқсоқолларни чақиртирган эди. Кейин саҳобаларни олиб
          келиш учун зиндонга одам юбордилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Байтуллоҳ муҳофизлари уларни зиндондан топмай қайтиб келишди ва
          Кенгашга: «Зиндон эшиклари қулф, қоровуллар ҳам эшик олдида турибди,
          лекин ичкарига кирсак ҳеч ким йўқ», дедилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Муҳофизлар бошлиғи ва руҳонийлар буни эшитиб, энди бунинг охири нима
          бўлар экан, деб ҳайрон бўлдилар. Шу пайтда бир киши келиб: «Сизлар
          зиндонбанд қилган одамлар ҳозир Байтуллоҳда таълим беряпти», деди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Муҳофизлар бошлиғи йигитлари билан бориб, саҳобаларни яхши гап билан
          Кенгашга олиб келдилар. (Чунки, агар куч ишлатсак, оломон бизни
          тошбўрон қилади, деб қўрққан эдилар.)
        </p>
      </div>

      <div className="main_text">
        <p>
          Олийруҳоний: «Биз сизларга Исо ҳақида бошқа гапирманглар, деб
          айтмаганмидик? Бутун Қуддусни таълимотингиз билан тўлдириб
          юбордингиз-ку! Нима, энди бу одамнинг қонини бизнинг бўйнимизга
          қўймоқчимисизлар?!» деди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Сафвон (р.а.) ва бошқа саҳобалар бундоғ деб жавоб бердилар: «Биз
          одамларга эмас, Худога бўйсунишимиз керак. Сизлар Оллоҳнинг расулини
          чўбга михлаб ўлдирдингиз, лекин ота-боболаримиз Худоси у кишини
          тирилтирди. Бани Исроил тавба қилсин, гуноҳлари кечирилсин, деб у
          кишига Ўзининг ўнг қўлидан жой берди. Подшоҳ ва Нажотбахш этиб
          тайинлади. Биз бу ишларнинг шоҳидимиз. Оллоҳга итоат этадиганларга
          берилган Руҳ ул-қудс ҳам бунга гувоҳ».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Гамалаилнинг маслаҳати</p>
      </div>

      <div className="main_text">
        <p>
          Кенгаш узвлари бу гапдан қаттиқ ғазабланиб, уларни ўлдирмоқчи
          бўлдилар. Шунда Гамалаил деган бир киши ўрнидан туриб, саҳобаларга бир
          пас ташқарига чиқиб туринглар, деб буюрди.
        </p>
      </div>

      <div className="main_text">
        <p>
          (У киши фарисийлар фирқасидан бўлиб, фиқҳ бўйича дарс берар, халқ
          назарида ҳурмати баланд эди.)
        </p>
      </div>

      <div className="main_text">
        <p>
          «Эй Исроил аҳли, — деди у киши. — Бу одамларга бир нарса қилишдан
          эҳтиёт бўлинглар. Эсингиздами, Тиюдо деган бир одам ўзини раҳнамо
          қилиб, тўрт юз одамни орқасидан эргаштирган эди. Уни ўлдиргандан сўнг
          шогирдлари ҳам пароканда бўлиб, йўқ бўлди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Кейин, аҳолини санаш пайтида, жалилалик Яҳузо пайдо бўлди ва бир қанча
          одамларни ўзига эргаштирди. Лекин уни ҳам ўлдирдилар ва шогирдлари
          пароканда бўлди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шундоғ экан, менимча буларни ўз ҳолига қўйганимиз дуруст. Агар уларнинг
          таълимоти ва қилаётган ишлари ўзларидан бўлса, узоққа бормайди. Лекин
          агар Худодан бўлса, уларни тўхтатишга кучимиз етмайди. Яна мабодо
          Оллоҳ таолога қарши иш қилаётган бўлиб қолмайлик!»
        </p>
      </div>

      <div className="main_text">
        <p>
          Кенгаш узвлари Гамалаилнинг гапини қабул қилдилар ва саҳобаларни
          қамчилатиб, бошқа ҳеч қачон бу ҳақда таълим берманглар, деб қўйиб
          юбордилар. Саҳобалар эса, Худо бизни устозимиз учун азоб чекиш ва
          ҳақорат эшитишга лойиқ деб билди, деб қувониб у ердан чиқиб кетдилар.
        </p>
      </div>


       <div className="paragraph_heading">
        <p>Етти вазифадорнинг тайинланиши</p>
      </div>

      <div className="main_text">
        <p>
          Имонлилар сони суръат билан кўпаяр эди. Бир куни юнонча гапирадиган
          яҳудийлар, кундалик озуқа тақсимотида биздаги бева хотинларга эътибор
          берилмаяпти, деб ибронийча гапирадиган яҳудийлар устидан арз қилишди.
          Шунда ўн икки саҳоба ҳамма имонлиларни йиғиб бундоғ дедилар:
        </p>
      </div>

      <div className="main_text">
        <p>
          «Биродарлар, биз Калом хизматини тўхтатиб, вақтимизни дастурхонга
          сарфласак тўғри бўлмайди. Шунга орангиздан Руҳ ул-қудс ва ҳикматга
          тўлган еттита обрўли одамни танланглар. Биз уларни мана шу ишга
          вазифадор қилиб тайинлаймиз. Ўзимиз эса вақтимизни дуога ва Калом
          хизматига сарфлаймиз».
        </p>
      </div>

      <div className="main_text">
        <p>
          Бу таклиф ҳаммага маъқул тушди ва имонда маҳкам бўлган, Руҳ ул-қудсга
          тўлган етти кишини танлаб саҳобаларга тақдим қилишди. Саҳобалар
          уларнинг устига қўл қўйиб дуо билан уларни хизматга тайин этдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Худонинг сўзлари ҳамма ёққа ёйилаётган эди. Қуддусда имонлилар сони
          борган сари кўпайиб борар, ҳатто руҳонийлар орасида ҳам расулуллоҳга
          мурид тушаётганлар кўп эди.
        </p>
      </div>
    </main>
  );
}