'use client';

 

export default function YettiVazifadorningTayinlanishi() {
  return (
    <main className="stories relative">
     

      <div className="paragraph_heading">
        <p>Мансурнинг қўлга олиниши</p>
      </div>

      <div className="main_text">
        <p>
          Етти вазифадорнинг бири этиб тайинланган, Худонинг инояти ва қудрати
          билан тўлган Мансур, халқ орасида буюк мўъжизалар кўрсатаётган эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бир куни «Озодлар» тиловатхонасининг узвлари баҳслашиш учун
          Мансурнинг олдига келдилар. (Улар Қирвон ва Искандария вилоятидан
          келган одамлар эди.)
        </p>
      </div>

      <div className="main_text">
        <p>
          Уларга Қилиқия ва Осиёдан келган яҳудийлар ҳам қўшилди. Лекин ҳеч ким
          Мансурнинг гапларидаги ҳикмат ва Руҳга қарши тура олмади.
        </p>
      </div>

      <div className="main_text">
        <p>
          Кейин улар бир неча одамни “Бу йигит Худога ва Мусо пайғамбарга қарши
          куфр гаплар айтди”, деб айтишга кўндирдилар. Буни эшитган халқ ҳам,
          оқсоқоллару диний олимлар ҳам кўтарилиб Мансурни тутиб, муҳокама қилиш
          учун Олий Кенгашга олиб келдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ёлғон гувоҳлар Мансурни айблаб: «Бу одам ҳамиша Байтуллоҳга ва
          Битикларга қарши гапириб юради. Унинг “носиралик Исо маъбадни вайрон
          қилади, Таврот ҳукмларини ботил қилади”, деб айтганини эшитдик»,
          дедилар. Шу пайт Олий Кенгашда ўлтирганларнинг ҳаммаси Мансурнинг юзи
          фариштанинг юзи сингари порлаётганини кўрдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Олийруҳоний Мансурдан: «Бу гаплар ростми?» деб сўради. Мансур
          жавобига деди:
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Мансурнинг ваъзи</p>
      </div>

  <div className="main_text">
  <p>
    «Азиз биродарлар, муҳтарам отахонлар, эшитинг. Бобомиз Иброҳим
    Байн-ал-наҳрайнда эканида шону шавкат соҳиби Оллоҳ таоло у кишига аён
    бериб, «Юртингни, қариндошларингни тарк эт, Мен сенга кўрсатадиган юртга
    бор», деб айтган эди.
  </p>
</div>

<div className="main_text">
  <p>
    Ўшанда Иброҳим (а.с.) калдонийлар юртини ташлаб, Ҳоронга борадилар.
    Отаси вафот этганларидан сўнг Оллоҳ таоло у кишини бу ерга олиб келди.
    Лекин ўша пайтда бу ернинг ҳатто бир қаричини ҳам мулк қилиб бермади.
  </p>
</div>

<div className="main_text">
  <p>
    Кейин Худо у кишига, бу ерни сенга ва сенинг наслингга бераман, деб
    ваъда қилди. Бу ҳали ҳазрати Иброҳимнинг бефарзанд юрган пайти эди.
    Оллоҳ таоло яна у кишига, сенинг авлодларинг бегона юртда тўрт юз йил
    қулликда яшаб, зулм кўради, деб айтади: «Уларни қул қилган халқни Мен
    жазолайман. Фарзандларингни эса мана шу юртга олиб келаман. Шу ерда улар
    Менга ибодат қиладилар».
  </p>
</div>

<div className="main_text">
  <p>
    Хатна аҳди ҳазрати Иброҳимга ўшанда берилди. У кишининг ўғли ҳазрати
    Исҳоқ саккиз кунлигида хатна қилинган.
  </p>
</div>

<div className="main_text">
  <p>
    Кейин Исҳоқ алайҳис-саломдан Яъқуб алайҳис-салом дунёга келди.
    Исроилнинг ўн икки қабиласи эса Яъқуб алайҳис-саломдан вужудга келади.
  </p>
</div>

<div className="main_text">
  <p>
    Яъқуб пайғамбарнинг ўғиллари ҳасодат туфайли укалари Юсуфни қул қилиб
    Мисрга сотадилар. Лекин Оллоҳ таоло ҳазрати Юсуф билан бирга эди. Уни
    ҳамма ташвишлардан халос қилиб унга ҳикмат ато этди. Шунда у киши Миср
    подшоҳи фиръавннинг марҳаматига сазовор бўлиб, бутун Миср ҳамда сарой
    вазирлари устидан ҳоким этиб тайинланди.
  </p>
</div>

<div className="main_text">
  <p>
    Шундан сўнг Миср ва Канъон бўйлаб очарчилик бошланди. Ота-боболаримиз
    бошига оғир мусибатлар тушди. Ейишга ҳеч нарсалари қолмади. Ҳазрати
    Яъқуб, Мисрда ғалла бор экан, деган хабарни эшитиб ўғилларини у ерга
    юборади. Мисрга иккинчи марта борганларида, Юсуф алайҳис-салом
    ака-укаларига ўзини танитади. Фиръавн ҳам бундан бохабар бўлади.
    Шундан сўнг ҳазрати Юсуф отаси Яъқубни ва ака-укаларини бола-чақалари
    билан бирга Мисрга таклиф қилади. Улар жамъан етмиш беш нафар эдилар.
  </p>
</div>

<div className="main_text">
  <p>
    Яъқуб алайҳис-салом ҳам, ўғиллари ҳам Мисрда оламдан ўтдилар.
    Ҳаммаларининг жанозалари Шакамга, Иброҳим (а.с.) Ҳамўрнинг ўғилларидан
    сотиб олган мақбарага қўйилди.
  </p>
</div>

<div className="main_text">
  <p>
    Иброҳим пайғамбарга берилган ваъда амалга ошадиган вақтда Мисрда
    яшаётган халқимизнинг сони жуда ҳам кўпайиб кетган эди. Ўшанда Юсуф
    алайҳис-саломни танимайдиган бошқа бир подшоҳ Миср тахтига чиқди ва
    халқимизга кўп зуғум ўтказди. Ота-оналаримизни, янги туғилган
    чақалоқларини ўлсин деб, ташлаб кетишга мажбур қилди.
  </p>
</div>

<div className="main_text">
  <p>
    Кейин Мусо алайҳис-салом дунёга келдилар. Жуда ҳам хушрўй бир чақалоқ
    эдилар. Ота-онаси уни уч ой уйда асради. Ортиқ яшира олмасликларини
    билгач, олиб бориб дарёда қолдирдилар. Фиръавннинг қизи топиб олиб,
    ўзига ўғил қилди. Шу тариқа у киши Мисрнинг барча ҳикмат ва билимларига
    эга бўлдилар. Ҳам сўзда, ҳам ишда маҳоратга эришдилар.
  </p>
</div>

<div className="main_text">
  <p>
    Қирқ ёшга чиққанларидан сўнг, бир куни қавм-қариндошлари бўлмиш бани
    Исроилни бориб кўрмоқчи бўладилар. Борсалар, бир мисрлик бир ибронийга
    зулм қилиб турган эди. Шунда ҳазрати Мусо биродарининг ёнини олиб,
    мисрликни ўлдиради. У киши “Худо мени бани Исроилни қутқариш учун
    юборган, биродарларимга шуни тушунтираман”, деб ўйлаган эдилар. Лекин
    улар буни тушунмадилар.
  </p>
</div>

<div className="main_text">
  <p>
    Эртасига яна уларни кўргани боради. Бу сафар икки иброний жанжал қилиб
    турган эди. Ҳазрати Мусо уларни яраштирмоқчи бўлиб: «Азизларим, сизлар
    биродарсизлар. Нега бир-бирингизга зулм қиласиз?» дедилар. Лекин
    айбдор одам у кишини итариб: «Ким сени устимизга ҳоким ё қози қилиб
    қўйди? Ё кеча мисрликни ўлдирганингдек мени ҳам ўлдирмоқчимисан?»
    деди. Ҳазрати Мусо бу гапни эшитиб Мадянга қочиб кетдилар. У ерда
    мусофирчиликда икки ўғилнинг отаси бўлдилар.
  </p>
</div>

<div className="main_text">
  <p>
    Қирқ йилдан сўнг, Сино тоғи яқинидаги чўлда, ёнаётган бута шуъласида
    бир фаришта ҳазрати Мусога зоҳир бўлади. Мусо алайҳис-салом манзарани
    кўриб ҳайрон бўлдилар. Яхшироқ кўрай, деб яқинлашганларида, Оллоҳ
    таоло у кишига: «Мен сенинг оталаринг Иброҳим, Исҳоқ ва Яъқубнинг
    Худосиман», деди. Ҳазрати Мусо қўрқувдан титраб бошқа қарашга журъат
    қилмадилар.
  </p>
</div>

<div className="main_text">
  <p>
    «Чориқларингни еч, — деди Худо. — Чунки сен муқаддас ерда турибсан.
    Мен халқимнинг Мисрда азоб чекаётганини, оҳу фарёдини эшитдим. Энди сен
    бориб, уларни мисрликлар зулмидан халос этасан».
  </p>
</div>

<div className="main_text">
  <p>
    Ҳа, қирқ йил олдин халқ Мусо пайғамбарни рад қилган эди. “Ким сени
    устимиздан ҳоким ё қози қилиб қўйибди?» деган эди. Лекин Оллоҳ таоло у
    кишини Ҳоким ва Халоскор қилиб Мисрга жўнатди.
  </p>
</div>

<div className="main_text">
  <p>
    У киши кўп мўъжизалар билан бани Исроилни Мисрдан олиб чиқдилар. Аҳмар
    денгизидан ўтказиб, қирқ йил биёбонда раҳбарлик қилдилар. Бани
    Исроилга: «Худо сизларга ўз халқингиз орасидан менга ўхшаш бир
    пайғамбар чиқаради», деб айтган пайғамбар ким? Ҳазрати Мусо. Чўлда
    Худонинг халқи билан бирга бўлган, Сино тоғида ҳаёт сўзларини
    фариштадан қабул қилиб бизга етказган ким? Ҳазрати Мусо.
  </p>

  <p>
    Лекин оталаримиз Оллоҳнинг расулига итоат этишдан бош тортдилар. У
    кишини рад қилиб, Мисрга қайтишни хоҳладилар. Ҳазрати Ҳорунга:
    «Бизга раҳбарлик қиладиган худолар яса, бизни Мисрдан олиб чиққан ана
    у Мусога нима бўлганини билмаймиз», дедилар. Кейин бузоқ суратида бут
    ясаб унга қурбонликлар сўйишди, ўзлари ясаган нарсадан фахрланиб
    хурсандчилик қилишди.
  </p>
</div>

<div className="main_text">
  <p>
    Кейин Оллоҳ с.в.т. улардан юз ўгириб, ой, қуёш ва юлдузларга
    сиғинишига йўл қўйиб берди. Пайғамбарлар китобида ёзилганидек:
  </p>
</div>

<div className="main_text">
  <p className="vitalic">
    Эй бани Исроил, қирқ йил биёбонда юриб
  </p>

  <p className="vitalic">
    Менга қурбонлик қилган эдингларми?
  </p>

  <p className="vitalic">
    Йўқ, сизларнинг ишқу алоқангиз бутларингизга,
  </p>

  <p className="vitalic">
    Малук чодирига, Кайвон юлдузига,
  </p>

  <p className="vitalic">
    қўлларингиз яратган санамларга эди.
  </p>

  <p className="vitalic">
    Шу сабабдан Мен сизларни Бобилдан нарига сургун қиламан.
  </p>
</div>

<div className="main_text">
  <p>
    Оталаримиз чўлда Шаҳодат Чодирини олиб юрар, бу чодир Худо Мусо
    пайғамбарга кўрсатган суратда ясалган эди. Кейин Юшаъ (а.с.) Чодирни
    ваъда қилинган юртга олиб келди. Ўшанда Худо бегона халқларни қувиб
    чиқариб, юртни уларга беради. Бани Исроил Довуд подшоҳ замонигача ана
    шу Чодирда ибодат қилганлар.
  </p>
</div>

<div className="main_text">
  <p>
    Ҳазрати Довуд (а.с.) Оллоҳнинг марҳаматига сазовор бўлганлар ва:
    “Сен учун бир уй қурай”, деб орзу қилганлар. Лекин бу иш у кишига
    эмас, Сулаймон пайғамбарга насиб этди. Шундоғ бўлса ҳам, Оллоҳ азза ва
    жалла инсон қўли билан ясалган уйларда яшамайди. Пайғомда
    айтилганидек:
  </p>
</div>

<div className="main_text">
  <p className="vitalic">“Осмон Менинг тахтим, ер пояндозим,</p>
  <p className="vitalic">Сизлар Менга қандоғ уй қурасизлар?</p>
  <p className="vitalic">Ёки Менинг истироҳатгоҳим қаерда?</p>
  <p className="vitalic">Буларнинг ҳаммасини Мен Ўзим яратган эмасманми?”</p>
</div>

<div className="main_text">
  <p>
    Эй қайсар ва ўжар халқ! Қулоғи ва юраги хатна бўлмаганлар! Қачонгача
    ота-боболарингизга ўхшаб Руҳ ул-қудсга қарши турасизлар? Оталарингиз
    қувғин қилмаган бирон пайғамбар борми ўзи? Солиҳ Кишининг келишини
    башорат қилганларни ҳам улар ўлдирган. Масиҳни эса сизлар хиёнат қилиб,
    ўлдирдингиз. Ҳа, Худо фаришталар орқали сизларга шариат берган,
    сизлар эса қасддан унга қарши иш қиласизлар».
  </p>
</div>

      <div className="paragraph_heading">
        <p>Мансурнинг ўлдирилиши</p>
      </div>

      <div className="main_text">
        <p>
          Кенгаш узвлари Мансурнинг сўзларидан қаттиқ ғазабланиб, жунбушга
          келдилар. Руҳ ул-қудсга тўлган Мансур эса, осмонга тикилиб Оллоҳнинг
          жалолини ва Оллоҳнинг ўнг томонида турган ҳазрати Исони кўрди.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Қаранглар! Мен арши аълони кўряпман, Инсон Ўғли Худонинг ўнг
          тарафида турибди!» деди у.
        </p>
      </div>

      <div className="main_text">
        <p>
          Кенгаш узвлари эса қўллари билан қулоқларини бекитиб, овозлари борича
          бақириб, Мансурнинг устига ёпирилдилар. Шаҳардан ташқарига олиб чиқиб,
          тошбўрон қилдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          (Мансурга қарши шаҳодат берганлар кийимларини ечиб Толут деган бир
          йигитнинг олдида қолдиришган эди.)
        </p>
      </div>

      <div className="main_text">
        <p>
          Тошбўрон қилаётганларида, Мансур: «Ё ҳазрати Исо, руҳимни қабул
          қилинг!» деб дуо қилди. Кейин тиз чўкиб, баланд овоз билан:
          «Ё Раббим, бу гуноҳни уларнинг бўйнига ёзма», деб жон берди.
        </p>
      </div>
    </main>
  );
}