'use client';

 

export default function RuhUlQudsningNuzuli() {
  return (
    <main className="stories relative">

      <div className="paragraph_heading">
        <p>Руҳ ул-қудснинг нузули</p>
      </div>

      <div className="main_text">
        <p>
          Ҳосил байрами куни ҳамма имонлилар бир жойга тўпланган эдилар.
          Бирданига тепадан бўрон эсаётгандай кучли бир товуш келиб, улар турган
          уйни тўлдирди. Кейин алангага ўхшаш нарсалар таралиб уларнинг ҳар бири
          устига қўнди. Ҳамма шогирдлар Руҳ ул-қудсга тўлиб, Руҳ қудрати билан
          ўзлари билмайдиган тилларда гапира бошладилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ўша пайтда ҳар юртлардан келган диндор яҳудийлар{' '}
          <span className="vitalic">байрамда иштирок этиш учун</span> Қуддусга
          ташриф буюрган эдилар. Гулдураган товушни эшитиб, бир тўда оломон,
          нима бўлди экан, деб югуриб келди. Расулуллоҳнинг шогирдлари ҳар хил
          тилларда гапираётганларини кўриб ҳайратдан лол қолдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Арабистондан келган одамлар ҳайрон бўлиб: «Бу жалилаликлар бизнинг
          тилимизни қаёқдан билади?» деса, осиёликлар ҳам: «Улар бизнинг
          тилимизда гапиряпти!» дер эдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Модлар ҳам, эломий ва байн-ун-наҳрайнликлар ҳам, Капдукия ва
          Парфиядан келганлар ҳам, понтусликлар, фрижияликлар, памфилияликлар,
          мисрликлар ва Лубноннинг Қирвон минтақасида яшайдиганлар, критликлар,
          ҳатто Румдан келган яҳудий ҳамда яҳудий динига кирганлар ҳам Оллоҳ
          таолонинг мўъжизалари ҳақида айтилаётган сўзларни ўз тилларида эшитиб
          турган эдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Халқ ҳайрон, «Нима бўляпти ўзи?» деб бир-бирларига қарар эдилар.
          Баъзилар эса: «Улар шароб ичиб маст бўлиб қолган» деб масхара қилди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шунда Сафвон (р.а.) ўн битта саҳоба билан олдинга чиқиб, баланд овоз
          билан дедилар:
        </p>
      </div>

      <div className="main_text">
        <p>
          «Эй Қуддус аҳли, эй биродарлар, ҳаммангиз қулоқ солинг!
          Баъзиларингиз булар шароб ичиб маст бўлиб қолган деяпсиз. Йўқ! Ахир
          соат энди тўққиз бўлди-ку! Сиз кўриб турган нарсани асрлар олдин Йоил
          пайғамбар башорат қилган эдилар:
        </p>
      </div>

      <div className="main_text">
        <p className="vitalic">
          «Давр ниҳоясида Мен ҳамма одамларим устига Ўз Руҳимни юбораман.
        </p>

        <p className="vitalic">
          Ўғил-қизларингиз Менинг Китобимни сўзлайди,
        </p>

        <p className="vitalic">
          Йигитларингиз рўё, қариялар кароматли тушлар кўради.
        </p>

        <p className="vitalic">
          Бандаларимни, хоҳ эркак бўлсин, хоҳ аёл, Ўз Руҳимга тўлдираман ва
          улар Менинг гапларимни гапирадилар.
        </p>

        <p className="vitalic">
          Ер-у осмонда оят-аломатлар нозил бўлади.
        </p>

        <p className="vitalic">
          Жанглар бўлиб, қонлар тўкилиб, ҳамма ёқ тутунга, оловга тўлади.
        </p>

        <p className="vitalic">
          Раббингизнинг шукуҳли Куни яқинлашар экан, офтоб қораяди, ой қон
          рангига киради.
        </p>

        <p className="vitalic">
          Раббисига нола қилган ҳар бир киши нажот топади».
        </p>
      </div>

      <div className="main_text">
        <p>
          Эй бани Исроил, қулоқ солинг! Оллоҳ таоло носиралик Исони ажойиб
          мўъжизалар, оят-аломатлар билан тасдиқлади. Буни ўзларингиз ҳам яхши
          биласизлар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Лекин Худонинг азалий режасига биноан, сизлар у кишини кофирлар қўлига
          топшириб, салибга михлаб ўлдирдингизлар. Азоб чекиб ўлганларидан сўнг,
          Оллоҳ таоло расулуллоҳни ўлим чангалидан халос қилиб, ҳаётга қайтарди.
          Чунки ўлим у кишини ўз ҳукмида ушлаб тура олмас эди.
        </p>

        <p>
          Мана энди расулуллоҳ ифтихорнинг энг олий мақомида, Оллоҳ таборак ва
          таолонинг ёнидадирлар. Раббимиз ваъда қилганидек, Руҳ ул-қудсни ўз
          муридларига ато этди. Буни бугун ўзларингиз кўриб ва эшитиб турибсизлар.
        </p>

        <p>
          Сиз ватандошларимга очиқ ва равшан маълум бўлсинки, сизлар салибга
          михлаган бу кишини Оллоҳ таоло бутун инсоният устидан Подшоҳ этиб
          тайинлаган».
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Уч минг кишининг имонга киргани</p>
      </div>

      <div className="main_text">
        <p>
          Сафвон (р.а.) нинг гаплари одамларга жуда қаттиқ таъсир қилди ва улар
          саҳобалардан: «Биз энди нима қилишимиз керак?» деб сўради.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Тавба қилинглар, Оллоҳ таолога юз тутинглар! Гуноҳларингиз
          кечирилиши учун ғусл олиб расулуллоҳга байъат қилинглар, — дедилар
          Сафвон (р.а.). — Шунда Оллоҳ сизларга ҳам Руҳ ул-қудс ҳадясини ато
          этади. Бу ваъдага сизлар ҳам, фарзандларингиз ҳам, узоқ юртларда
          яшаётган халқлар ҳам, Раббимиз даъват қилган ҳамма инсонлар ҳам дохил».
        </p>
      </div>

      <div className="main_text">
        <p>
          Шундан сўнг Сафвон (р.а.) одамлар билан узоқ муддат суҳбат қилдилар ва
          уларга: «Ғазаб йўлидан кетаётган бу наслдан ўзингизни қутқаринг», деб
          қайта-қайта таъкидладилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шу куни кўп одамлар Сафвон (р.а.) нинг гапларини қабул қилиб имон
          келтирдилар. Тахминан уч минг киши ғусл олиб расулуллоҳга байъат
          қилди. Улар бошқа имонлилар билан бирга саҳобалардан таълим олар, дуо
          ва нон синдиришда иштирок этар эдилар.
        </p>
      </div>


<div className='main_text'>
<p>Саҳобалар томонидан қилинаётган мўъжиза ва оятлар ҳамманинг қалбида қўрқув ва ҳурмат уйғотган эди. Барча имонлилар мунтазам равишда учрашиб турар, ўзларидаги бор нарсани бирга баҳам кўрар, мол-мулкларини сотиб, пулини муҳтожларга улашар эдилар. Ҳар куни Байтуллоҳга бориб, бирга ибодат қилишар эди. Уйларда йиғилиб, Оллоҳга шукроналар айтиб нон синдиришар, шодлик ва самимият билан таом ер эдилар.</p>
</div>
<div className='main_text'>
<p>Халқ ҳам уларни яхши кўрар, ҳар куни кимлардир тавба қилиб, нажот топаётган эди. Шу тариқа имонлилар сони кўпаяверди.</p>
</div>

    </main>
  );
}