'use client';


import { useSpeechBubbles } from '@/app/hooks/useSpeechBubbles';

export default function AntokiyadagiImonlilar() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble4',
    'bubble5',
    'bubble6',
  ]);

  return (
    <main className="stories relative">
      <div className="main_text">
        <p>
          Ғайрияҳудийлар имонга келгани ҳақидаги хабар тезда ҳамма ерга тарқалди.
          Бу гап ҳаворийларнинг қулоғига ҳам етиб келди ва Сафвон (р.а.)
          Қуддусга келганида, хатначилар гуруҳи у кишига: «Сен
          кестирилмаганларнинг уйига бориб улар билан еб ичибсан», деб таъна
          қилдилар.
        </p>
      </div>

      <div className="main_text">
        <p>Шунда Сафвон (р.а.) бўлиб ўтган воқеаларни уларга бир бошдан тушунтирдилар:</p>
      </div>

      <div className="main_text">
        <p>
          «Мен ўшанда Ёфода дуо қилаётган эдим. Бир пайт кўзимга рўё кўринди.
          Осмондан тўрт бурчаги осилган катта бир дастурхон тушди. Қарасам,
          дастурхонда ҳар хил ҳаром ҳайвонлар, калтакесаклар, қушлар бор экан.
        </p>
      </div>

      <div className="main_text">
        <p>Бирдан осмондан: "Тур, хоҳлаганингни сўйиб е!" деган овоз эшитилди.</p>
      </div>

      <div className="main_text">
        <p>
          Мен бўлсам: "Ё Раббим, емайман! Умримда ҳаром нарсани оғзимга еган
          эмасман" дедим.
        </p>
      </div>

      <div className="main_text">
        <p>
          Овоз эса менга: "Худо ҳалол қилган нарсани сен ҳаром дема!" деди. Бу
          нарса уч марта такрорланди, кейин эса дастурхон осмонга чиқиб кетди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шу пайтда мен турган уйга уч одам етиб келди. Улар мени Қайсарияга
          олиб кетиш учун келган элчилар экан. Худонинг Руҳи менга, иккиланмай
          улар билан бирга бор, деб айтди. Мана бу олти биродаримиз ҳам мен билан
          борди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Чақирган одамнинг уйига етиб борганимиздан сўнг, у ҳам кўрган нарсасини
          бизга айтиб берди. Маълум бўлишича, бир фаришта унга зоҳир бўлиб:
          «Ёфога одам юбор, у ердан Сафвон деган одамни уйингга чақир, у сенга,
          сен билан аҳли оиланг қандай қилиб нажот топишини айтади», дебди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Мен уларга гапира бошлаган эдим, худди биз сингари, уларнинг устига ҳам
          Худонинг Руҳи нузул қилди. Шунда мен ҳазрати Исонинг: «Яҳё пайғамбар
          одамларни ғуслга ошно қилди, сизлар эса Руҳга чўмасизлар», деган
          сўзини эсладим.
        </p>
      </div>

      <div className="main_text">
        <p>
          Агар Оллоҳ бизга берган айни ҳадяни ғайрияҳудийларга ҳам ато этган
          бўлса, мен кимманки Худонинг ишига тўғаноқ бўлсам?»
        </p>
      </div>

      <div className="main_text">
        <p>
          Сафвон (р.а.) нинг бу сўзларини эшитиб ҳамма жим бўлиб қолди. Кейин:
          «Демак Оллоҳ ғайри яҳудийларга ҳам тавба қилиб абадий ҳаётга киришни
          ато этибди-да", деб Оллоҳга ҳамду сано айтдилар.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Антокиядаги имонлилар</p>
      </div>

      <div className="main_text">
        <p>
          Мансур тошбўрон бўлгач, қувғинлар бошланди. Имонга кирган одамлар
          Қуддусдан қочиб чиқиб, Финиқия, Кипр ва Антокиягача бордилар ва у
          ердаги яҳудийларга (фақат яҳудийларга) Худонинг каломини етказдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Лекин қибрислик ва қирвонлик биродарлардан баъзилари Антокияга келиб,
          ғайрияҳудийларга ҳам ҳазрати Исо ҳақида гапира бошладилар. Оллоҳнинг
          қудрати уларга ёр эди ва ғайрияҳудийлардан кўп одам имонга келди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Қуддусдаги жамоа бу ҳақда эшитгач, ҳаворий Барнобо (р.а.) ни Антокияга
          юборишди. У киши келиб, Оллоҳнинг марҳаматини кўриб хурсанд бўлдилар
          ва ҳаммани устозимизга содиқ қолишга ташвиқ қилдилар. Барнобо (р.а.)
          меҳрибон, Руҳга тўлган имони мустаҳкам одам эдилар. Натижада яна анча
          одам имонга келди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ундан сўнг Барнобо Толут (р.а.) ни излаб Тарсусга боради ва у кишини
          Антокияга олиб келади. Иккаласи бир йил Антокияда яшаб, кўп одамларга
          таълим берадилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          (Расулуллоҳнинг шогирдларига “масиҳчалар”,{' '}
          <span className="vitalic">яъни кичкина масиҳлар</span> деган лақаб
          биринчи бор Антокияда берилган эди.)
        </p>
      </div>

      <div className="main_text">
      

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble4')}>
          Ўша кунларда бир нечта пайғамбар Қуддусдан Антокияга келди. Улардан
          бири, Ағобус деган киши мажлис пайти ўрнидан туриб Руҳ илҳоми билан
          бутун дунёда оғир бир очарчилик<sup>4</sup> бўлишини башорат қилди.
        </p>
          {openBubbles['bubble4'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble4')}
          >
            <p>
              <sup>4</sup> Бу қаҳатчилик кейин қайсар Клавдиюс императорлиги
              даврида юз берган.
            </p>
          </div>
        )}
      </div>

      <div className="main_text">
        <p>
          Шу сабабли, у ердаги имонлилар ҳар ким ўз қурбига яраша, Яҳузияда
          яшайдиган биродарларга ёрдам тўплашга қарор қилдилар ва ҳадяларни
          Барнобо билан Толут (р.а.) орқали Яҳузиядаги жамоат оқсоқолларига
          жўнатишди.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Қувғинларнинг кучайиши</p>
      </div>

      <div className="main_text">
        <p>Ўша кунларда подшоҳ Ҳирудис жамоатга қўшилган одамларни ҳибсга ола бошлади.</p>
      </div>

      <div className="main_text">
        <p>
          Яҳё (р.а.) нинг акаси Яъқуб (р.а.) ни қиличлаб ўлдирди. Кейин, яҳудий
          имомларининг бундан хурсанд бўлганини кўриб, Сафвон (р.а.) ни ҳам
          Қурбон ҳайитда ушлаб зиндонга ташлади. Қўриқлаш учун ҳар бирида
          тўрттадан аскар бўлган тўрт гуруҳни соқчи қилиб тайинлади.
        </p>
      </div>

      <div className="main_text">
        <p>
          (Ҳирудис: “Байрам ўтсин, байрамдан кейин уни халқ олдига олиб чиқиб
          тергов қиламан”, деб ўйлаган эди.)
        </p>
      </div>

      <div className="main_text">
        <p>Сафвон (р.а.) зиндонда экан, жамоа у учун тинмай Худога дуо қилаётган эди.</p>
      </div>

      <div className="main_text">
      
        <p className="cursor-pointer" onClick={() => toggleBubble('bubble5')}>
          Байрам ҳам ўтди. Лекин суд бўлишдан бир кун олдин, тунда{' '}
          <span className="vitalic">қизиқ бир воқеа содир бўлди.</span> Сафвон
          (р.а.) икки аскарнинг орасида занжирланган ҳолда ухлаб ётган эдилар.
          Зиндон эшиги олдида ҳам қоровуллар турган эди.<sup>5</sup>
        </p>
          {openBubbles['bubble5'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble5')}
          >
            <p>
              <sup>5</sup> Ривоят қилишларича Сафвон (р.а.) ни битта эмас,
              иккита занжир билан боғлаган эканлар.
            </p>
          </div>
        )}

      </div>

      <div className="main_text">
        <p>
          Бир вақт бирдан ҳужранинг ичи ёриди ва Оллоҳнинг фариштаси зоҳир
          бўлиб, Сафвон (р.а.) нинг биқинини ниқтади: «Тур, тез бўл!»
        </p>
      </div>

      <div className="main_text">
        <p>Шу заҳоти Сафвон (р.а.) нинг қўлидаги занжирлар узилиб ерга тушди.</p>
      </div>

      <div className="main_text">
   

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble6')}>
          «Белбоғингни боғла, чориғингни кий». Сафвон (р.а.) айтилгандек
          қилдилар. Фаришта кейин: «Чойшабингни<sup>6</sup> ёпиб орқамдан юр!»
          деб буюрди.
        </p>
             {openBubbles['bubble6'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble6')}
          >
            <p>
              <sup>6</sup> Баъзи таржималар "чопон" деб таржима қилган. У
              замонларда бу кийим узун тўртбурчак матоҳ бўлиб, одамлар уни
              устларига ўраб совуқдан сақланишган.
            </p>
          </div>
        )}
      </div>

      <div className="main_text">
        <p>
          Сафвон (р.а.) фариштага эргашиб, зиндондан чиқди. Кетар эканлар, у
          киши "мен туш кўряпман", деб ўйлар эдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Биринчи ва иккинчи қоровулхонадан ўтиб, кўчага олиб чиқадиган темир
          дарвозага келдилар. Дарвоза ўз-ўзидан очилди. Ташқарига чиқиб кўчанинг
          охирига келганларида фаришта бирданига ғойиб бўлди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шунда Сафвон (р.а.) ўзига келиб: «Раббимиз дарҳақиқат фариштасини
          юбориб, мени Ҳирудис билан яҳудийларнинг қўлидан қутқарибди!» дедилар
          ва Яҳё Миррихнинг онаси Марямнинг уйига бордилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          У ерда анча одам дуо учун йиғилган эди. Дарвозани тақиллатган эдилар,
          Рудо деган хизматкор қиз: «Ким?» деб ташқарига чиқди. Сафвон (р.а.)
          нинг овозини таниб қувониб кетди ва дарвозани очиш ўрнига ичкарига
          қараб югуриб ҳаммага: «Сафвон биродаримиз келди!» деб хабар берди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Улар ишонмай: «Нима деяпсан, ақлинг жойидами?» дер эдилар. Қиз гапини
          такрорлайвергач, «Балки унинг фариштаси келгандир», дедилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бу пайтда Сафвон (р.а.) дарвозани чертишни давом эттирар эдилар. Ниҳоят
          келиб дарвозани очдилар. Очдилару у кишини кўриб ҳайрон бўлиб қолдилар.
          Сафвон (р.а.) уларга жим бўлинглар деб ишора қилдилар ва нима
          бўлганини, Худо зиндондан қандай олиб чиққанини гапириб бердилар.
          Кейин: «Буни Яъқубга ва бошқа биродарларга айтинглар», деб бошқа жойга
          кетдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Эртасига зиндонда катта ғавғо кўтарилди. Ҳирудис, Сафвон (р.а.) ни
          топинглар, деб фармон берди. Тополмагандан сўнг, қоровулларни сўроқ
          қилиб, қатл этди.
        </p>
      </div>
    </main>
  );
}