'use client';

import '../../../qisas-uzb/stories.css';
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function Ishmael() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble1',
    'bubble2',
    'bubble3',
    'bubble4',
    'bubble5',
    'bubble6',
  ]);

  return (
 
        <main className="stories relative">
          <div className="div_with_borders">
            <p className="boldItalic">
              «Ва китобда Исмоилни эсла. Албатта, у ваъдасига содиқ ҳамда Расул
              ва Набий бўлган» (Марям сураси 19:54).
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble1'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble1')}
              >
                <p>
                  <sup>1</sup> Масалан, Суҳайлий “Равд ул-унуф” китобида,
                  Абулфидо “Ал-бидоя ван-ниҳоя” китобида, Табарий ўзининг “Тарих”
                  асарида. Салабий ёзишича, Соро Биби бир сафар ҳатто яниб:
                  “Сен энди мен билан бир маконда яшамаяжаксан” деб туриб
                  оладилар («Ароис» китоби, 81-бет).
                </p>
              </div>
            )}

            <p
              className="vitalic cursor-pointer "
              onClick={() => toggleBubble('bubble1')}
            >
              Соро онамиз Ҳожар Бибини рашк қилар эди. Бу ҳақда кўп олимлар баён
              этганлар.
              <sup>1</sup> Табарийнинг ёзишича, Соро Биби бир эмас, икки марта
              Ҳожар онамизни уйдан қувганлар.
            </p>

            <p>
              Бир куни Иброҳим (а.с.) ўғли Исҳоқнинг сутдан чиқиш муносабати
              билан катта бир зиёфат берди. Шунда Соро Биби, Ҳожар онамизнинг
              ўғли Исмоилнинг зиёфатда чақ-чақлашиб ўтирганини кўриб, Иброҳим
              (а.с.) нинг олдига борди-да: «Ҳожарни ўғли билан бирга ҳайдаб
              юборинг, чўрининг ўғли менинг ўғлим оладиган меросга шерик
              бўлмайди», деб талаб қилади.
            </p>

            <p>
              Бу гапдан расулуллоҳ жуда қаттиқ хафа бўлдилар. Ахир, Исмоил
              (а.с.) ҳам у кишининг ўғли эди-да! Лекин Оллоҳ расулуллоҳга ваҳий
              нозил қилиб деди: «Соронинг айтганини қил. Чунки зурриятинг ҳақида
              берган ваъдам Исҳоқ орқали давом этади. Исмоил ва Ҳожар учун ҳам
              ташвишланма. Мен уларни сақлайман. Исмоилнинг наслидан катта бир
              халқ яратаман. Чунки у ҳам сенинг фарзандинг», деди.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble2'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble2')}
              >
                <p>
                  <sup>2</sup> Афиф Абдул-Фаттоҳ Табборанинг “Маъал-анбия
                  фил-Қуръанил-карим” китобида ёзилишича, Оллоҳ субҳанаҳу ва
                  таоло Соронинг истагини қабул қилиб, Иброҳим (а.с.) га Ҳожар
                  онамизни ўғли билан бирга бошқа манзилга кўчиришни амр қилган.
                </p>
              </div>
            )}

            <p
              className="cursor-pointer "
              onClick={() => toggleBubble('bubble2')}
            >
              Ҳа, бу ҳам Оллоҳдан келган бир синов
              <sup>2</sup> эди. Фарзанддан айрилиш осонми? Ахир Исмоил (а.с.) —
              Иброҳим пайғамбарнинг тўнғич ўғли эдилар.
            </p>
          </div>

          <div className="paragraph_heading">
            <p>ИБРОҲИМ (А.С.) НИНГ ДУОСИ</p>
          </div>

          <div className="main_text">
            <p className="vitalic">Қуръони каримда расулуллоҳнинг дуоси ёзилган:</p>

            <p className="boldItalic">
              «Эй Раббимиз, ҳақиқатда мен ўз зурриятимни сенинг муҳаррам уйинг
              ёнига, гиёҳсиз водийга жойлаштирдим. Эй Раббимиз, намозда муқим
              бўлишлари учун, бас, Ўзинг одамлардан баъзи кишилар қалбини уларга
              талпинадиган қил ва уларни мевалардан ризқлантир. Шояд шукр
              қилсалар»
              <span className="vitalic"> (Иброҳим сураси 14:37).</span>
            </p>

            <p className="vitalic">
              Ҳожар Биби билан Исмоил (а.с.) янги манзилга кўчиб келганларидан
              сўнг Оллоҳ таоло Ўзи уларга ғамхўрлик қилади, ҳифзу паноҳида
              асрайди. Чўлда булоқнинг пайдо бўлиши ҳам Оллоҳнинг марҳаматига бир
              далилдир.
            </p>
          </div>

          <div className="paragraph_heading">
            <p>ЧЎЛДА БУЛОҚ ЧИҚИШИ</p>
          </div>

          <div className="main_text">
            {openBubbles['bubble3'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble3')}
              >
                <p>
                  <sup>3</sup> Бухорий, «Саҳиҳ», 4-жилд, 113-бет.
                </p>
              </div>
            )}

            <p
              className="vitalic cursor-pointer "
              onClick={() => toggleBubble('bubble3')}
            >
              Пайғамбаримиз (с.а.в.) нинг ҳадисларида ёзилишича, Ҳожар биби
              Исмоил (а.с.) ни бир бутанинг соясига ётқизиб, мешни бир шохга
              осади. Ўзи ҳам, боласи ҳам ана шу мешдан сув ичар эдилар.
              <sup>3</sup> Бир муддатдан сўнг сув тамом бўлди.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble4'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble4')}
              >
                <p>
                  <sup>4</sup> Азрақий. “Аxбори Макка”, 1-жилд, 55-бет.
                </p>
              </div>
            )}

            <p
              className="vitalic cursor-pointer "
              onClick={() => toggleBubble('bubble4')}
            >
              Сув тугагач, Ҳожар (р.а.): “Боламнинг ўлишини кўрмай”, деб бироз
              масофа нарига бориб ўтиради.
              <sup>4</sup>
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble5'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble5')}
              >
                <p>
                  <sup>5</sup> Китобларда ёзилишича, бу икки тепа — Сафо ва Марва
                  тепаликлари эди. Ўшанда Ҳожар Биби бу икки тепа орасида етти
                  марта бориб келган экан (Имом Бухорий, Байҳақий, Қуртубий ва
                  бошқалар).
                </p>
              </div>
            )}

            <p
              className="vitalic cursor-pointer "
              onClick={() => toggleBubble('bubble5')}
            >
              Кейин бир тепаликка чиқиб сув излаб атрофга боқади. Бирор товуш
              эшитармиканман, деб ҳар тарафга тикилади, лекин на бир сес
              эшитилади ва на бирор кимса кўринади. Кейин чопиб пастга тушади-да
              кейинги тепаликнинг устига чиқади, у ерда ҳам жавдираб атрофга
              боқади, лекин ҳеч кимни кўрмайди. Шу тариқа она зор-зор йиғлаб икки
              тепа орасида сарсон бўлади.
              <sup>5</sup>
            </p>

            <p className="vitalic">
              Шунда Оллоҳнинг фариштаси аён бўлиб: «Ҳожар, Ҳожар, нега йиғлайсан?
              Қўрқма, додинглар арши аълога етди. Қани тур, болани турғиз!
              Оллоҳ унинг наслидан буюк халқ яратур», деди.
            </p>

            <p className="vitalic">
              Оллоҳ ўша ерда улар учун чашма очган, лекин Ҳожар Биби уни ҳали
              кўраётгани йўқ эди. Бир вақт Худо унинг назарини чашмага қаратди.
              Қараса сув! Ҳаётбахш сув! Дарров бориб сувдан ичди. Кейин мешни
              тўлдириб, ўғлига ичирди. Сув адо бўлмас, ердан қайнаб чиқишда
              давом этарди.
            </p>
          </div>

          <div className="main_text">
            {openBubbles['bubble6'] && (
              <div
                className="speech-bubble"
                onClick={() => toggleBubble('bubble6')}
              >
                <p>
                  <sup>6</sup> Байҳақий, «Далоил ун-нубувия».
                </p>
              </div>
            )}

            <p
              className="vitalic cursor-pointer "
              onClick={() => toggleBubble('bubble6')}
            >
              Шундоғ қилиб, Оллоҳ таоло ҳамиша уларга ёр бўлди. Исмоил (а.с.)
              чўлда ўсиб-улғайиб, моҳир тирандоз бўлдилар. Онаси у кишини
              кейинчалик мисрлик бир қизга уйлантиради.
              <sup>6</sup>
            </p>
          </div>
        </main>
 
  );
}