'use client';

 
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function Yusha() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble1',
    'bubble2',
    'bubble3',
  ]);

  return (
    <main className="stories relative">
      <div className="main_text">
        <p className="boldItalic">
          «Дарҳақиқат, Биз бани Исроилга Китоб — Таврот, ҳикмат ва
          пайғамбарлик ато этдик ва уларни ҳалол-пок нарсалардан
          ризқлантирдик ҳамда уларни барча оламлардан устун қилдик»{' '}
          <span className="vitalic">
            (Қуръон, Жосия сураси, 45:16).
          </span>
        </p>
      </div>

      <div className="paragraph_heading">
        <p>«Мен сени ҳеч қачон тарк этмайман”</p>
      </div>

      <div className="main_text">
        <p>
          Мусо пайғамбар вафот этганларидан сўнг Оллоҳ таоло Юъшо (а.с.) га:
          «Ўрдун дарёсининг нариги тарафига ўтинглар, Мен сизларга ваъда қилган
          юртга киринглар», деб ваҳий юборди.
        </p>

        <p>
          «Мен бу ўлканинг ҳаммасини сизларга бердим. Жануб чўлидан Лубнон
          тоғларигача, шимоли-шарқда буюк Фурот дарёсигача ҳамма ерлар
          сизларники бўлади.
        </p>

        <p>
          Қўрқма, Мен Мусо билан қандай бирга бўлган бўлсам, сен билан ҳам
          шундай бирга бўламан. Бутун умр ҳеч ким сенга қарши туролмайди.
        </p>

        <p>
          Менинг амрларимга, Мусо орқали нозил қилган қонунларимга риоя қил.
          Ишларим самарали бўлсин десанг, улардан ўнгга ҳам, чапга ҳам бурилма.
          Китобдаги калималар оғзингдан тушмасин, уларни тўлиқ адо этиш учун
          кечаю кундуз улар ҳақида ўйла. Шунда йўлларинг очилиб, ишларинг
          баракали бўлади.
        </p>

        <p>
          Дадил бўл, ҳеч нарсадан қўрқма! Мен сени ҳеч қачон тарк этмайман, ҳеч
          қачон ёлғиз қолдирмайман».
        </p>

        <p></p>
      </div>

      <div className="main_text">
        {openBubbles['bubble1'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble1')}
          >
            <p>
              <sup>1</sup> Канъон юрти Ўрдун дарёсининг нариги тарафида эди.
            </p>
          </div>
        )}

        <p
          className="cursor-pointer"
          onClick={() => toggleBubble('bubble1')}
        >
          Бу гапларини эшитгач Юъшо (а.с.) оқсоқолларни чақириб:
          «Халққа айтинглар, озиқ-овқатларини тайёрласин. Ўрдун дарёсининг
          нариги тарафига ўтамиз, Раббимиз бизга берган ерни қўлга оламиз!»
          дедилар.<sup>1</sup>
        </p>
      </div>

      <div className="paragraph_heading">
        <p> Фоҳишанинг уйида </p>
      </div>

      <div className="main_text">
        <p>
          Юъшо пайғамбар кейин икки кишини Ариҳога Канъон юртини кўриб келиш
          учун жўнатадилар. Айғоқчилар шаҳарга кириб, кечани Раҳоба деган
          фоҳиша аёлнинг уйида ўтказишади.
        </p>

        <p>
          Уларни кўрган одамлар шаҳар амирига: «Бугун ибронийлар айғоқчилик
          қилиш учун шаҳримизга келди», деб хабар берадилар. Амир уларни тутиш
          учун Раҳобанинг уйига одам юборди.
        </p>

        <p>
          Раҳоба эса ибронийларни томга олиб чиқиб, зиғирпоя тагига
          яширди-да, келган одамларга:
        </p>

        <p>
          «Тўғри, икки одам уйимизга келган эди. Фақат қаердан келганини
          билмаган эдим. Кечаси дарвоза бекиладиган пайтда чиқиб кетишди.
          Қаерга кетишганини ҳам билмайман. Агар тез ҳаракат қилсангиз, етиб
          оласиз», деди.
        </p>

        <p>
          Шаҳарликлар уларни қидириб, Ўрдун дарёсига йўл олдилар. Улар кетиши
          билан шаҳар дарвозалари ҳам тақа-тақ ёпилди.
        </p>

        <p>
          Кейин Раҳоба томга, меҳмонларнинг олдига чиқди-да: «Оллоҳ шу юртни
          сизларга берган, биламан, — деди. — Бизникилар ҳаммаси сизлардан
          қўрқади. Оллоҳ сизлар учун Қизил Денгизни бўлганини, амўрийларни
          мағлуб қилганини эшитдик. Шунинг учун бу ердаги одамлар сизлардан
          ваҳимада. Сизлар сиғинадиган худо ҳақиқатан кучли экан!» деди.
        </p>

        <p>
          Кейин: «Мана, мен сизларга яхшилик қилдим. Энди сизлар ҳам менинг
          уйимдагиларга яхшилик қиламиз, деб қасам ичинглар. Ота-онам,
          ака-сингилларимни бола-чақаси билан тирик қолдирамиз, деб ваъда
          беринглар», деб илтимос қилди.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>ҚИЗИЛ АРҚОН</p>
      </div>

      <div className="main_text">
        <p>
          «Яхши, — дейишди меҳмонлар. — Сизларга бирор нарса бўлгудай бўлса,
          Оллоҳ жонимизни олсин. Фақат сен биз ҳақимизда ҳеч кимга ҳеч нарса
          дема. Оллоҳ бу ерни бизга берганида сенга ҳам,
          қариндош-уруғларингга ҳам яхшилигингни қайтарамиз».
        </p>

        <p>
          Раҳобанинг уйи шаҳар деворига ёпишган, деразаси ташқарига қараган эди.
        </p>

        <p>
          «Адирларга бориб, уч кун яшириниб ётинглар, — деб маслаҳат берди
          Раҳоба. — Сизларни излаётганлар қайтиб кетгандан кейин ўз
          йўлингизга кетаверасиз. Ҳозир шаҳар дарвозалари берк. Мен сизларни
          арқонга боғлаб деразадан тушириб юбораман».
        </p>

        <p></p>
      </div>

      <div className="main_text">
        {openBubbles['bubble2'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble2')}
          >
            <p>
              <sup>2</sup> Элчилар кетгандан сўнг Раҳоба қизил арқонни
              деразасига боғлаб қўйди.
            </p>
          </div>
        )}

        <p
          className="cursor-pointer"
          onClick={() => toggleBubble('bubble2')}
        >
          Шунда меҳмонлар Раҳобага: «Биз қайтиб келамиз. Ўшанда мана шу қизил
          арқонни<sup>2</sup> деразангга осиб қўй, — дейишди. — Ота-онангни,
          ака-ука, опа-сингилларингни уйингга йиғ. Йиғмасанг ё бизни сотиб
          қўйсанг, ичган қасамимиздан озодмиз. Бирортаси эшигингдан ташқарига
          чиқса ўлимига ўзи жавобгар бўлади, гуноҳи бизнинг бўйнимизга эмас.
          Лекин агар уйингда ўтирган одамлардан бирортаси ўлса, биз
          жавобгармиз».
        </p>

        <p>
          Кейин Юъшо (а.с.) нинг олдларига қайтиб келиб, бўлган воқеаларнинг
          ҳаммасини баён этдилар ва: «Ҳақиқатан ҳам Оллоҳ бутун Канъон халқини
          бизга таслим қилмоқчи. У ердагиларнинг ҳаммаси биздан қаттиқ
          қўрқувда», дедилар.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Ўрдун дарёси бўйида</p>
      </div>

      <div className="main_text">
        <p>
          Эртаси куни эрталаб Юъшо (а.с.) бутун Исроил халқини олиб йўлга
          чиқдилар ва Ўрдун дарёсига келиб қароргоҳ қурдилар.
        </p>

        <p>
          Ўша ерда халқ уч кун дам олди. Учинчи кун қабила бошлиқлари қароргоҳ
          бўйлаб юриб, одамларни:
        </p>

        <p>
          «Руҳонийлар Аҳд сандиғини кўтариб йўлга тушиши билан орқасидан
          юринглар. Фақат сизлар билан сандиқ орасида икки минг тирсак масофа
          қолсин. Ундан яқинроқ кела кўрманглар», деб огоҳлантиришди.
        </p>

        <p>
          Кейин ҳазрати Юъшо халққа: «Покланинглар, эртага Оллоҳнинг
          мўъжизасини кўрасизлар», дедилар.
        </p>

        <p></p>
      </div>

      <div className="main_text">
        {openBubbles['bubble3'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble3')}
          >
            <p>
              <sup>3</sup> Ҳосил вақтида Ўрдун дарёси ҳар доим тўлиб тошиб
              оқар эди.
            </p>
          </div>
        )}

        <p
          className="cursor-pointer"
          onClick={() => toggleBubble('bubble3')}
        >
          Эртасига эса: «Дарёнинг нариги қирғоғига ўтамиз, — деб эълон
          қилдилар. — Раббул-оламийн менга, руҳонийлар оёғи сувга тегиши билан
          сув тўхтаб, қуруқлик очилади, деб айтди. Эгамиз Ўзи бизга йўл очиб
          беради», дедилар.<sup>3</sup>
        </p>
      </div>

      <div className="paragraph_heading">
        <p>ДАРЁДАГИ МЎЪЖИЗА</p>
      </div>

      <div className="main_text">
        <p>
          Шундай қилиб, руҳонийлар Аҳд сандиғини кўтариб йўлга тушдилар.
        </p>

        <p>
          Уларнинг оёғи сувга тегиши билан оқиб келаётган сув таққа тўхтади —
          Адама шаҳри олдида баланд девор бўлиб йиғилди.
        </p>

        <p>
          Оқиб кетаётган сув эса Ўлик Денгизга қараб ғойиб бўлди. Шу тарзда
          Бани Исроил дарёнинг нариги тарафига ўтиб олди. То ҳамма ўтиб
          бўлмагунча, Аҳд сандиғини кўтарган руҳонийлар ўзан ўртасида
          қимирламай турдилар.
        </p>

        <p>
          Ҳамма ўтиб бўлгач Оллоҳ таоло Юъшо (а.с.) га: «Руҳонийларга айт,
          дарёдан чиқсинлар», деб амр қилди.
        </p>

        <p>
          Руҳонийлар қуруқ ерга қадам қўйишлари билан Ўрдун суви яна жойига
          қайтиб, олдингидай тўлиб-тошиб оқа бошлади. Ўшанда биринчи ойнинг
          ўнинчи куни эди. Бани Исроил Ариҳо шаҳрининг шарқ томонида, Гилгалда
          қароргоҳ қурди.
        </p>

        <p>
          Ҳадемай “ибронийлар худоси Ўрдунни тўхтатиб қўйибди! То улар
          дарёдан ўтмагунча дарё сувини юрғизмабди!” деган хабар ҳамма ёққа
          тарқалди, амўрий ва канъоний подшоҳларининг қулоғига ҳам етиб борди.
          Ҳаммани қўрқув босган, ҳамма хавотирда эди.
        </p>
      </div>
    </main>
  );
}