'use client';



export default function HokimHuzurida() {
  return (
    <main className="stories relative">
      <div className="main_text">
        <p>
          Қайсарияга етиб келиб Толут (р.а.) ни мактуб билан бирга ҳокимга
          топширишди. Ҳоким мактубни ўқиб, Толут (р.а.) дан: «Қаердансиз?»
          деб сўради.
        </p>
      </div>

      <div className="main_text">
        <p>«Қилиқиядан», деб жавоб берди у.</p>
      </div>

      <div className="main_text">
        <p>
          Ҳоким: «Даъвогарларингиз келгандан сўнг ишингизни кўриб чиқамиз»,
          деди. Кейин: «Уни Ҳирудиснинг қасрига жойлаштириб, назорат остида
          сақланглар!» деб буйруқ берди.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Ҳоким ҳузурида</p>
      </div>

      <div className="main_text">
        <p>
          Орадан беш кун ўтгач, Толут (р.а.) га қарши айбловларни ҳокимга
          тақдим қилиш учун, олийруҳоний Ҳаноё бир нечта оқсоқол ва Тертуллус
          деган фиқҳ олими билан бирга Қайсарияга етиб келди. Тертуллус деди:
        </p>
      </div>

      <div className="main_text">
        <p>
          «Муҳтарам Феликс жаноблари, сизнинг ҳокимиятингиз даврида биз
          яҳудийлар тинчлигу амниятда яшаб келяпмиз. Сизнинг соянгизда
          миллатимиз тараққий этмоқда. Ҳамиша, ҳамма жойда халқимиз сиздан
          ғоят миннатдор.
        </p>
      </div>

      <div className="main_text">
        <p>
          Қимматли вақтингизни олмаслик учун, бу одамга қарши қўйилган айблар
          билан сизни таништирсам.
        </p>
      </div>

      <div className="main_text">
        <p>
          У вабодек хавфли бир фитначи одам. Насронийлар деб аталмиш бидъатнинг
          раҳбари ва шу кунларда дунё бўйлаб яҳудийларни Рум давлатига қарши
          гиж-гижлаётир.
        </p>
      </div>

      <div className="main_text">
        <p>
          У ҳатто Байтуллоҳни ҳам булғашга уринди. Биз уни ўша пайтда қўлга
          олдик.
        </p>
      </div>

      <div className="main_text">
        <p>
          Агар сўроқ қилсангиз, биз қўйган айбларнинг тўғри эканига ўзингиз
          амин бўласиз».
        </p>
      </div>

      <div className="main_text">
        <p>Бошқа яҳудийлар ҳам Тертуллуснинг гапларини тасдиқладилар.</p>
      </div>

      <div className="main_text">
        <p>
          Кейин навбат Толут (р.а.) га келди. Ҳоким ўзингни ҳимоя қил, деб
          ишора қилгач, у киши сўз бошладилар:
        </p>
      </div>

      <div className="main_text">
        <p>
          «Ҳоким жаноблари, сиз кўп йиллардан бери халқимизга қозилик
          қилгансиз. Шу сабабдан мен сизнинг ҳузурингизда ишонч билан ўзимни
          ҳимоя қила оламан.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ибодат учун Қуддусга борганимга ўн икки кундан ошгани йўқ. Сиз буни
          осонликча текшира оласиз. Мен на Байтуллоҳда, на тиловатхоналарда,
          на шаҳарнинг бирон жойида биров билан баҳслашганим йўқ.
          Атрофимга одам йиғмадим. Бу кишилар, менга қарши қўйган айбларини
          исбот этишолмайди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Лекин эътироф этиб айтишим керакки, мен дарҳақиқат улар бидъат деб
          атаётган Тариқат шогирдиман. Ота-боболарим каби Оллоҳнинг
          ибодатидаман. Таврот қонунларига, пайғамбар битикларига имон
          келтирганман. Мана шу кишилар каби, солиҳу фосиқларнинг тирилишига
          ишонаман. Шу сабабдан Оллоҳ олдида ҳам, инсонлар олдида ҳам
          виждонимни пок сақлашга ҳаракат қиламан.
        </p>
      </div>

      <div className="main_text">
        <p>
          Неча йил узоқда юриб, энди халқимга бир миқдор пул кўмак қилай,
          Оллоҳга қурбонлик атай, деб Қуддусга келган эдим. Мени
          айблаётганлар мени Байтуллоҳда таҳорат олаётган пайтимда кўрган.
          Ёнимда ҳеч қандай жанжал-тўполон ёки йиғилган оломон йўқ эди.
          Осиё вилоятидан келган бир неча киши бор эди. Агар мендан бирон
          шикояти бўлса, ҳозир улар шу ерда туриши керак эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ёки бўлмаса сўранг-чи, Олий Кенгаш мендан нима хато топибди?
          Менинг бор-йўқ айбим — ўликларнинг тирилишига ишонаман деганим.
          Шунинг учун бугун мени ҳукм қилишяпти».
        </p>
      </div>

      <div className="main_text">
        <p>
          Тариқат ҳақида кўп нарса биладиган Феликс муҳокамани кейинга
          қолдириб: «Арзингиз ҳақида қўмондон Лисюс келгандан сўнг қарор қабул
          қиламан», деди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Кейин юзбошига Толут (р.а.) ни назоратда сақлашни, лекин уни кўриш
          ва эҳтиёжини таъминлаш учун келадиган дўстларига эрк беришни
          буюрди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бир неча кундан сўнг, Феликс хотини Друсило билан (хотини яҳудий
          эди) Толут (р.а.) ни чақиртириб, расулуллоҳга бўлган имон ҳақида
          гапириб беришини сўради. Лекин гап солиҳлик, парҳезгорлик ва қиёмат
          мавзуларига ўтгач, Феликс қўрқиб кетиб: «Ҳозирча бас. Вақт
          топганимда сизни яна чақираман», деди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Унинг Толут (р.а.) дан пора олиш умиди ҳам йўқ эмас эди. Шунга
          тез-тез у кишини олдига чақириб, суҳбатлашиб туради. Икки йил шу
          тартибда ўтади.
        </p>
      </div>

      <div className="main_text">
        <p>
          Кейин Феликснинг ўрнини Пўркиюс Фестус эгаллайди. Феликс кетишдан
          олдин, яҳудийлар мендан хафа бўлмасин, деб Толут (р.а.) ни
          зиндонда қолдиради.
        </p>
      </div>
    </main>
  );
}