'use client';

 
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function BizEndiGayriyahudiylargaBoramiz() {
  const { openBubbles, toggleBubble } = useSpeechBubbles(['bubble8']);

  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>“Биз энди ғайрияҳудийларга борамиз”</p>
      </div>

      <div className="main_text">
        <p>
          Толут ва Барнобо (р.а.) лар тиловатхонадан чиқиб кетаётганларида, у
          ердаги одамлар: «Келаси шанба яна келинглар, бу ҳақда суҳбат қилайлик»,
          деб илтимос қилдилар. Ибодатга келган бир теъдод яҳудий ва ғайри
          яҳудийлар саҳобаларнинг орқасидан эргашишди. Саҳобалар улар билан
          анчагача суҳбат қилиб уларни Худонинг раҳматига таваккул қилишга
          ундадилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Келаси ҳафта шаҳарликларнинг деярли ҳаммаси Оллоҳнинг каломини эшитиш
          учун тўпландилар. Лекин яҳудий оқсоқоллар кўп одам келганига ҳасад
          қилиб, Толут (р.а.) ни ҳақорат қилиб, ёлғончига чиқардилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шунда саҳобалар жасурлик билан: «Худонинг Сўзини биз аввал сиз
          яҳудийларга етказишимиз керак эди, — дедилар. — Сизлар эса уни рад
          қилиб, абадий ҳаётга лойиқ эмаслигингизни кўрсатдингиз. Биз энди
          Каломни ғайри яҳудийларга овоза этамиз. Чунки Оллоҳ бизга мана бу
          амрни берган: “Мен сени миллатлар нури бўл, бутун дунё сен орқали
          нажот топсин, деб танладим”».
        </p>
      </div>

      <div className="main_text">
        <p>
          Ғайри яҳудийлар буни эшитиб, хурсанд бўлиб, Худога ҳамду сано
          айтдилар. Абадий ҳаёт учун танланганларнинг ҳаммаси имон келтирди,
          Худонинг каломи бутун минтақа бўйлаб тарқала бошлади. Имон келтираётган
          одамлар шодликка ва Илоҳий Руҳга тўлган эдилар.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Қўнияда</p>
      </div>

      <div className="main_text">
        <p>
          Яҳудий оқсоқоллар шаҳар раҳбарларини ва нуфузли диндор хотинларни
          саҳобаларга қарши қўзғаб, уларни Антокия шаҳридан ҳайдаб чиқардилар.
          Толут ва Барнобо (р.а.) лар бунга жавобан чориқларидаги шаҳар тупроғини
          қоқиб, Қўния шаҳрига кетдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Қўнияга келганларидан сўнг у ерда ҳам бир тиловатхонага кириб Худонинг
          Каломини айтдилар. Таъсири шунчалик бўлдики, ҳам яҳудийлардан, ҳам
          ғайри яҳудийлардан жуда кўп одам имонга келди. Лекин бошқа яҳудийлар,
          саҳобаларни ғайри яҳудийларга ёмонлаб, қарши қилиб қўйдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Толут ва Барнобо (р.а.) лар Қўнияда узоқ вақт бўлдилар, қўрқмай
          Оллоҳнинг марҳамати ҳақида одамларга ваъз қилдилар. Раббимиз уларга
          оят-мўъжизалар бериб, айтаётган гаплари ҳақиқат эканини исботлаётган
          эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шу билан шаҳар аҳли орасида бўлиниш юз берди: баъзилари яҳудий пешволар
          тарафида бўлса, баъзилари саҳобалар тарафда эди. Кейин яҳудий ва
          ғайрияҳудийлардан иборат бир тўда келиб саҳобаларни ушлаб тошбўрон
          қилмоқчи бўлди. Буни эшитган саҳобалар жон сақлаш учун Луқоунияга
          қочдилар. Листра, Дарба ва ўша минтақадаги қишлоқларга бориб одамларга
          Хушхабарни ваъз қилдилар.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Толут (р.а.) ни тошбўрон қилганлари</p>
      </div>

      <div className="main_text">
        <p>
          Листрада онадан шол туғилган, ҳеч қачон юрмаган бир чўлоқ киши бор
          эди. У Толут (р.а.) нинг гапларини диққат билан эшитди. Толут (р.а.)
          унинг шифо топиш учун имони борлигини кўриб, баланд овозда: «Ўрнингдан
          тур!» дедилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          У одам ирғиб туриб, юриб кетди! Буни кўрган халқ маҳаллий тилда:
          «Булар худолар! Худолар инсон қиёфасида шаҳримизга келибди!» деб
          бақира бошладилар. Улар Барнобо (р.а.) ни Зевс, Толут (р.а.) ни эса
          нотиқ бўлгани учун Ҳермес деб ўйлаган эдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шаҳар ташқарисида Зевс маъбади бор эди. Маъбаднинг руҳонийси оломон
          билан бирга гулчамбарлар ва ҳўкизлар олиб келиб, шаҳар дарвозасида
          саҳобаларга қурбонлик сўймоқчи бўлди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Барнобо ва Толут (р.а.) лар буни эшитгач, кўйлакларини йиртиб одамлар
          олдига югуриб чиқиб:
        </p>
      </div>

      <div className="main_text">
        <p>
          «Нима қиляпсизлар? -- деб бақиришди. -- Биз ахир сизлар каби инсонмиз!
          Биз сизга Оллоҳнинг хушхабарини олиб келдик! Бу беҳуда нарсалардан юз
          ўгириб, еру осмонни, денгизлару улардаги ҳамма нарсани яратган тирик
          Худога юз тутинглар, деб даъват қиляпмиз!
        </p>
      </div>

      <div className="main_text">
        <p>
          Худо ўтмишда ҳамма халқларни ўз ҳолига қўйган бўлса ҳам, Ўзи ҳақида
          шаҳодат беришни ҳеч қачон тўхтатган эмас. Вақтида ёмғир юборган,
          вақтида ҳосил етказган, етарлича ризқ бериб, юракларингизни шодликка
          тўлдирган...».
        </p>
      </div>

      <div className="main_text">
        <p>Шу гаплар билан улар зўрға халқни қурбонлик келтиришдан қайтардилар.</p>
      </div>

      <div className="main_text">
        <p>
          Бир неча кундан сўнг Антокия ва Қўниядан келган баъзи яҳудийлар,
          одамларни ўз томонига оғдириб, Толут (р.а.) ни тошбўрон қилдирдилар.
          Ўлди деб ўйлаб, танасини судраб шаҳар ташқарисига олиб бориб ташладилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Кейин биродарларимиз келиб, у кишининг атрофига йиғилдилар. Толут
          (р.а.) ҳушига келиб, ўрнидан турдилар. Шаҳарга қайтиб келиб, эртаси
          куни Барнобо билан бирга Дарбага қараб йўл олдилар.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Жамоаларга оқсоқоллар тайинлаш</p>
      </div>

      <div className="main_text">
        <p>
          Дарбага келганларидан сўнг, у ерда ҳам Хушхабар айтиб, кўп одамларни
          расулуллоҳга шогирд қилдилар. Кейин Листра, Қўния ва Антокия
          шаҳарларини қайта зиёрат қилишди ва йўл бўйи биродарларга далда бериб,
          имонда маҳкам туришга ташвиқ қилдилар. «Биз Оллоҳнинг Салтанатига кўп
          қийинчиликлар орқали кирамиз», деб насиҳат қилар эдилар. Йўл бўйи ҳар
          бир жамоага раҳбарлар тайин этдилар. Рўза ва дуолар билан уларни Оллоҳ
          таолонинг паноҳига топширдилар.
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble8'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble8')}
          >
            <p>
              <sup>8</sup> Улар шогирдлар билан шуғулланиш учун бироз муддат
              Антокияда қолиб кетишади.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble8')}>
          Кейин Писидия орқали Памфилияга қайтдилар. Паржада Каломни ваъз қилиб,
          сўнгра Анталияга бордилар. Шундан сўнг Суриянинг Антокиясига денгиз
          орқали қайтиб келишди. Улар бу хизматга шу ерда танланган ва бу узоқ
          сафарни шу ердан бошлаган эдилар. Антокияга<sup>8</sup> етиб келиб,
          жамоани бир ерга йиғиб, Худо улар орқали нималар қилганини, ғайри
          яҳудийларга имон эшикларини очганини айтиб бердилар.
        </p>
      </div>
    </main>
  );
}