'use client';

import '../../../qisas-uzb/stories.css';
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function YuzboshiningRasulullohgaImonKeltirishi() {
  const { openBubbles, toggleBubble } = useSpeechBubbles([
    'bubble1',
    'bubble2',
    'bubble3',
  ]);

  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>Юзбошининг расулуллоҳга имон келтириши</p>
      </div>

      <div className="main_text">
        {openBubbles['bubble1'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble1')}
          >
            <p>
              <sup>1</sup> У римликларнинг Италия деб аталмиш батальонида 100
              ҳарбийга бошлиқ бўлган.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble1')}>
          Қайсария шаҳрида Корнелиус деган бир художўй румий мансабдор бор
          эди.<sup>1</sup> Ўзи ҳам, оиласи ҳам художўй одамлар эди. Улар доим
          муҳтожларга ёрдам берар, Оллоҳга дуоларини канда қилмас эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бир кун тушдан кейин соат учларда, Худонинг фариштаси унга аён бўлиб:
          «Корнелиус», деди.
        </p>
      </div>

      <div className="main_text">
        <p>Корнелиус қаттиқ қўрқиб кетди: "Лаббай, ҳазратим?"</p>
      </div>

      <div className="main_text">
        <p>
          «Сенинг дуою эҳсонларинг Оллоҳ ҳузурида қабул бўлди. Сен энди Ёфога
          одам юбор, у ердан Сафвон деган одамни топиб уйингга олиб келишсин.
          Сафвон ҳозир денгиз бўйида яшовчи чармгар Шимъунникида меҳмон», деди
          фаришта.
        </p>
      </div>

      <div className="main_text">
        <p>
          Фаришта ғойиб бўлгач, Корнелиус навкарларидан иккитасини ва махсус
          муҳофизи бўлган бир художўй аскарини олдига чақиртирди. Уларга юз
          берган воқеани тушунтириб, Ёфога жўнатди.
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble2'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble2')}
          >
            <p>
              <sup>2</sup> Уй эгалари овқат пишираётган бўлса-да таом ҳали
              тайёр эмас эди.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble2')}>
          Эртаси кун, бу одамлар шаҳарга яқинлашаётганларида, Сафвон (р.а.) дуо
          қилиш учун том устига чиқди. Туш чоғи эди, Сафвон (р.а.) очқаганини
          ҳис қилди.<sup>2</sup> Шу пайт у кишининг кўзига рўё кўринди: осмон
          очилиб, тепадан катта бир дастурхон тўрт бурчагидан осилган ҳолда
          пастга тушаётган эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Дастурхон ичида ҳар хил ҳайвонлар, илону калтакесаклар ва қушлар бор
          эди. Ва бир овоз унга: «Сафвон, тур. Хоҳлаганингни сўйиб е!» деди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Сафвон (р.а.) эса: «Ё Раббим, еёлмайман. Мен ҳеч қачон ҳаром нарсани
          еган эмасман», деди. Овоз эса: «Оллоҳ ҳалол қилган нарсани сен ҳаром
          дема!» деди. Кейин яна: «Сафвон, тур, хоҳлаганингни сўйиб е», деди.
          Шу тариқа, уч марта такрорлангач, дастурхон осмонга чиқиб кўздан ғойиб
          бўлди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Сафвон (р.а.) ҳайратдан лол қолган эди. У на бу рўёнинг маъносини
          тушунди, ва на нима қилиши кераклигини англади. Бу пайтда Корнелиус
          юборган уч киши Сафвон турган уйни топиб келган, дарвоза олдида
          Сафвонни сўраётган эдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Сафвон (р.а.) нинг хаёли ҳали ҳам кўрган рўёда экан, Худонинг Руҳи
          унга деди: «Қара, уч киши сени излаб келди. Тур, пастга туш. Иккиланмай
          улар билан бирга кет, чунки уларни Мен юборганман».
        </p>
      </div>

      <div className="main_text">
        <p>
          Сафвон (р.а.) пастга тушиб, уларга: «Сизлар ахтараётган киши менман,
          нима мақсадда келдингизлар?» деди.
        </p>
      </div>

      <div className="main_text">
        <p>
          «Бизни Корнелиус деган юзбоши юборди. У киши солиҳ, Худодан қўрқадиган
          одам. Яҳудийлар ичида ҳам ҳурмати бор. Кеча у кишига Худонинг фариштаси
          нозил бўлиб, сизни ўз уйига чақиришни, гапларингизни эшитишни амр
          қилди."
        </p>
      </div>

      <div className="main_text">
        <p>
          Шундан сўнг Сафвон (р.а.) уларни ичкарига даъват этиб, бир кеча меҳмон
          қилди. Эртасига эса улар билан бирга Қайсарияга қараб йўлга чиқдилар.
          Ёфодаги имонлилардан бир нечтаси уларга ҳамроҳ бўлди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Қайсарияга етиб келганларида, Корнелиус ўз қариндошларию
          ёр-биродарларини йиғиб, уларни кутиб турган эди. Сафвон (р.а.) уйга
          кириши билан, Корнелиус у кишининг олдида ерга бош қўйиб таъзим қилди.
          Лекин Сафвон (р.а.): «Туринг, ундай қилманг! Мен ҳам сизга ўхшаган бир
          инсонман», деб уни турғизди. Шундан сўнг улар бошқалар ўтирган ички
          хонага кирдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Сафвон (р.а.) уларга шундоғ дедилар: «Биласизлар, шариат бўйича
          яҳудийлар учун ғайри яҳудийлар уйига боришга рухсат йўқ. Лекин Оллоҳ
          менга ҳеч кимни нажис ё нопок деб айтмаслик кераклигини кўрсатди.
          Шунинг учун эътироз билдирмай таклифингизга биноан уйингизга келдим.
          Энди айтингларчи, мени нима учун чақирдингизлар? »
        </p>
      </div>

      <div className="main_text">
        <p>
          Корнелиус деди: «Тўрт кун аввал, тақрибан шу пайтда, одат бўйича дуо
          қилаётган эдим. Бирдан олдимда нуроний либос кийган бир одам пайдо
          бўлди. У менга: "Корнелиюс, Худо дуоларингни эшитди, эҳсонларингни
          қабул қилди! Энди Ёфога одам юбор, Сафвонни уйингга чақир. У ҳозир
          денгиз бўйидаги чармгар Шимъуннинг уйида меҳмон", деди. Мен дарров
          олдингизга одам юбордим. Сиз ҳам марҳамат кўрсатиб уйимизга ташриф
          буюрдингиз. Мана энди ҳаммамиз, Худо сизга буюрган ҳамма гапларни
          эшитиш учун Худонинг ҳузурида турибмиз».
        </p>
      </div>

      <div className="main_text">
        <p>
          Сафвон (р.а.) дедилар: «Ҳа, Худо миллатчилик қилмас экан. Қайси
          миллатга тааллуқли бўлишимиздан қатъи-назар, ким агар Худодан қўрқса,
          тўғри иш қилса, даргоҳига қабул қиларкан.
        </p>
      </div>

      <div className="main_text">
        <p>
          Хабарингиз бор, Оллоҳ Бани Исроилга яқинда рисолат берди. Ҳазратимиз
          Исо ал-Масиҳ орқали тинчлик битимини эълон қилди. Одамлар энди Худо
          билан ярашиши мумкин. Бу пайғом Яҳё пайғамбарнинг байъати билан
          Жалилада бошланган эди, кейин бутун Яҳузияга овоза бўлди: яъни Оллоҳ,
          носиралик Исони подшоҳ этиб тайинлади, Ўз Руҳи билан, қудрати билан
          тўлдирди. У кишининг қилган ишларини, одамларга қандай шифо берганини
          биласизлар, чунки Худо у билан бирга эди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Биз саҳобалар у кишининг қилган ишларига шоҳидмиз. Улар устозимизни
          салибга михлаб ўлдирдилар. Лекин Оллоҳ учинчи куни у кишини тирилтириб
          халққа кўрсатди. Ҳаммага эмас, балки шоҳид бўлиш учун танлаган
          бандаларига-бизга кўрсатди. Тирилганидан сўнг, биз у киши билан бирга
          бўлдик, еб-ичдик. У киши бизга: "Ҳаммага овоза қилинглар, Оллоҳ мени
          ўликлару тириклар устидан қози қилиб тайинлаганини эълон қилинг. --
          дедилар. -- Мен ҳақимда ҳамма пайғамбарлар гувоҳлик берган, кимки
          имон келтирса, менинг номим билан гуноҳлари кечирилади"».
        </p>
      </div>

      <div className="main_text">
        <p>
          Сафвон (р.а.) ҳануз гапларини тугатмай туриб, тингловчиларнинг ҳаммасини
          Худонинг Руҳи қамради. Сафвон билан бирга келган яҳудийлар,
          ғайрияҳудийларга ҳам Руҳ неъмати берилганини кўриб ҳайрон қолдилар.
          Лекин шак қилишга ўрин йўқ эди, чунки уларнинг ўзга тилларда гапириб
          Худони улуғлаётганларини эшитиб турган эдилар.
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble3'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble3')}
          >
            <p>
              <sup>3</sup> Корнелиус ўшанда Сафвон (р.а.) га, бир неча кун шу
              ерда меҳмон бўлинг, деб илтимос қиладилар.
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble3')}>
          Кейин Сафвон (р.а.): «Бу одамлар ҳам биз каби Худонинг Руҳини олди.
          Уларнинг аҳдга киришига ким ҳам энди монеъ бўла олади?» дедилар ва
          уларни Исо Масиҳ номи билан ғусл қилдиришни буюрдилар. <sup>3</sup>
        </p>
      </div>
    </main>
  );
}