'use client';

import '../../../qisas-uzb/stories.css';
import { useSpeechBubbles } from '../../../hooks/useSpeechBubbles';

export default function BarnoboVaTolutningXizmatgaTayinlanishi() {
  const { openBubbles, toggleBubble } = useSpeechBubbles(['bubble7']);

  return (
    <main className="stories relative">
      <div className="paragraph_heading">
        <p>Ҳирудиснинг ўлими</p>
      </div>

      <div className="main_text">
        <p>
          Ҳирудис кейин Яҳузиядан Қайсарияга борди ва бир муддат ўша ерда бўлди.
          Бир куни Сур ва Сайдун шаҳарларидан бир ҳайъат унинг олдига ташриф
          буюради. Бу икки шаҳарга Ҳирудиснинг хусумати катта эди. Озиқ-овқат
          томондан Ҳирудиснинг юртига қарам бўлгани учун улар Ҳирудиснинг сарой
          вазири Балостуснинг розилигини топиб, Ҳирудисдан сулҳ сўрадилар.
          Ҳирудиснинг ҳузурига кирганларида Ҳирудис шоҳона либос кийиб, салтанат
          тахтида ўтириб, халойиққа маъвеза ўқиди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Охирида одамлар баланд овозда: «Бу инсон овози эмас, Худонинг овози!»
          деб олқишладилар. Шу онда уни Худо урди. Бадани қуртлаб у дунёга
          равона бўлди. Чунки у Оллоҳга эмас, ўзига ҳамду сано айтдирган эди.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Барнобо (р.а.) билан Толут (р.а.) нинг хизматга тайин этилиши</p>
      </div>

      <div className="main_text">
        <p>
          Худонинг каломи суръат билан ҳамма жойга ёйилар, имонлилар сони кундан
          кунга кўпайиб бораётган эди. Барнобо билан Толут (р.а.) Қуддусдаги
          вазифаларини бажариб Антокияга қайтдилар. Миррих лақабли Яҳёни ҳам
          ўзлари билан бирга олиб келдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Антокиядаги жамоада Барнобо (р.а.) , “Қаротан” лақабли Шимъун,
          қирвонлик Луқус, Ҳирудис подшоҳ билан бирга ўсган Маноҳим каби
          пайғамбар ва муаллимлар бор эди. Бир куни рўза тутиб дуо
          қилаётганларида, Худонинг Руҳи: «Барнобо билан Толутни Мен тайин этган
          иш учун ажратинглар», деди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шундан сўнг, яна рўза тутиб дуо қилганларидан кейин, уларнинг устига
          қўл қўйиб, хизматга тайинладилар. Барнобо ва Толут (р.а.) Руҳнинг
          ҳидояти билан сафарга чиқдилар. Аввал Сулукия бандарига бориб, у ердан
          кема билан Кипр оролига бордилар. Кипрда Саломис шаҳрига бориб, яҳудий
          тиловатхоналарида Худонинг каломини ваъз қила бошладилар. (Яҳё ҳам
          улар билан бирга эди, уларга хизмат қилиб юрар эди.)
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Пофас шаҳрида</p>
      </div>

      <div className="main_text">
        <p>
          Улар оролда шаҳарма-шаҳар кезиб, Худонинг каломини ваъз қилдилар ва
          ниҳоят Пофас шаҳрига етиб келдилар. У ерда ўзини пайғамбар деб даъво
          қиладиган Бар-Юъшо исмли бир яҳудий жодугарни учратдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Бар-Юъшо Кипр ҳокимининг (исми Сергиус Павлус) яқин одами эди. Доно
          киши бўлган ҳоким Худонинг каломини эшитгиси келиб, Барнобо билан Толут
          (р.а.) ни ҳузурига чақиртирди. Лекин Бар-Юъшо (юнонча оти Элимос)
          уларга қарши гаплар айтиб, ҳокимнинг имон келтиришига монеълик
          қилмоқчи бўлди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шунда Руҳга тўлган Толут (р.а.) унинг кўзига тик қараб дедилар: «Эй
          шайтоннинг боласи, бадзот ҳийлагар, яхшиликнинг душмани! Одамларни
          йўлдан уришни қачон бас қиласан? Энди Худо сени шундай урадики, бир
          қанча вақтгача кўр бўласан!»
        </p>
      </div>

      <div className="main_text">
        <p>
          Шу заҳоти унинг кўзи кўр бўлди. Тўрт томонга талпиниб, қўлидан ушлаб
          йўл кўрсатадиган одам излар эди. Ҳоким бу воқеани кўриб имонга келди,
          чунки Раббимиз таълимоти уни ҳайратга солган эди.
        </p>
      </div>

      <div className="paragraph_heading">
        <p>Писидиянинг Антокиясида</p>
      </div>

      <div className="main_text">
        <p>
          Толут (р.а.) кейин ҳамроҳлари билан кемага ўтириб, Пофасдан
          Памфилиянинг Паржа шаҳрига келдилар. Бу ерда Яҳё уларни ташлаб,
          Қуддусга қайтиб кетди. Барнобо билан Толут (р.а.) лар эса Писидия
          вилоятидаги Антокияга бордилар.
        </p>
      </div>

      <div className="main_text">
        {openBubbles['bubble7'] && (
          <div
            className="speech-bubble"
            onClick={() => toggleBubble('bubble7')}
          >
            <p>
              <sup>7</sup> Бу ерда маъно: "агар сизларда бизни
              рағбатлантирадиган, тасалли берадиган гапингиз бўлса".
            </p>
          </div>
        )}

        <p className="cursor-pointer" onClick={() => toggleBubble('bubble7')}>
          Шанба куни яҳудий тиловатхонасига киришди. Таврот ва пайғамбар оятлари
          тиловат қилингач, жамоа раислари уларга: «Биродарлар, агар айтадиган
          гапларингиз<sup>7</sup> бўлса, марҳамат», дейишди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Шундан сўнг Толут (р.а.) ўртага чиқиб гап бошладилар: «Эй Исроил
          фарзандлари ва художўй ғайри яҳудийлар! Гапларимга қулоқ солинг. Оллоҳ
          қадимда оталаримизни танлаб, Мисрда улардан катта бир халқ яратди.
          Кейин Ўз қудрати билан уларни Мисрдан олиб чиқди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Қирқ йил чўлда уларга ғамхўрлик қилди. Кейин Канъондаги етти халқни
          йўқ қилиб, уларнинг ерини бани Исроилга мерос қилиб берди. Буларнинг
          ҳаммасига тўрт юз эллик йил вақт кетди. Ундан сўнг, Сомуил пайғамбар
          давригача бани Исроилни ҳакамлар идора қилди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Халқ кейин: “Бизни подшоҳ бошқарсин!” деб талаб қилди. Шундан сўнг
          Худо уларга Бинямин қабиласидан Толут бинни Қайсни подшоҳ қилиб
          тайинлади. У қирқ йил подшоҳлик қилди. Худо уни олиб ташлаб, ўрнига:
          “Бу Менинг кўнглимдагидай инсон, Менинг гапларимга тўлиқ итоат этади”,
          деб Довудни подшоҳликка тайинлади. Кейин шу кишининг наслидан бани
          Исроилга ваъда қилган Нажотбахшни, ҳазрати Исони юборди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Ҳазратимиз келишидан олдин Яҳё пайғамбар бутун Исроил халқига тавба
          ғуслини ваъз қилди. Хизмати тугаётган пайтда халққа: «Сизлар мени ким
          деб ўйлайсизлар? Йўқ, мен у киши эмасман. Лекин у киши келаётир. Мен
          унинг чориқларини ечиб қўйишга ҳам лойиқ эмасман», дедилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Биродарларим, Оллоҳ таоло бу нажотни ҳаммамизга ато этди. Ҳам Иброҳим
          наслига, ҳам художўй ғайри яҳудийларга. Лекин Қуддусдагилар -- бани
          Исроилнинг оқсоқоллари -- расулуллоҳнинг ким эканлигини англамай, у
          кишини ўлимга маҳкум қилиб, ҳар шанба ўқиладиган пайғамбарлар каломини
          амалга оширдилар. Ўлим жазосига лойиқ биронта айб топмасалар ҳам,
          Пилотусга уни ўлдир, деб талаб қилдилар.
        </p>
      </div>

      <div className="main_text">
        <p>
          Башорат қилинган ҳамма нарса амалга ошгач, расулуллоҳни салибдан
          тушириб, сағанага қўйишди. Лекин Худо у кишини тирилтирди! Жалиладан
          расулуллоҳ билан бирга Қуддусга келганлар кўп кунлар мобайнида у
          кишини кўрдилар ва энди бани Исроилга бу ҳақда шаҳодат бермоқда.
          Бизнинг сизларга етказаётган хушхабаримиз ҳам шу: Худо расулуллоҳни
          тирилтириш орқали оталаримизга берган ваъдасини амалга оширди.
          Мазомирнинг иккинчи фаслида расулуллоҳ ҳақида бундоғ дейилган:
        </p>
      </div>

      <div className="main_text">
        <p className="vitalic">Мен юборган Подшоҳ сенсан,</p>
        <p className="vitalic">Бугун сени хизматимга тайин этдим.</p>
      </div>

      <div className="main_text">
        <p>
          Оллоҳ таоло расулуллоҳни ўлимдан тирилтирди, ўлмайдиган қилиб ҳаётга
          қайтарди. Бу ҳақда Китоб: “Довудга ваъда қилган муқаддас баракаларни
          сизлар учун амалга ошираман”, дейди.
        </p>
      </div>

      <div className="main_text">
        <p>
          Мазомирда яна: “Муқаддасингнинг қабрда чиришига йўл қўймайсан”, деб
          ёзилган. Лекин бу оят ҳазрати Довуд ҳақида эмас. Чунки Довуд
          алайҳис-салом ўз замонида Оллоҳнинг хизматини қилди, кейин ҳаётдан кўз
          юмди, дафн қилинди ва бадани чириб йўқ бўлди. Бу оят қайта тирилган,
          бадани чиримаган инсон ҳақида.
        </p>
      </div>

      <div className="main_text">
        <p>
          Биродарларим, қулоқ солинглар! Гуноҳларингизнинг кечирилиши расулуллоҳ
          орқалидур. Тангри таолонинг эълон қилаётган Хабари шу. Кимки
          расулуллоҳга имон келтирса, Таврот қила олмаган нарсага — гуноҳлардан
          оқланишга эришади. Эҳтиёт бўлинглар, мабодо пайғамбарлар айтган мана
          бу сўзлар бошингизга тушмасин:
        </p>
      </div>

      <div className="main_text">
        <p className="vitalic">
          Эй Худони масхара қилгувчилар, ҳайрат ичида ҳалок бўласиз,
        </p>
        <p className="vitalic">
          Чунки сиз яшаётган пайтда шундоқ бир иш қиламанки, ҳатто биров айтиб
          берса ҳам ишонмайсизлар».
        </p>
      </div>
    </main>
  );
}